[
    {
        "title": "Exercise snacks: a novel strategy to improve cardiometabolic health",
        "abstract": "Exercise snacks are isolated bouts of vigorous exercise lasting ≤1 min and performed periodically throughout the day. Efficacy has been demonstrated in small proof-of-concept studies. Exercise snacks seem to be well tolerated and can offset the detrimental effects of prolonged sitting on metabolic outcomes and vascular function. The cardiometabolic health benefits of exercise snacks are apparent using both laboratory-based cycling protocols and more practical approaches involving stair climbing. The application of HIIT/SIT principles to more feasible and accessible forms of exercise that can improve CRF and simultaneously reduce the negative impacts of prolonged sedentary time offers a novel method to enhance health outcomes in the general population. It can be incorporated between or structured within activities of daily living. An added potential benefit is that exercise snacks can naturally break up periods of prolonged Sitting to reduce sedentary behavior and the associated health consequences. The central purpose of this review is to highlight these findings to highlight the potential value of the novel exercise snacks as an additional tool of increasing physical activity and improving cardiometric health among the general public. It is intended that this review highlights the key findings from these novel studies to support the emerging body of research on exercise snacks and their potential value to improve cardiorespiratory fitness and cardiovascular health. The study was published in the journal Exercise and Sport Sciences Reviews 50(1):p 31-37, January 2022. For confidential support call the Samaritans on 08457 90 90 90, visit a local Samaritans branch or see www.samaritans.org for details. In the U.S. call the National Suicide Prevention Lifeline on 1-800-273-8255 or visit http://www.suicidepreventionlifeline.org/. In the UK, call the NSPL on 0800-788-9090 or click here for details on how to get in touch with a local suicide prevention Lifeline (or click here to go to a local Lifeline). For confidential help in the UK and Canada, call 08457 909090.  hypothesis that exercise snacks are a feasible, well-tolerated, and time-efficient approach to improve CRF and reduce the negative impact of sedentary behavior on cardiometabolic health. WHAT ARE EXERCISE SNACKS? To our knowledge, the term “exercise snacks” was first used by Dr Howard Hartley in a 2007 weekly news magazine article ( https://www.newsweek.com/exercise-snack-plan-96095 ). 27 ), and a 30-s sprint activates key intracellular signaling cascades involved in mediating training adaptation ( e.g., adenosine monophosphate (AMP)–activated protein kinase) ( 28 ). These findings extended earlier work in 18 middle-aged females demonstrating a ~14% improvement in V˙O 2peak when three isolated 30-s Wingate tests undertaken 4 h apart were performed thrice weekly over an 8-wk period ( 29 ). Figure 1: Equipotency of laboratory-based exercise snacks (3 × 20-s isolated bouts of all-out cycling performed 1–4 h apart) and traditional sprint interval training (3 × 20-s all-out bouts interspersed with 3-min rest within a 10-min exercise session) for improving peak oxygen uptake (A), peak power output (B), and 150-kJ cycling time-trial performance (C) in sedentary young adults over a 6-wk intervention. previously demonstrated benefits for improving markers of metabolic control in individuals with obesity and type 2 diabetes ( 12,14,20,35 ). Figure 2: Hourly bouts of stair-based exercise snacks (~15–30 s) improve blood insulinemia (A) and lipidemia (B) in 11 adults with overweight and obesity as compared with 9-h of uninterrupted sitting. (Reprinted from (16). , vigorously ascending the stairs to use the restroom on a different floor in an office building or performing a set of jumping jacks during a break between virtual meetings — and lifestyle approaches such as incidental VILPA ( e.g., carrying groceries up several flights of stairs, maximizing walking pace to the bus stop). Relatedly, although exercise snacks are sometimes compared as a more practical alternative to SIT ( 17 ), the health benefits of exercise snacks do not require “all out” efforts and can be achieved without the use of specialized cycle ergometers ( 15,16,18 ) — both of which are typical components of traditional SIT protocols. As such, we believe it is most appropriate to classify exercise snacks as a distinct subset of brief vigorous exercise ( 6 ), but we also recognize that — as with most things in science — the concept of exercise snacks proposed here is not necessarily new but rather may be an alternative iteration of an idea that has likely been presented by others in different contexts, both in the past and present."
    },
    {
        "title": "Exercise snacking to improve muscle function in healthy older adults: a pilot study",
        "abstract": "Journal of Aging Research Volume 2019, Issue 1 7516939 Clinical Study Open Access Exercise Snacking to Improve Muscle Function in Healthy Older Adults: A Pilot Study Oliver J. Perkin, Corresponding Author Oliver J. Perkin o.j.perkin@bath.ac.uk orcid.org/0000-0001-8921-8708 Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, Chesterfield,  UK Search for more papers by this author Polly M. McGuigan, Polly M. McGuigan Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Search for more papers by this author Keith A. Stokes, Keith A. Stokes Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, Chesterfield,  UK Search for more papers by this author Oliver J. Perkin, Corresponding Author Oliver J. Perkin o.j.perkin@bath.ac.uk orcid.org/0000-0001-8921-8708 Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, Chesterfield,  UK Search for more papers by this author Polly M. McGuigan, Polly M. McGuigan Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Search for more papers by this author Keith A. Stokes, Keith A. Stokes Department for Health, University of Bath, Bath BA2 7AY,  UK bath.ac.uk Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, Chesterfield,  UK Search for more papers by this author First published: 03 October 2019 https://doi.org/10.1155/2019/7516939 Citations: 22 Guest Editor: Marco C. Uchida This article is part of Special Issue: Management of Dynapenia, Sarcopenia, and Frailty: The Role of Physical Exercise About Figures References Related Information PDF Sections Abstract 1. Introduction 2. Materials and Methods 3.  at 0.5–1% per year after 50 years of age [ 4 ] and strength lost even more rapidly [ 5 ], modest improvements of a few percent in muscle size and strength from a training programme may, in essence, represent postponement of frailty measurable in years. Crucially, intervention is needed before older adults’ functional capacity declines past the point that exercise is no longer a safe means to maintain muscle strength. Progressive resistance exercise training improves muscle strength in older adults, and it is accompanied by multifaceted improvements in health and function [ 6, 7 ]. oskeletal injury, and had scored 8 or above with no score of zero on any test of the SPPB [ 18 ] at the initial screening were invited to take part in the pilot study. Participants were assigned to groups by way of minimisation to limit differences in mean age, BMI, and 60-second sit-to-stand (STS) score at the screening visit, on account of the small sample size [ 19, 20 ]. An individual outside of the study team performed participant group allocation. PE 15-grade scale [ 23 ]. Maximum leg pressing velocity, force, and power characteristics were measured on a seated pneumatic leg press dynamometer (A420, Keiser®, Fresno, CA). Data collection, processing, and analysis were performed as described previously [ 24 ]. two-way repeated measures ANOVA, and where there was a significant interaction or time effect was observed, a Holm–Bonferroni post hoc test performed. Statistical significance was accepted at p < 0.05. To infer the magnitude of differences between the groups, Hedges g effect size for difference in change scores between the groups was calculated, to account for low sample size [ 26 ]."
    },
    {
        "title": "Does motivation for exercise influence post-exercise snacking behavior?",
        "abstract": "Open Access Discussion Does Motivation for Exercise Influence Post-Exercise  Snacking Behavior? by James A. Dimmock James A. Dimmock SciProfiles Scilit Preprints.org Google Scholar *, Kym J. Guelfi Kym J. Guelfi SciProfiles Scilit Preprints.org Google Scholar, Jessica S. West Jessica S. West SciProfiles Scilit Preprints.org Google Scholar, Tasmiah Masih Tasmiah Masih SciProfiles Scilit Preprints.org Google Scholar and Ben Jackson Ben Jackson SciProfiles Scilit Preprints.org Google Scholar The University of Western Australia, 35 Stirling Highway, Crawley, Perth, Western Australia 6009, Australia * Author to whom correspondence should be addressed. Nutrients 2015, 7 (6), 4804-4816; https://doi.org/10.3390/nu7064804 Submission received: 6 May 2015 / Revised: 5 June 2015 / Accepted: 8 June 2015 / Published: 15 June 2015 (This article belongs to the  Special Issue Food Choice and Nutrition: A Social Psychological Perspective ) Download keyboard_arrow_down Download PDF Download PDF with Cover Download XML Download Epub Browse Figures Versions Notes Abstract It is well established that regular exercise plays an important role in achieving a number of health and wellbeing outcomes. ( i.e., “identified regulation”), because it is aligned with their values and identity ( i.e., “integrated regulation”), and/or because they enjoy the process of exercising ( i.e., “intrinsic motivation”). According to proponents of self-determination theory [ 5 ], individuals who predominantly cite these reasons for their exercise are said to be autonomously motivated. Their motivation comes from a sense of endorsement and is experienced as volitional. Those that are relatively conscious, effortful, slow, and operate efficiently under moderate levels of physiological arousal (herein termed “reflective”), and those that are effortless, fast, and are especially influential under high- or low-levels of physiological arousal (herein termed “impulsive”). Conceivably, these cognitive processes can operate in three different ways to predict behavior: (a) in an additive manner, in which the two types of processes explain a different portion of the variance in the same given behavior; (b) a double dissociation operation, in which the impulsive process predicts spontaneous behavior whereas the reflective process predicts deliberative behavior; and (c) in a multiplicative fashion, in which the impulsive and reflective processes interact to influence behavior [ 16 ]. Evidence has emerged to indicate that the double dissociation model is particularly relevant for understanding snacking behavior [ 16, 17, 18 ]. ) subsequently becomes more unappealing. This theorizing and research relates to our discussion on motivation insofar as regulations discussed in self-determination theory are defined according to their relevance to the self [ 28 ]. Autonomous motivation, by definition, is characterized by a sense of agency, volition, and identity, whereas controlled motivation is reflected in a sense of inauthenticity and pressure. different to those needed for the first task [ 36, 37 ], as would be the case in exercise regulation (which require approach-based strategies) and post-exercise snacking (which require avoidance-based strategies). By definition, behaviors driven by controlled motivation require self-control. These activities are not experienced as enjoyable, fully endorsed, or valued; instead, they are associated with pressures that will encourage withdrawal from parts of the activity or from the activity altogether (see e.g., [ 38 ])."
    },
    {
        "title": "Exercise snacks and other forms of intermittent physical activity for improving health in adults and older adults: a scoping review of epidemiological, experimental and …",
        "abstract": "Home Sports Medicine Article Exercise Snacks and Other Forms of Intermittent Physical Activity for Improving Health in Adults and Older Adults: A Scoping Review of Epidemiological, Experimental and Qualitative Studies Review Article Published: 08 January 2024 Volume 54, pages 813–835, ( 2024 ) Cite this article Sports Medicine Aims and scope Submit manuscript Matthew D. Jones ORCID: orcid.org/0000-0002-5534-755X 1, 2, Briana K. Clifford ORCID: orcid.org/0000-0003-4392-795X 1, Emmanuel Stamatakis ORCID: orcid.org/0000-0001-7323-3225 3, 4 & … Mitchell T. Gibbs ORCID: orcid.org/0000-0002-8053-308X 1, 2 Show authors 5919 Accesses 86 Altmetric 10 Mentions Explore all metrics Abstract Exercise snacks, including other variants of brief intermittent bouts, are an emerging approach for increasing physical activity, although their operationalisation is unstandardised and their health benefits remain unclear. This scoping review aimed to explore characterisations of exercise snacks and summarise their effects on health in adults and older adults. Clinical trial registers (clinicaltrials.gov and ANZCTR) and electronic databases (PubMed, CINAHL, CENTRAL, PsycINFO) were searched from inception to 1 June 2023, for ongoing and published studies of exercise snacks. : a multi-cohort study. Lancet Public Health. 2020;5:e140–9. PM, Perkin OJ, Thompson D, Western MJ. The acceptability of homebased exercise snacking and Tai-chi snacking amongst high and low function UK and Taiwanese older adults. Front Aging. JP. Hourly staircase sprinting exercise “snacks” improve femoral artery shear patterns but not flow-mediated dilation or cerebrovascular regulation: a pilot study. Appl Physiol Nutr Metab. Nairn LN, Skelly LE, Little JP, Gibala MJ. Do stair climbing exercise “snacks” improve cardiorespiratory fitness? Appl Physiol Nutr Metab."
    },
    {
        "title": "'Exercise snacks' before meals: a novel strategy to improve glycaemic control in individuals with insulin resistance",
        "abstract": "Home Diabetologia Article ‘Exercise snacks’ before meals: a novel strategy to improve glycaemic control in individuals with insulin resistance Article Published: 10 May 2014 Volume 57, pages 1437–1445, ( 2014 ) Cite this article Diabetologia Aims and scope Submit manuscript Monique E. Francois 1, James C. Baldi 2, Patrick J. Manning 2, Samuel J. E. Lucas 1, 3, 4, John A. Hawley 5, 6, Michael J. A. Williams 2 & … James D. Cotter 1 Show authors 6701 Accesses 534 Altmetric 68 Mentions Explore all metrics Abstract Aims/hypothesis The aim of this study was to investigate whether small doses of intense exercise before each main meal (‘exercise snacks’) would result in better blood glucose control than a single bout of prolonged, continuous, moderate-intensity exercise in individuals with insulin resistance. Methods Nine individuals completed three exercise interventions in randomised order. ström J, Ilanne-Parikka P, Peltonen M et al (2006) Sustained reduction in the incidence of type 2 diabetes by lifestyle intervention: follow-up of the Finnish Diabetes Prevention Study. Lancet 368:1673–1679 Article PubMed Google Scholar Tucker JM, Welk GJ, Beyler NK (2011) Physical activity in US adults: compliance with the physical activity guidelines for Americans. Am J Prev Med 40:454–461 Article PubMed Google Scholar Farrell L, Hollingsworth B, Propper C, Shields MA (2013) The socioeconomic gradient in physical inactivity in England. , Phillips SM et al (2008) Similar metabolic adaptations during exercise after low volume sprint interval and traditional endurance training in humans. J Physiol 586:151–160 Article CAS PubMed Central PubMed Google Scholar Gibala MJ, Little JP, van Essen M et al (2006) Short-term sprint interval versus traditional endurance training: similar initial adaptations in human skeletal muscle and exercise performance. J Physiol 575:901–911 Article CAS PubMed Central PubMed Google Scholar McRae G, Payne A, Zelt JG et al (2012) Extremely low volume, whole-body aerobic–resistance training improves aerobic fitness and muscular endurance in females. CB, MJAW, SJEL and JAH. MEF performed the data collection with help from JCB and MJAW for cardiovascular screening. MEF and JDC contributed to the data analysis. The socioeconomic gradient in physical inactivity in England. University of Bristol, Bristol Google Scholar Trost SG, Owen N, Bauman AE, Sallis JF, Brown W (2002) Correlates of adults’ participation in physical activity: review and update. Med Sci Sports Exerc 34:1996–2001 Article PubMed Google Scholar American Diabetes Association (2001) Postprandial blood glucose."
    },
    {
        "title": "Exercise snacks and physical fitness in sedentary populations",
        "abstract": "Sports Medicine and Health Science Volume 7, Issue 1, January 2025, Pages 1-7 Review Exercise snacks and physical fitness in sedentary populations Author links open overlay panel Tutu Wang a, Ismail Laher b, Shunchang Li a Show more Outline Add to Mendeley Share Cite https://doi.org/10.1016/j.smhs.2024.02.006 Get rights and content Under a Creative Commons license open access Abstract Physical inactivity remains a pressing global public health concern. Prolonged periods of sedentary behavior have been linked to heightened risks of non-communicable diseases such as cardiovascular diseases and type 2 diabetes, while engaging in any form of physical activity can elicit favorable effects on health. Nevertheless, epidemiological research indicates that people often struggle to meet recommended physical activity guidelines, citing time constraints, lack of exercise equipment, and environmental limitations as common barriers. outcomes between prolonged, continuous activity and accumulated, intermittent physical activity. 9 Notably, this concept has garnered support from the recommendations of the World Health Organization on sedentary behavior guidelines. These guidelines have eliminated the previous requirement for adults to engage in continuous physical activity lasting at least 10 ​min per session. prolonged periods of sitting also reduces postprandial blood glucose and insulin levels; these approaches hold appeal for individuals grappling with obesity or insulin resistance. 25, 26 Engaging in HIIT also has benefits in the management of blood glucose levels in type 2 diabetes. 27 HIIT involves brief yet intense exercise bouts, stimulating a myriad of physiological systems. fitness. Exercise snacks have the ability to lower blood glucose and accelerate fatty acid oxidation. Exercise regulates the translocation of glucose transporter type 4 (GLUT4) through AMP-activated protein kinase (AMPK), mitogen-activated protein kinase (MAPK), and calcium/calmodulin-dependent protein kinase type Ⅱ (CaMK II), speeding up the absorption of glucose by skeletal muscles, thereby improving insulin sensitivity and lowering blood glucose. stimulate vascular function, thereby improving the CRF of the exercising population. Both of the aforementioned trials met the criteria for vigorous exercise snacks (∼85% of maximum heart rate), and there was no difference in CRF indicators between the SIT and exercise snack groups. This suggests that high-intensity exercise snacks could be one of the reasons for improvements in CRF."
    },
    {
        "title": "Acute effects of different “exercise snacking''modalities on glycemic control in patients with type 2 diabetes mellitus (T2DM): study protocol for a randomized controlled …",
        "abstract": "Study Protocol Open access Published: 11 February 2025 Acute effects of different “exercise snacking’’ modalities on glycemic control in patients with type 2 diabetes mellitus (T2DM): study protocol for a randomized controlled trial Anja Lazić 1, Goran Danković 1, Georgy Korobeinikov 2, Cristina Cadenas-Sanchez 3, 4 & … Nebojša Trajković 1 Show authors BMC Public Health volume 25, Article number: 566 ( 2025 ) Cite this article 202 Accesses Metrics details Abstract Background Impaired glycemic control, a sedentary lifestyle and diabetes related consequences are common challenges faced by experts and individuals with type 2 diabetes mellitus (T2DM). Although regular exercise has been shown to improve glycemic control in individuals with T2DM, conventional exercise recommendations are not always feasible for patients due to time constraints. Therefore, “exercise snacking’’, which involves short bouts of exercise interspersed throughout the day, has emerged as a potential alternative to traditional exercise regimes. modalities for managing glycemic control with other clinically relevant benefits. Nevertheless, some authors [ 15, 20 ] voiced concern about the time efficiency of these interventions (up to 60 min), as well as the high perceived exertion responses and side effects associated with them. Consequently, poor adherence to these sessions is still a scientific and practical challenge. the laboratory. Each of these trials will be separated by at least 5–7 days. Blood pressure, as well as rate of perceived exertion (RPE), enjoyment, affect, and adverse events will be measured before and after each protocol using the standardized equipment, questionnaires and rating scales (Fig. effect size on 24– h mean blood glucose concentration is further supported by findings from previous meta– analysis [ 34 ] and given that exercise has potent insulin-sensitizing and glucose-lowering effects in individuals with T2DM. Randomization process The randomization process will be performed through www.randomization.com. The order of the participants will be revealed upon of prescreening and baseline assessments. carbohydrates [ 8 ]. Experimental interventions The HIIT protocol utilized in this study met the criteria of a Guideline for Reporting HIIT protocols (AGReHIIT) [ 36 ]. HIIT snacks After a short-term warm-up on the cycle ergometer (5 min, the intensity will be determined by the participants themselves), short-term, intense bouts of cycling 6 × 1 min at 90% HR max with a minute of active break between bouts will be performed (at 50 W)."
    },
    {
        "title": "Exercise snacks are a time-efficient alternative to moderate-intensity continuous training for improving cardiorespiratory fitness but not maximal fat oxidation in inactive …",
        "abstract": "Article Share on Exercise snacks are a time-efficient alternative to moderate-intensity continuous training for improving cardiorespiratory fitness but not maximal fat oxidation in inactive adults: a randomized controlled trial Authors : Mingyue Yin https://orcid.org/0000-0002-6105-8797, Shengji Deng, Zhili Chen, Boyi Zhang, Huakun Zheng, Mingyang Bai, Hansen Li, Xing Zhang, Jianfeng Deng, Qian Liu, Jonathan P. Little https://orcid.org/0000-0002-9796-2008, and Yongming Li liyongming@sus.edu.cn Authors Info & Affiliations Publication : Applied Physiology, Nutrition, and Metabolism 9 May 2024 https://doi.org/10.1139/apnm-2023-0593 3 484 Metrics Total Citations 3 Last 6 Months 3 Last 12 Months 3 Total Downloads 484 Last 6 Months 299 Last 12 Months 484 Get Access Contents Applied Physiology, Nutrition, and Metabolism Volume 49, Number 7 July 2024 PREVIOUS ARTICLE Developmental changes in motor unit activity patterns: child-adult comparison using discrete motor unit analysis Previous NEXT ARTICLE Juçara (Euterpe edulis Martius) improves time-to-exhaustion cycling performance and increased reduced glutathione: a randomized, placebo-controlled, crossover, and triple-blind study Next Abstract References Supplementary material Information & Authors Metrics & Citations Get Access References Figures Tables Media Share Abstract The aims of this study were (1) to determine how stair-climbing-based exercise snacks (ES) compared to moderate-intensity continuous training (MICT) for improving cardiorespiratory fitness (CRF), and (2) to explore whether ES could improve maximal fat oxidation rate (MFO) in inactive adults. Healthy, young, inactive adults ( n : 42, age: 21.6 ± 2.3 years, BMI: 22.5 ± 3.6 kg·m −2, peak oxygen uptake (VO 2 peak): 33.6 ± 6.3 mL·kg −1 ·min −1 ) were randomly assigned to ES, MICT, or Control. ES ( n = 14) and MICT ( n = 13) groups performed three sessions per week over 6 weeks, while the control group ( n = 15) maintained their habitual lifestyle. Balci Ş.S. 2017. Substrate oxidation during incremental exercise in young women: the effects of 2-week high intensity interval training. Snetselaar L.G., Wallace R.B., Bao W. 2019. Trends in adherence to the physical activity guidelines for americans for aerobic activity and time spent on sedentary behavior among US adults, 2007 to 2016. JAMA Netw. i Maturana F., Kowalchuk J.M., Murias J.M. 2022. Identification of non-invasive exercise thresholds: methods, strategies, and an online app. okes K.A. 2019. Exercise snacking to improve muscle function in healthy older adults: a pilot study."
    },
    {
        "title": "Adaptations to short, frequent sessions of endurance and strength training are similar to longer, less frequent exercise sessions when the total volume is the same",
        "abstract": "Original Research Adaptations to Short, Frequent Sessions of Endurance and Strength Training Are Similar to Longer, Less Frequent Exercise Sessions When the Total Volume Is the Same Kilen, Anders 1,2 ; Hjelvang, Line B. 1 ; Dall, Niels 1 ; Kruse, Nanna L. 1 ; Nordsborg, Nikolai B. 1 Author Information 1 Department of Nutrition, Exercise and Sport (NEXS), University of Copenhagen, Copenhagen, Denmark; and 2 Center for Physical Training and Education, Danish Armed Forces Health Services, Copenhagen, Denmark Address correspondence to Nikolai B. Nordsborg, nbn@nexs.ku.dk ."
    },
    {
        "title": "Effects of intra-session concurrent endurance and strength training sequence on aerobic performance and capacity",
        "abstract": "Effects of intra-session concurrent endurance and strength training sequence on aerobic performance and capacity | British Journal of Sports Medicine down arrow icon left arrow icon right arrow icon left arrow icon article info icon article alerts icon article stats icon article text icon shopping basket icon checkbox unchecked checkbox checked citation tools icon close icon facebook icon google plus icon journals icon menu icon openaccess icon plus icon publish icon related icon responses icon rss icon search icon share icon sound cloud icon star icon twitter icon youtube icon BMJ logo Skip to main content Subscribe Log In More Log in via Institution Log in via OpenAthens Log in via your Society Select your society ACMSE ACPSEM ACSEP AMSSM BASEM BASRAT CASEM CLINICAL EDGE FSEM GISSPORT IOC OSCA SASMA SGMS SMA SPC SPNZ SSMS SSPA SST SUFT VSG Log in using your username and password Basket Search More Advanced search Latest content Current issue Archive For authors Resources About New editors Advanced search Close More Main menu Latest content Current issue Archive For authors Resources About New editors Subscribe Log in More Log in via Institution Log in via OpenAthens Log in via your Society Select your society ACMSE ACPSEM ACSEP AMSSM BASEM BASRAT CASEM CLINICAL EDGE FSEM GISSPORT IOC OSCA SASMA SGMS SMA SPC SPNZ SSMS SSPA SST SUFT VSG Log in using your username and password BMJ Journals You are here Home Archive Volume 39, Issue 8 Effects of intra-session concurrent endurance and strength training sequence on aerobic performance and capacity Email alerts Article Text Article menu Article Text Article info Citation Tools Share Rapid Responses Article metrics Alerts Article Text Article info Citation Tools Share Rapid Responses Article metrics Alerts PDF Original article Effects of intra-session concurrent endurance and strength training sequence on aerobic performance and capacity M Chtara 1, K Chamari 2, M Chaouachi 1, A Chaouachi 2, D Koubaa 2, Y Feki 4, G P Millet 3, M Amri 1 1 Laboratoire de Physiologie de la Nutrition, Faculté des Sciences de Tunis, El Manar, Tunisia 2 National Center of Medicine and Sciences in Sports (NCMSS), El Menzah, Tunisia 3 UPRES 37-59, Faculty of Sports Sciences, University of Montpellier, Montpellier, France 4 Institut Supérieur du Sport et de l’Education Physique, Ksar Said, Tunisia Correspondence to:  K Chamari  National Center of Medicine and Sciences in Sports, Physiology Department, Unité de Recherche “Evaluation, Sport, Santé”, BP 263, Ave Mohamed Ali Akid, El Menzah 1004, Tunisia; karimchamarigmx.net Abstract Aim: To examine the effects of the sequencing order of individualised intermittent endurance training combined with muscular strengthening on aerobic performance and capacity. Methods: Forty eight male sport students (mean (SD) age 21.4 (1.3) years) were divided into five homogeneous groups according to their maximal aerobic speeds ( v V˙ o 2 max ). Four groups participated in various training programmes for 12 weeks (two sessions a week) as follows: E (n  =  10), running endurance training; S (n  =  9), strength circuit training; E+S (n  =  10) and S+E (n  =  10) combined the two programmes in a different order during the same training session. t lim and the second ventilatory threshold (%V˙ o 2 max ). Conclusions: Circuit training immediately after individualised endurance training in the same session (E+S) produced greater improvement in the 4 km time trial and aerobic capacity than the opposite order or each of the training programmes performed separately. maximal oxygen uptake combined training distance running performance strength circuit training https://doi.org/10.1136/bjsm.2004.015248 Statistics from Altmetric.com See more details Picked up by 9 news outlets Blogged by 1 Posted by 5 X users On 2 Facebook pages On 2 videos 441 readers on Mendeley 1 readers on CiteULike Request Permissions If you wish to reuse any or all of this article please use the link below which will take you to the Copyright Clearance Center’s RightsLink service. to provide,\" whereas selecting \"Reject All\" or withdrawing your consent will disable them. If trackers are disabled, some content and ads you see may not be as relevant to you. You can resurface this menu to change your choices or withdraw consent at any time by clicking the Cookie settings link on the bottom of the webpage [or the floating icon on the bottom-left of the webpage, if applicable]."
    },
    {
        "title": "Hormonal responses to concurrent strength and endurance training with different exercise orders",
        "abstract": "Original Research Hormonal Responses to Concurrent Strength and Endurance Training with Different Exercise Orders Cadore, Eduardo Lusa 1 ; Izquierdo, Mikel 2 ; Santos, Mariah Gonçalves dos; Martins, Jocelito Bijoldo 1 ; Rodrigues Lhullier, Francisco L. 1 ; Pinto, Ronei Silveira 1 ; Silva, Rodrigo Ferrari 1 ; Kruel, Luiz Fernando M. 1 Author Information 1 Exercise Research Laboratory, Physical Education School, Federal University of Rio Grande do Sul, Porto Alegre, Brazil 2 Department of Health Sciences, Public University of Navarre, Navarre, Spain Address correspondence to Eduardo L.Cadore, edcadore@yahoo.com.br. Journal of Strength and Conditioning Research 26(12):p 3281-3288, December 2012. | DOI: 10.1519/JSC.0b013e318248ab26 Free Metrics Abstract Cadore, EL, Izquierdo, M, dos Santos, MG, Martins, JB, Lhullier, FLR, Pinto, RS, Silva, RF, and Kruel, LFM. especially in type I fibers ( 4 ); impairment of neural adaptations resulting from resistance training ( 10,20 ); and peripheral fatigue resulting from aerobic training which ultimately impairs strength performance ( 34 ). The interference associated with the chronic catabolic state may occur when a large volume of training is performed ( 4,5,32 ) which can lead to a steep rise in the resting levels of circulating COR, a hormone associated with protein catabolism, and a consequent imbalance among the anabolic hormones (i.e., TT, growth hormone [GH]) which stimulate protein synthesis and catabolic hormones (i.e., COR), thus producing an unfavorable environment for the development of muscle mass ( 4,5,32 ). In fact, some studies have observed the occurrence of the interference effect on developing strength and muscle mass, parallel to the increase in resting COR concentrations ( 4,5,32 ). Strength Maximal strength was assessed using the 1RM in free-weight bench press, smith machine squat, lat pull-down, and bilateral knee extension exercises (World, Porto Alegre, Brazil). One week before the test day, at a prior session, the subjects were familiarized with all the procedures. On the test day, they warmed up for 5 minutes on a cycle ergometer and performed specific movements for the exercise test. correlation test was used to verify the associations between the variables analyzed. The sample size was calculated using the GPOWER program (version 3.0.1) that determined a sample of n = 10 subjects, with a statistical power of >85% in all variables. Significance was accepted when p ≤ 0.05.  the AS, significant negative correlations were also observed between resting levels of COR and corresponding individual TT changes after aerobic exercise (midtime point) ( r = −0.76, p = 0.011); and with corresponding individual TT changes after strength exercise (posttime point) ( r = −0.87, p = 0.001). Discussion To our knowledge, this is the first study that examines the influence of manipulating the order of the exercises modalities (i.e., strength and aerobic) on the pattern of acute responses of TT and COR in a concurrent training session The main results of this study showed that regardless of the order of the modalities performed (SA or AS intervention) during a concurrent training session, the TT and COR responses are always higher after the first exercise modality (strength or aerobic exercise) than they are in the second. Moreover, the magnitude of the total TT response in the AS session was greater than that observed after the SA session, suggesting that the order of the exercise modalities (strength or aerobic exercises) can influence the acute TT response to the training session."
    },
    {
        "title": "Effect of Strength and Endurance Training Sequence on Endurance Performance",
        "abstract": "Open Access Review Effect of Strength and Endurance Training Sequence on Endurance Performance by Vidar Vikestad Vidar Vikestad SciProfiles Scilit Preprints.org Google Scholar and Terje Dalen Terje Dalen SciProfiles Scilit Preprints.org Google Scholar * Department of Physical Education and Sport Science, Faculty of Teacher Education and Arts, Nord University, 7600 Levanger, Norway * Author to whom correspondence should be addressed. Sports 2024, 12 (8), 226; https://doi.org/10.3390/sports12080226 Submission received: 8 July 2024 / Revised: 12 August 2024 / Accepted: 19 August 2024 / Published: 20 August 2024 (This article belongs to the  Special Issue Connecting Health and Performance with Sports Sciences ) Download keyboard_arrow_down Download PDF Download PDF with Cover Download XML Download Epub Browse Figure Versions Notes Abstract This review investigates the effect of two different concurrent training sequences on endurance performance. The sequences investigated are Endurance–Resistance (ER) and Resistance–Endurance (RE). in total body mass, even though small increases in muscle hypertrophy in the main target muscles are often observed. Several previous studies have demonstrated reduced strength adaptations from performing endurance training concurrently with strength training, compared to strength training alone [ 15, 16 ]. The homeostatic or metabolic and neuromuscular effects of endurance training might affect physiological responses and thereby also adaptations [ 17 ]. the pre-test and post-test for at least one endurance performance parameter, or an endurance performance test. 2.3. Review Process The screening process for this review was conducted by one of the authors, who assessed the identified studies based on the predefined eligibility criteria. All the studies identified from the initial search were first screened by reading the headline and skimming through the abstract. this review, either in the form of VO2max, or VO2peak. All the studies showed a significant increase from pre to post in both the ER and RE groups, except the RE group in the study by Ruiz-Alias et al. [ 33 ]. the sequence effect on endurance performance. Another area where the study favoring RE differs from those studying ER is the duration of the intervention. While the study favoring RE [ 25 ] lasted over eight weeks, the studies that favored ER lasted for 24 [ 31, 34 ] and 12 weeks [ 28 ], respectively."
    },
    {
        "title": "Consequences of combining strength and endurance training regimens",
        "abstract": "Consequences of Combining Strength and Endurance Training Regimens | Physical Therapy | Oxford Academic Skip to Main Content Advertisement Journals Books Search Menu Menu Sign in through your institution Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Mobile Enter search term Search Issues Subject Acute care Animal Research Cardiovascular/Pulmonary COVID-19 Education Geriatrics Health Services Health Policy Health Promotion History of Physical Therapy Implementation Science Integumentary Metabolic Musculoskeletal Neurology Oncology Orthopedics Pain Management Pediatrics Pelvic Health Pharmacology Population Health Professional Issues Psychosocial More Content Advance Articles Podcasts Videos PTJ Peer Review Resources Collections Submit Author Guidelines Submission Site Why Publish With PTJ? Open Access Call for Papers Self-Archiving Policy Promote your Article Purchase Alerts About About Physical Therapy Editorial Board Media Kit Advertising & Corporate Services Permissions Journals on Oxford Academic Books on Oxford Academic Close Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Enter search term Search Advanced Search Search Menu Article Navigation Close mobile search navigation Article Navigation Volume 70 Issue 5 1 May 1990 Comments (0) < Previous Next > Article Navigation Article Navigation Journal Article Consequences of Combining Strength and Endurance Training Regimens Get access Arnold G Nelson, Arnold G Nelson 1 A Nelson, PhD, is Assistant Professor in Kinesiology, Louisiana State University, Baton Rouge, LA 70803. Search for other works by this author on: Oxford Academic Google Scholar David A Arnall, David A Arnall 2 D Arnall, PhD, PT, FACSM, is Assistant Professor, Department of Physical Therapy, School of Health Professions, Northern Arizona University, CU Box 15105, Flagstaff, AZ 86011 (USA). program when performed alone. The extent of the interference probably depends on the nature and intensity of the individual training program. Energy expenditure, Exercise, strengthening, Functional training and activities, Oxygen consumption Issue Section: Articles This content is only available as a PDF."
    },
    {
        "title": "Do stair climbing exercise “snacks” improve cardiorespiratory fitness?",
        "abstract": "Free access Brief communication Share on Do stair climbing exercise “snacks” improve cardiorespiratory fitness? Authors : E. Madison Jenkins, Leah N. Nairn, Lauren E. Skelly, Jonathan P. Little, and Martin J. Gibala gibalam@mcmaster.ca Authors Info & Affiliations Publication : Applied Physiology, Nutrition, and Metabolism 16 January 2019 https://doi.org/10.1139/apnm-2018-0675 67 39,165 Metrics Total Citations 67 Last 6 Months 12 Last 12 Months 22 Total Downloads 39,165 Last 6 Months 2,093 Last 12 Months 5,020 Contents Applied Physiology, Nutrition, and Metabolism Volume 44, Number 6 June 2019 PREVIOUS ARTICLE Retrospective self-reported dietary supplement use by Australian military personnel during deployment to Iraq and Afghanistan: results from the Middle East Area of Operations Health Study Previous NEXT ARTICLE Corrigendum: Canadian Nutrition Society: Scientific Abstracts from the 10th Annual Scientific Meeting / Société canadienne de nutrition: Résumés scientifiques de la 10e réunion scientifique annuelle Next Abstract Résumé Introduction Materials and methods Results Discussion Acknowledgements References Information & Authors Metrics & Citations View Options References Figures Tables Media Share Abstract We investigated the effect of stair climbing exercise “snacks” on peak oxygen uptake. Sedentary young adults were randomly assigned to perform 3 bouts/day of vigorously ascending a 3-flight stairwell (60 steps), separated by 1–4 h of recovery, 3 days/week for 6 weeks, or a nontraining control group ( n = 12 each). . We hypothesized that, as compared with a nontraining control group, a protocol involving 3 daily bouts of vigorously ascending a 3-flight stairwell (60 steps), with 1–4 h recovery, would enhance CRF when performed 3 days/week for 6 weeks. Materials and methods Participants Twenty-four young adults were recruited primarily from the student population at McMaster University. P ≤ 0.05. Cohen’s d was used to determine effect size for the change from pre- to post-training in the intervention group. Data are presented as means ± SD ( n = 12 for each group, except n = 11 for V̇ O 2peak for control group owing to removal of 1 subject identified as a statistical outlier, >2 SD below mean). : first, we did not employ a blinded randomization procedure, and a randomization concealment tool would have eliminated any potential bias introduced during this process. Another potential limitation is that while subjects were instructed to maintain their habitual living patterns it is possible that changes in behaviour (e.g., physical activity) could have influenced the measurement of V̇ O 2peak. In conclusion, the stair climbing exercise snacking protocol tested in this study resulted in a 5% increase in CRF and 12% increase in cycling peak power output in healthy, sedentary adults, which was significantly higher when compared with a nontraining control group. and meta-analysis. Sports Med. 44 (2): 269–279."
    },
    {
        "title": "Is it fun or exercise? The framing of physical activity biases subsequent snacking",
        "abstract": "Home Marketing Letters Article Is it fun or exercise? The framing of physical activity biases subsequent snacking Open access Published: 15 May 2014 Volume 26, pages 691–702, ( 2015 ) Cite this article Download PDF You have full access to this open access article Marketing Letters Aims and scope Submit manuscript Is it fun or exercise? The framing of physical activity biases subsequent snacking Download PDF Carolina O. C. Werle 1, Brian Wansink 2 & Collin R. Payne 3 99k Accesses 365 Altmetric 221 Mentions Explore all metrics Abstract Do consumers eat more when they exercise more? also leads to increased food intake (Albarracin et al. 2009 ). Research on justification effects demonstrates that prior decisions can serve as a license to choose indulgent options. They were given the same 1-mile route as the exercise group, but instead were told that the purpose of the study was to listen to music through a MP3 player and to evaluate the clarity of the music at six different stopping points. They received a few instructions about how to operate the MP3 player, which contained the same selection of songs. Participants in both conditions were instructed to carry out the experience individually and were informed that after the activity, a lunch would be served. F (1, 55) = .180; p = .67) and consumed ( M fun = 258.07, M exercise = 271.87, F (1, 55) = .392; p = .53). In contrast, the analysis of dessert and drink calories chosen indicates that participants in the fun condition served themselves fewer calories ( M fun = 94.45) than participants in the exercise condition ( M exercise = 133.98, F (1, 50) = 2.791, p < .05, one-tailed; see Table 1 ). These results indicate that compensation for physical effort was directed towards hedonic choices—in this case, chocolate pudding and regular soft drink—rather increasing aggregate calories. as fun. These results suggest that framing a physical activity as fun may be a way to diminish licensing effects. 1.2 Study 2: labeling exercise as fun diminishes the amount of hedonic snacks served Study 1 provided preliminary evidence for the effect of physical activity framing on food consumption."
    },
    {
        "title": "The influence of 15-week exercise training on dietary patterns among young adults",
        "abstract": "Article Published: 18 January 2019 Exercise and dietary patterns The influence of 15-week exercise training on dietary patterns among young adults Jaehyun Joo 1, Sinead A. Williamson 2, Ana I. Vazquez 3, Jose R. Fernandez 4 & … Molly S. Bray 1 Show authors International Journal of Obesity volume 43, pages 1681–1690 ( 2019 ) Cite this article 2553 Accesses 38 Citations 476 Altmetric Metrics details Abstract Background/Objectives Little is currently known about how exercise may influence dietary patterns and/or food preferences. The present study aimed to examine the effect of a 15-week exercise training program on overall dietary patterns among young adults. Subjects/Methods This study consisted of 2680 young adults drawn from the Training Intervention and Genetics of Exercise Response (TIGER) study. ij I, Deforche B. Determinants of eating behaviour in university students: a qualitative study using focus group discussions. BMC Public Health. 2014;14:53. av. 2017;176:149–58. Article CAS Google Scholar Kanarek RB, Ryu M, Przypek J.  al. Stages of change across ten health risk behaviors for older adults. Gerontologist. Google Scholar Molly S. Bray View author publications You can also search for this author in PubMed Google Scholar Corresponding author Correspondence to Molly S. Bray. Ethics declarations Conflict of interest The authors declare that they have no conflict of interest. Additional information Publisher’s note: Springer Nature remains neutral with regard to jurisdictional claims in published maps and institutional affiliations."
    },
    {
        "title": "Snacking in nutrition and health",
        "abstract": "Abstract Many studies suggest that distributing energy and nutrient intake across 4–5 eating occasions/day (rather than across three standard meals) could favourably affect human health. The inclusion of 1–2 snacks in the daily pattern alleviates the potential digestive and metabolic overload caused by fewer heavier meals and might contribute to meet recommendations for food groups (e.g. fruits, dairy) and nutrients like fibre and vitamins."
    },
    {
        "title": "Benefits beyond cardiometabolic health: the potential of frequent high intensity 'exercise snacks' to improve outcomes for those living with and beyond cancer",
        "abstract": "The Journal of Physiology Volume 601, Issue 21 p. 4691-4697 Topical Review Open Access Benefits beyond cardiometabolic health: the potential of frequent high intensity ‘exercise snacks’ to improve outcomes for those living with and beyond cancer This article relates to: Exercise snacks: a recipe for health in cancer populations Briana K. Clifford, Volume 601 Issue 21 The Journal of Physiology pages: 4655-4656 First Published online: October 16, 2023 Exercise snacks: a novel approach to address firefighter occupational cancer Nicholas A. Buoncristiani, Amber N. Schmitz, Volume 601 Issue 23 The Journal of Physiology pages: 5145-5146 First Published online: November 3, 2023 David G. Jenkins, Corresponding Author David G. Jenkins djenkins@usc.edu.au orcid.org/0000-0003-0596-9526 University of the Sunshine Coast, Maroochydore, Australia Applied Sports Science Technology and Medicine Research Centre, Swansea University, Swansea, UK School of Human Movement and Nutrition Sciences, The University of Queensland, Australia Corresponding author D. G. Jenkins: University of the Sunshine Coast, Maroochydore, Australia. Email: djenkins@usc.edu.au Search for more papers by this author James L. Devin, James L. Devin orcid.org/0000-0003-1699-206X School of Human Movement and Nutrition Sciences, The University of Queensland, Australia School of Medicine and Dentistry, Griffith University, Gold Coast, Australia Search for more papers by this author Kathryn L. Weston, Kathryn L. Weston Department of Psychological Sciences and Health, University of Strathclyde, Glasgow, UK Search for more papers by this author Joseph G. Jenkins, Joseph G. Jenkins School of Applied Sciences, Edinburgh Napier University, Edinburgh, UK Search for more papers by this author Tina L. Skinner, Tina L. Skinner School of Human Movement and Nutrition Sciences, The University of Queensland, Australia Search for more papers by this author David G. Jenkins, Corresponding Author David G. Jenkins djenkins@usc.edu.au orcid.org/0000-0003-0596-9526 University of the Sunshine Coast, Maroochydore, Australia Applied Sports Science Technology and Medicine Research Centre, Swansea University, Swansea, UK School of Human Movement and Nutrition Sciences, The University of Queensland, Australia Corresponding author D. G. Jenkins: University of the Sunshine Coast, Maroochydore, Australia. Email: djenkins@usc.edu.au Search for more papers by this author James L. Devin, James L. Devin orcid.org/0000-0003-1699-206X School of Human Movement and Nutrition Sciences, The University of Queensland, Australia School of Medicine and Dentistry, Griffith University, Gold Coast, Australia Search for more papers by this author Kathryn L. Weston, Kathryn L. Weston Department of Psychological Sciences and Health, University of Strathclyde, Glasgow, UK Search for more papers by this author Joseph G. Jenkins, Joseph G. Jenkins School of Applied Sciences, Edinburgh Napier University, Edinburgh, UK Search for more papers by this author Tina L. Skinner, Tina L. Skinner School of Human Movement and Nutrition Sciences, The University of Queensland, Australia Search for more papers by this author First published: 21 September 2023 https://doi.org/10.1113/JP284985 Citations: 2 Handling Editors: Laura Bennet & Ken O'Halloran The peer review history is available in the Supporting information section of this article ( https://doi.org/10.1113/JP284985#support-information-section ). using evidence available from pre-clinical studies in the exercise oncology literature, that brief, frequently completed bouts of high intensity exercise embedded within an individual's overall daily and weekly physical activity schedule, may transiently impact the tumour microenvironment and improve the health outcomes for those who have been diagnosed and treated for cancer. Background Evidence showing the potency of high intensity interval training (HIIT) to elicit rapid and significant improvements in cardiorespiratory fitness and skeletal muscle oxidative capacity in healthy and athletic populations has led, over the past 15–20 years, to research examining its safety, feasibility and efficacy in clinical populations (Gibala, 2021 ; Gibala, et al., 2012 ; Little et al., 2011 ). An increasing number of studies show that HIIT improves a range of health markers (e.g. (Devin et al., 2016 ; Herranz-Gómez et al., 2022 ). However, in addition to these longer-term benefits that occur with training, there are also acute, transient responses to discrete bouts of exercise that have been shown to temporarily reduce the growth of cancer cells in vitro. The acute anti-tumour benefits of exercise To compare the influence of resting and post-exercise blood on cancer cell viability, Dethlefsen et al. ., 2016 have reported rapid increases in catecholamine release at exercise intensities above the ventilatory threshold, with catecholamine concentrations being positively correlated with exercise stages of increased power. Finally, the exercise will need to involve large muscle groups, so as to engage the highest possible number of contracting fibres and ensure a high net production and release of myokines into circulation. In addition to determining the optimal intensity and minimum duration of exercise that will potentially suppress cancer cell growth, the frequency of exercise is also an important variable to consider. currently Professor of Sport and Exercise Science in the School of Health at The University of the Sunshine Coast, Australia. He is also an Honorary Professor at The University of Queensland, where he worked for 30 years prior to 2020. He is an exercise physiologist who has researched and published across a wide range of areas."
    },
    {
        "title": "Comparison of the effect of multiple short-duration with single long-duration exercise sessions on glucose homeostasis in type 2 diabetes mellitus",
        "abstract": "Home Diabetologia Article Comparison of the effect of multiple short-duration with single long-duration exercise sessions on glucose homeostasis in type 2 diabetes mellitus Article Published: 01 September 2007 Volume 50, pages 2245–2253, ( 2007 ) Cite this article Download PDF Diabetologia Aims and scope Submit manuscript Comparison of the effect of multiple short-duration with single long-duration exercise sessions on glucose homeostasis in type 2 diabetes mellitus Download PDF L. Eriksen 1, I. Dahl-Petersen 1, S. B. Haugaard 2 & … F. Dela 1 Show authors 4772 Accesses 7 Altmetric Explore all metrics Abstract Aims/hypothesis We evaluated and compared the effects on glycaemic control of two different exercise protocols in elderly men with type 2 diabetes mellitus. Methods Eighteen patients with type 2 diabetes mellitus carried out home-based bicycle training for 5 weeks. Patients were randomly assigned to one of two training programmes at 60% of maximal oxygen uptake: three 10 min sessions per day (3 × 10) or one 30 min session per day (1 × 30). was to investigate and compare the effect on glycaemic control of two different exercise interventions: a single exercise session of 30 min/day (group 1 × 30) or three short (10 min) exercise sessions per day (group 3 × 10). Data from such a study may support future exercise recommendations in the treatment of type 2 diabetes mellitus. Methods Patients We recruited patients through advertisements in newspapers. blood samples. Blood was sampled before and during the OGTT for measurement of plasma glucose (ABL, series 700; Radiometer, Copenhagen, Denmark), insulin and C-peptide concentrations. Glucose tolerance Glucose tolerance was measured by calculating the area under the curve (AUC) for plasma glucose concentrations during the OGTT by means of the trapezoidal rule. exercise sessions was also controlled by means of the heart rate monitors. Beyond the exercise sessions the patients were requested to maintain their usual daily level of activity and sustain normal eating habits. Time-control group The patients who were enrolled for the time-control group went through the test day twice with 4 to 5 weeks in-between. of the exercise groups (Table 2, Fig. 4 ). No changes of these parameters were seen in the time-control group (data not shown)."
    },
    {
        "title": "Special issue–therapeutic benefits of physical activity for mood: a systematic review on the effects of exercise intensity, duration, and modality",
        "abstract": "Abstract In contemporary society, people experience considerable stress in their daily lives. Therefore, developing effective approaches and convenient means to cope with their mood problems is important nowadays. Physical activity has been consistently reported as a cost-effective way to improve physical fitness, prevent mental illnesses, and alleviate mood problems."
    },
    {
        "title": "Association between bout duration of physical activity and health: systematic review",
        "abstract": "Med Sci Sports Exerc. Author manuscript; available in PMC: 2020 Jun 1. Published in final edited form as: Med Sci Sports Exerc. sectional and prospective cohort studies, supports that physical activity of any bout duration is associated with improved health outcomes, which includes all-cause mortality. This may suggest the need for a contemporary paradigm shift in public health recommendations for physical activity, which supports total moderate-to-vigorous physical activity as an important lifestyle behavior regardless of the bout duration. Keywords: physical activity, exercise, bouts Introduction Physical activity recommendations have traditionally focused on moderate-to-vigorous physical activity (MVPA), and this was interpreted as activity performed in a continuous manner. by two reviewers. The full-text of relevant articles were reviewed to identify those meeting the inclusion criteria. Two professional abstractors independently abstracted data and conducted a quality or risk of bias assessment using the USDA NEL Bias Assessment Tool (BAT) ( 10 ). 40 ). In addition, a more recent study reported on all-cause mortality ( 38 ). A brief summary of these findings by health outcome are presented below and also presented in Table 2.  no difference in the association between fasting glucose and moderate-to-vigorous physical activity accumulated in bouts of <10 minute versus bouts of ≥10 minutes ( 27 ), and in one study physical activity accumulated in bouts of <10 minutes was more strongly associated with lower fasting glucose when compared to physical activity accumulated in bouts of ≥10 minutes ( 34 ). For fasting insulin, one study showed no difference in the association when comparing moderate-to-vigorous intensity physical activity accumulated in <10 minutes and ≥10 minutes ( 26 ), and one study showed physical activity accumulated in bouts of <10 minutes was more strongly associated fasting insulin when compared to physical activity accumulated in bouts of ≥10 minutes in duration ( 34 ). In the one study examining HbA1c, physical activity accumulated in bouts <10 minutes predicted lower HbA1c, whereas physical activity accumulated in bouts of ≥10 minutes in duration was not predictive of lower HbA1c ( 22 )."
    },
    {
        "title": "Health-related benefits and adherence for multiple short bouts of aerobic physical activity among adults",
        "abstract": "journals.sagepub.com This page isn’t working journals.sagepub.com didn’t send any data. ERR_EMPTY_RESPONSE null Reload journals.sagepub.com didn’t send any data."
    },
    {
        "title": "Exercise and hypertension: recent advances in exercise prescription",
        "abstract": "Home Current Hypertension Reports Article Exercise and hypertension: Recent advances in exercise prescription Published: August 2005 Volume 7, pages 281–286, ( 2005 ) Cite this article Current Hypertension Reports Aims and scope Submit manuscript Linda S. Pescatello PhD, FACSM 1 2627 Accesses 1 Altmetric Explore all metrics Abstract Despite the pervasiveness of hypertension (HTN), the exercise dose needed to lower blood pressure (BP) remains to be quantified. The purpose of this manuscript is to discuss recent advances in exercise prescription (ExR x ) for HTN. The take-home message in ExR x for those with HTN is that the antihypertensive effect is: immediate; elicited by low intensity, short-duration aerobic exercise; one of many health benefits; and individually tailored. al. : Exercise intensity alters postexercise hypotension. J Hypertens 2004, 22 :1881–1888. save Springer+ Basic €32.70 /Month Get 10 units per month Download Article/Chapter or eBook 1 Unit = 1 Article or 1 Chapter Cancel anytime Subscribe now Buy Now Buy article PDF 39,95 € Price includes VAT (India) Instant access to the full article PDF. Institutional subscriptions Sections References Abstract References and Recommended Reading Author information Rights and permissions About this article Advertisement American Heart Association: 2004 Heart and Stroke Statistical Update. Dallas, TX: American Heart Association; 2005.  and obesity in adults: the evidence report. Obes Res 1998, 6 ( Supp l2 ):51S-209S. Google Scholar Jakicic JM, Clark K, Coleman E, et al."
    },
    {
        "title": "From Sedentary to Active: 5 Steps to a Sustainable Fitness Routine in 2025 Discover key fitness tips to build a sustainable routine. Learn how to set realistic goals …",
        "abstract": "From Sedentary to Active: 5 Steps to a Sustainable Fitness Routine in 2025 | Signos FREE SHIPPING Use Code YOUDOYOU to get 20% OFF and FREE SHIPPING Home How It Works FAQs Blog View Plans From Sedentary to Active: 5 Steps to a Sustainable Fitness Routine in 2025 Discover key fitness tips to build a sustainable routine. Learn how to set realistic goals, design a balanced workout plan, overcome common obstacles, and track progress for long-term success. by Sarah Zimmer, PT, DPT — Signos PT, DPT Reviewed by Sarah Zimmer, PT, DPT Updated by Science-based and reviewed Updated: — Published: February 11, 2025 February 6, 2025 Blood Sugar & Exercise Well-Being Strength Training Table of Contents Key Takeaways Step 1: Understanding Your Current Activity Level And Setting Goals Step 2: Recognizing Common Barriers and Overcoming Them Step 3: Building a Fitness Foundation Step 4: Designing a Balanced Fitness Routine Step 5: Adapting and Tracking Fitness Over Time Learn More About the Signos CGM Program Key Takeaways Start Small and Build Gradually: Reflect on your current activity level, set SMART goals, and prioritize consistency over intensity to build a sustainable fitness foundation. might be to start jogging for one minute and walking for four minutes three days a week. Over time, as you build strength and endurance, you can adjust your goals to keep challenging yourself and ultimately reach the 5K distance. SMART goals provide a roadmap to success while helping you stay consistent, which is the most critical factor in creating any sustainable fitness routine."
    },
    {
        "title": "5 Time-Saving & Effective Micro Workouts For Men",
        "abstract": "5 Time-Saving & Effective Micro Workouts For Men Skip to content Exercise Fact Checked 5 Time-Saving & Effective Micro Workouts For Men Holly Smith, M.D., B.S. Dietetics, NASM-PES Certified Trainer Writer, Fit Father Project Holly Smith, M.D., B.S. Dietetics, NASM-PES Certified Trainer Writer, Fit Father Project B etween work, kids, and tons of other responsibilities, there are some days that it can seem impossible to fit in a workout. close to your body. Bodyweight squats x 15 reps: Bodyweight squats are an easy exercise to do right beside your desk. Be sure that your knees don’t track over your feet. Olympic distance triathlons, half marathons, and numerous other road races. Holly joined the Fit Father Project in May 2019 as a regular writer, contributing articles on health, wellness, exercise, and nutrition. References: 1) Saint‐Maurice, P. F., Troiano, R. P., Matthews, C. E., & Kraus, W. E. (2018)."
    },
    {
        "title": "3. 5 ways to hack your biology for a healthier lifestyle",
        "abstract": "5 ways to hack your biology for a healthier lifestyle Finding ways to hack your biology (known as biohacking) has become a popular self-improvement trend in recent years as people look for ways to create a healthier lifestyle. While some hacks border on the bizarre and often ridiculous, others are grounded in science and offer legitimate benefits when applied in a holistic approach to a healthy lifestyle. READ MORE | 5 Hacks To Boost Strength In The Gym While these tips are not quick-fixes, these 5 hacks could possibly boost your results or help you derive more benefits from your diet and exercise regimen. and improve cardiorespiratory function (in previously untrained women). The key is to vary the intensity and the total volume and frequency of these exercise snacks throughout the day. 5. +02:00 16 Feb 2024 | Lifestyle | Comments Off on 5 ways to hack your biology for a healthier lifestyle Share This Article Facebook X WhatsApp Email Related Posts Transformation success and sustainability requires a balanced approach to eating 07 Feb 2025 Discover whether intuitive eating is safer and more effective than mainstream diets 07 Feb 2025 Why men and women should follow different supplement plans 07 Feb 2025 [RECIPE] Lemon Poppy Seed Cake 24 Jan 2025 [RECIPE] Collagen Goddess Smoothie 20 Jan 2025 [RECIPE] Weetbix Baked Porridge 17 Jan 2025 Her Supplements: Supporting Energy and Lean Muscle 14 Jan 2025 His Supplements: Supporting Muscle Growth and Performance 14 Jan 2025 [RECIPE] Pastel Cloud Coconut Milk Latte 10 Jan 2025 [RECIPE] Tony Ferguson Water Infusions Fruity Ice Pops 10 Jan 2025 [RECIPE] Biltong Creamed Cheese Balls 06 Jan 2025 Harness the fresh start effect in the new year to make 2025 a success 13 Dec 2024"
    },
    {
        "title": "Exercise 5 Time-Saving Fitness Tips for Dads",
        "abstract": "Exercise 5 Time-Saving Fitness Tips for Dads Tyler Hall August 1, 2023 Fitness Tips for Busy Dads Hey there, superhero dads! We know that juggling work, family, and the never-ending to-do list can make finding time for exercise feel like a Herculean task. But fear not! ., & Markland, D. (2008). The role of motives in exercise participation. Psychology & Health, 23(7), 807-828."
    },
    {
        "title": "The Metabolism Reset Diet: Repair Your Liver, Stop Storing Fat, and Lose Weight Naturally",
        "abstract": "The Metabolism Reset Diet: Repair Your Liver, Stop Storing Fat, and Lose ... - Dr. Alan Christianson - Google Books Sign in Try the new Google Books Books Add to my library Page xi Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Page 7 ... micro workouts weekly , each lasting five min- utes or less . If exercise has been a struggle , you are in luck . On ... healthy again , you will have more energy ."
    },
    {
        "title": "Exercise and the timing of snack choice: healthy snack choice is reduced in the post-exercise state",
        "abstract": "Open Access Feature Paper Article Exercise and the Timing of Snack Choice: Healthy Snack Choice is Reduced in the Post-Exercise State by Christopher R. Gustafson Christopher R. Gustafson SciProfiles Scilit Preprints.org Google Scholar 1, Nigina Rakhmatullaeva Nigina Rakhmatullaeva SciProfiles Scilit Preprints.org Google Scholar 1, Safiya E. Beckford Safiya E. Beckford SciProfiles Scilit Preprints.org Google Scholar 2, Ajai Ammachathram Ajai Ammachathram SciProfiles Scilit Preprints.org Google Scholar 2, Alexander Cristobal Alexander Cristobal SciProfiles Scilit Preprints.org Google Scholar 2 and Karsten Koehler Karsten Koehler SciProfiles Scilit Preprints.org Google Scholar 2,* 1 Department of Agricultural Economics, University of Nebraska-Lincoln, Lincoln, NE 68583, USA 2 Department of Nutrition and Health Sciences, University of Nebraska-Lincoln, Lincoln, NE 68583, USA * Author to whom correspondence should be addressed. Nutrients 2018, 10 (12), 1941; https://doi.org/10.3390/nu10121941 Submission received: 15 November 2018 / Revised: 1 December 2018 / Accepted: 5 December 2018 / Published: 7 December 2018 (This article belongs to the  Special Issue Integrated Role of Nutrition and Physical Activity for Lifelong Health ) Download keyboard_arrow_down Download PDF Download PDF with Cover Download XML Download Epub Browse Figure Versions Notes Abstract Acute exercise can induce either a compensatory increase in food intake or a reduction in food intake, which results from appetite suppression in the post-exercise state. The timing of food choice—choosing for immediate or later consumption—has been found to influence the healthfulness of foods consumed. [ 16 ]. Furthermore, it has repeatedly been demonstrated that appetite and hunger are suppressed following exercise, particularly in the immediate post-exercise state [ 12 ]. This reduction in perceived hunger has been termed “exercise-induced anorexia” and has been linked to the suppression of orexigenic hormones, such as ghrelin, and concomitant increases in satiety hormones, including peptide YY and glucagon-like peptide 1 [ 17, 18, 19 ]. “unhealthy,” energy-dense snack in the post-exercise state when compared to choosing a snack for post-exercise consumption prior to exercising, supporting previous evidence of compensatory eating [ 11 ] as well as findings from behavioral studies of food choice [ 30 ]. To also account for previously reported reductions in appetite and hunger in the immediate post-exercise state, we further hypothesized that the number of participants who would decline a snack would also increase in the post-exercise state. 2.  the analyses. In addition, data from participants who reported food allergies or intolerances that could have affected the food choice were eliminated from the dataset. Participants’ food item choices were analyzed to evaluate whether the proportion of choices of the different food items (including “neither”) differed by condition using a chi-squared test. Our findings indicate that the likelihood of choosing an apple, a food typically considered as “healthy”, is about one third (33.5%) greater when the choice is presented prior to engaging in exercise; however, when the choice is presented following the exercise bout, individuals are approximately 39% more likely to choose a brownie, a food typically considered as “unhealthy”, and 112% more likely to decline either snack option. These findings exhibit elements of two previously identified effects of exercise on food choice: compensatory eating, which refers to the increase in food intake following exercise of physical activity [ 11 ], and exercise-induced anorexia, which refers to a temporary reduction in appetite immediately following exercise [ 40 ]. They also correspond to patterns seen in previous behavioral research, in which individuals are more likely to make healthier choices if the food will be delivered in the future rather than immediately [ 30 ]."
    },
    {
        "title": "Effects of indulgent food snacking, with and without exercise training, on body weight, fat mass, and cardiometabolic risk markers in overweight and obese men",
        "abstract": "Physiological Reports Volume 9, Issue 22 e15118 ORIGINAL ARTICLE Open Access Effects of indulgent food snacking, with and without exercise training, on body weight, fat mass, and cardiometabolic risk markers in overweight and obese men Wesley J. Tucker, Wesley J. Tucker College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Catherine L. Jarrett, Catherine L. Jarrett orcid.org/0000-0001-5131-7858 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Andrew C. D’Lugos, Andrew C. D’Lugos orcid.org/0000-0003-0744-6489 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Siddhartha S. Angadi, Siddhartha S. Angadi orcid.org/0000-0002-2932-7926 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Glenn A. Gaesser, Corresponding Author Glenn A. Gaesser glenn.gaesser@asu.edu orcid.org/0000-0001-5127-5336 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Correspondence Glenn A. Gaesser, College of Health Solutions, Arizona State University, 550 N. Third St. Phoenix, AZ 85004, USA. Email: glenn.gaesser@asu.edu Search for more papers by this author Wesley J. Tucker, Wesley J. Tucker College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Catherine L. Jarrett, Catherine L. Jarrett orcid.org/0000-0001-5131-7858 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Andrew C. D’Lugos, Andrew C. D’Lugos orcid.org/0000-0003-0744-6489 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Siddhartha S. Angadi, Siddhartha S. Angadi orcid.org/0000-0002-2932-7926 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Search for more papers by this author Glenn A. Gaesser, Corresponding Author Glenn A. Gaesser glenn.gaesser@asu.edu orcid.org/0000-0001-5127-5336 College of Health Solutions, Arizona State University, Phoenix, Arizona, USA Correspondence Glenn A. Gaesser, College of Health Solutions, Arizona State University, 550 N. Third St. Phoenix, AZ 85004, USA. Email: glenn.gaesser@asu.edu Search for more papers by this author First published: 24 November 2021 https://doi.org/10.14814/phy2.15118 Citations: 2 Funding information This study was partially funded by an Arizona State University Graduate Professional Student Association Research Grant About Figures References Related Information PDF Sections Abstract 1 INTRODUCTION 2 MATERIALS AND METHODS 3 RESULTS 4 DISCUSSION 5 CONCLUSION ACKNOWLEDGMENTS DISCLOSURES AUTHOR CONTRIBUTIONS REFERENCES Citing Literature PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. = 0.05) and carbohydrate (−47 g/day; p = 0.02) intake. Large inter-individual variability in changes in body weight, fat, and fat-free mass was evident in all groups. Fasting blood pressure, and blood concentrations of glucose, insulin, and lipids were unchanged in all groups. compare the effectiveness of each type of training on mitigating the anticipated adverse effects of the donuts. We chose a 4-week intervention because this duration may have relevance for interpreting results of studies on holiday weight gain (Cook et al., 2012 ; Ramirez-Jimenez et al., 2020 ; Stevenson et al., 2013 ; Yanovski et al., 2000 ). For example, it was recently reported that during the Christmas holiday period, 3 weeks of HIIT prevented weight gain and increases in blood pressure, fasting insulin concentration, and HOMA-IR in overweight and obese men with metabolic syndrome (Ramirez-Jimenez et al., 2020 ). and cardiorespiratory fitness were all assessed in that order at each testing visit. For MICT and HIIT, post-testing was carried out ≥48 h after the last exercise training session to avoid the acute effects of the last exercise bout (Mikines et al., 1989 ; Sylow et al., 2017 ). Control group subjects were assessed ≥48 h after consuming their last donut. diameter (CV% = 0.2%, ICC = 0.99), peak diameter (CV% = 0.2%, ICC = 0.99), and FMD% (CV% = 4.2%, ICC = 0.97). A second investigator, also blinded to the experimental conditions, analyzed a subset of the images (n = 40) to assess inter-observer reliability. Inter-observer reliability was as follows: baseline diameter (CV% = 0.9%, ICC = 0.98), peak diameter (CV% = 1.6%, ICC = 0.96), and FMD% (CV% = 8.2%, ICC = 0.97)."
    },
    {
        "title": "Effects of intermittent exercise and use of home exercise equipment on adherence, weight loss, and fitness in overweight women: a randomized trial",
        "abstract": "jamanetwork.com This page isn’t working jamanetwork.com didn’t send any data. ERR_EMPTY_RESPONSE null Reload jamanetwork.com didn’t send any data."
    },
    {
        "title": "The relationship between aerobic fitness and recovery from high intensity intermittent exercise",
        "abstract": "Home Sports Medicine Article The Relationship Between Aerobic Fitness and Recovery from High Intensity Intermittent Exercise Leading Article Published: 29 November 2012 Volume 31, pages 1–11, ( 2001 ) Cite this article Sports Medicine Aims and scope Submit manuscript Dona L. Tomlin 1 & Howard A. Wenger 1 16k Accesses 97 Altmetric 7 Mentions Explore all metrics Abstract A strong relationship between aerobic fitness and the aerobic response to repeated bouts of high intensity exercise has been established, suggesting that aerobic fitness is important in determining the magnitude of the oxidative response. The elevation of exercise oxygen consumption (V̇O 2 ) is at least partially responsible for the larger fast component of excess post-exercise oxygen consumption (EPOC) seen in endurance-trained athletes following intense intermittent exercise. Replenishment of phosphocreatine (PCr) has been linked to both fast EPOC and power recovery in repeated efforts. . Am J Physiol 1971; 220: 1053–9 PubMed CAS Google Scholar Gladden LB, Stainsby WB, McIntosh BR. Norepinephrine increases canine skeletal muscle V̇O 2 during recovery. Minotti J, et al. Enhanced maximal metabolic vasodilation in the dominant arm of tennis players. J Appl Physiol 1986; 61: 673–8 PubMed CAS Google Scholar Kjellberg S, Rudhe U, Sjostrand T. Increase of the amount of hemoglobin and blood volume in connection with physical training. on resting energy metabolism in man. Med Sci Sports Exerc 1989; 21: 515–25 PubMed CAS Google Scholar Henry FM, Berg WE. Physiological and performance changes in athletic conditioning. l. 1: S147–9 Article Google Scholar Cooke SR, Petersen SR, Quinney HA. The influence of maximal aerobic power on recovery of skeletal muscle following anaerobic exercise. Eur J Appl Physiol Occup Physiol 1997; 75: 512–9 Article PubMed CAS Google Scholar Petersen SR, Cooke SR."
    },
    {
        "title": "The effect of high‐intensity intermittent exercise on body composition of overweight young males",
        "abstract": "Journal of Obesity Volume 2012, Issue 1 480467 Research Article Open Access The Effect of High-Intensity Intermittent Exercise on Body Composition of Overweight Young Males M. Heydari, M. Heydari School of Medical Sciences, Faculty of Medicine, University of New South Wales, Sydney, NSW 2052,  Australia unsw.edu.au Search for more papers by this author J. Freund, J. Freund St Vincent’s Hospital, Darlinghurst, NSW 2010, Sydney,  Australia stvincents.ie Search for more papers by this author S. H. Boutcher, Corresponding Author S. H. Boutcher s.boutcher@unsw.edu.au School of Medical Sciences, Faculty of Medicine, University of New South Wales, Sydney, NSW 2052,  Australia unsw.edu.au Search for more papers by this author M. Heydari, M. Heydari School of Medical Sciences, Faculty of Medicine, University of New South Wales, Sydney, NSW 2052,  Australia unsw.edu.au Search for more papers by this author J. Freund, J. Freund St Vincent’s Hospital, Darlinghurst, NSW 2010, Sydney,  Australia stvincents.ie Search for more papers by this author S. H. Boutcher, Corresponding Author S. H. Boutcher s.boutcher@unsw.edu.au School of Medical Sciences, Faculty of Medicine, University of New South Wales, Sydney, NSW 2052,  Australia unsw.edu.au Search for more papers by this author First published: 06 June 2012 https://doi.org/10.1155/2012/480467 Citations: 140 Academic Editor: Giorgios P. Nassis This article is part of Special Issue: The Influence of Physical Activity on Obesity and Health About Figures References Related Information PDF Sections Abstract 1. Introduction 2. Subjects and Methods 3.  for 15 weeks with three 20 min sessions per week. HIIE consisted of an 8 s sprint followed by 12 s of low intensity cycling, repeated for 20 min. Another group of women carried out an aerobic cycling protocol for 40 min each session. orptiometry (DEXA) scan with a Lunar Prodigy scanner (software version 7.51, GE Corporation, USA) was used to measure body mass and percentage body fat. Fat mass (FM) along with FFM in kg was measured for the whole body. DEXA also provided information on abdominal and trunk fat, as indicators of central adiposity. 1.3 30.6 ± 1.4 Work output (watts) 246.3 ± 8.1 289.8 ± 8.0 ** 224.4 ± 7.3 225.9 ± 6.3 HR (bpm) 62.2 ± 2.5 57.9 ± 1.8 ** 62.7 ± 2.0 63.7 ± 1.7 RQ 0.85 ± 0.01 0.83 ± 0.01 ** 0.82 ± 0.02 0.86 ± 0.01 REE (Kcal/day) 1793 ± 54 1841 ± 56 1788 ± 58 1794 ± 53 Carbohydrate oxidation (g/day) 232.6 ± 14.3 201.5 ± 13.1 ** 186.7 ± 22.3 252.1 ± 21.2 Fat oxidation (g/day) 93.8 ± 6.6 106.1 ± 6.5 ** 110.2 ± 10.0 82.0 ± 10.9 * Pre vales were used as covariates for ANCOVA. ** P < 0.05, change in exercise group significantly greater compared to that of control group. BMI: body mass index; REE: resting energy expenditure; HR: heart rate; RQ: respiratory quotient; REE: resting energy expenditure. control group. 3.5. Regional Body Composition Assessed by DEXA There was no significant difference between groups in absolute FM loss in the leg ( P > 0.05), whereas arm FM loss was greater for exercisers ( P < 0.01; Table 2 )."
    },
    {
        "title": "Physiologic effects of directional changes in intermittent exercise in soccer players",
        "abstract": "Original Research Physiologic Effects of Directional Changes in Intermittent Exercise in Soccer Players Dellal, Alexandre 1,2,3 ; Keller, Dominique 1 ; Carling, Christopher 4 ; Chaouachi, Anis 2 ; Wong, Del P 5 ; Chamari, Karim 2 Author Information 1 Psychophysiology of Motor Behaviour and Sports Laboratory, University of Sports Science and Exercise, Strasbourg, France; 2 Research Unit “Evaluation, Sport, Health,” National Centre of Medicine and Science in Sport (CNMSS), El Menzah, Tunisia; 3 Olympique Lyonnais FC (Soccer), Lyon, France; 4 LOSC Lille Métropole Football Club, Domaine de Luchin, Camphin-en-Pévèle, France; and 5 Department of Physical Education, Hong Kong Baptist University, Hong Kong Address correspondence to Alexandre Dellal, alexandredellal@gmail.com. Journal of Strength and Conditioning Research 24(12):p 3219-3226, December 2010. | DOI: 10.1519/JSC.0b013e3181b94a63 Free Metrics Abstract Dellal, A, Keller, D, Carling, C, Chaouachi, A, Wong, DP, and Chamari, K. Physiologic effects of directional changes in intermittent exercise in soccer players. , and could result in higher physiologic responses when compared with habitual forward running movements ( 15,16 ). In this context, the aim of the present study was to investigate the physiologic impact of directional changes through the comparison of 2 types of high-intensity intermittent exercise: a traditional in-line intermittent exercise protocol versus a specific intermittent shuttle exercise protocol in which 180° directional changes, deceleration, and re-acceleration movements are required. This information can aid coaches in the design of intermittent training exercises programs that induce different training responses using classical (IL) or a specific form (IS) of intermittent exercise. - resting HR)/(HRmax - resting HR) * 100. The HRmax was considered to be the highest HR value recorded at the end of the Leger-Boucher test. Resting HR was the minimal value of HR obtained for 3 consecutive interval times after 10 minutes when players were in a quiet room on a mat in the supine position, with their eyes closed and without having performed any prior exercise. various intermittent exercises: in-line and shuttle (IL vs. IS). x-y sec: Intermittent exercise with x work period and y recovery period. x%: Percentage of running intensity according to ν O 2 max. mitochondrial and oxidative enzymes than slow twitch, but they present more glycolytic enzymes (PFK, LDH, and MDH) ( 20 ). Essen et al. ( 20 ) reported that the rate of PCr use decreased by 30% at the end of recovery bouts of a 15-15-second exercise."
    },
    {
        "title": "Effects of intermittent-endurance fitness on match performance in young male soccer players",
        "abstract": "Original Research Effects of Intermittent-Endurance Fitness on Match Performance in Young Male Soccer Players Castagna, Carlo 1,2 ; Impellizzeri, Franco 3 ; Cecchini, Emilio 1 ; Rampinini, Ermanno 4 ; Alvarez, José Carlos Barbero 5 Author Information 1 San Marino Football Federation (FSGC), Department of Research, San Marino; 2 Corso di Laurea in Scienze Motorie, Facoltà di Medicina e Chirurgia, Università di Roma Tor Vergata, Roma, Italy; 3 Neuromuscular Research Laboratory, Schulthess Clinic, Zurich, Switzerland; 4 Human Performance Laboratory, S. S. MAPEI srl, Via Don Minzoni 34, Castellanza, Varese, Italy; and 5 Facultad de Educación y Humanidades de Melilla, Departamento de Educación Física y Deportiva Universidad de Granada, Melilla, Spain Address correspondence to Carlo Castagna, castagnac@libero.it. Journal of Strength and Conditioning Research 23(7):p 1954-1959, October 2009. | DOI: 10.1519/JSC.0b013e3181b7f743 Free Metrics Abstract Castagna, C, Impellizzeri, F, Cecchini, E, Rampinini, E, and Barbero Alvarez, JC. match ( 15 ). Although talent selection is an uncertain procedure because there are many different factors that are involved in the development of a prospective player, knowledge of fitness profiles of successful players has been indicated as a valuable resource to guide talent selection and subsequent coaching ( 2,26,28,34 ). Additionally, the assessment of the changes induced by different training strategies on physical components relevant for soccer performance is important in the control of the training process ( 13 ). −1 ); Sprinting (SPR, speed >18.0 km·h −1 ); High-intensity activity (HIA; HIR+SPR). The competitive matches (11 vs. 11) were played at the same hour of the day (1530) on a regular size, synthetic-grass soccer pitch with each half lasting 30 minutes (10-minute interval). Air temperature and relative humidity during the matches were 23.5 ± 05°C and 35 ± 10.5%, respectively. 05) professional players ( 16,17 ). In the present study we measured the physical match performance using a GPS system. Although various studies have provided preliminary results on the accuracy of GPS technology, the 1-Hz sampling rate may not be adequate to measure running activities at very high speeds such as sprinting. level, is warranted. Several authors have suggested that soccer demands are similar across genders and competitive levels, with the difference occurring predominantly in match tempo ( 17,28 ). This studies findings are in line with this assumption because the mean %HRmax attained during the match was similar to those reported in elite male and female adult soccer players ( 17,28 ) and elite young soccer players ( 29 )."
    },
    {
        "title": "Physiologic responses to heavy-resistance exercise with very short rest periods",
        "abstract": "Subscribe to RSS Please copy the URL and add it into your RSS Feed Reader. https://www.thieme-connect.de/rss/thieme/en/10.1055-s-00000028.xml Share / Bookmark Facebook X Linkedin Weibo Download PDF Int J Sports Med 1987; 08(4): 247-252 DOI: 10.1055/s-2008-1025663 © Georg Thieme Verlag Stuttgart · New York Physiologic Responses to Heavy-Resistance Exercise with Very Short Rest Periods* W. J. Kraemer, B. J. Noble, M. J. Clark, B. W. Culver Human Energy Research Laboratory, School of Physical and Health Education, Department of Zoology/Physiology and the School of Pharmacy, The University of Wyoming, Laramie, WY 82071 USA * Supported in part by a grant from the National Strength and Conditioning Association. Further Information Publication History Publication Date: 14 March 2008 (online) Also available at Abstract PDF (348 kb) PDF Download Buy Article Permissions and Reprints Abstract Heavy-resistance exercise utilizing very short rest periods is commonly used by body builders to prepare for competition."
    },
    {
        "title": "Acute physiological responses during crossfit® workouts",
        "abstract": "Acute physiological responses during crossfit® workouts Authors Jaime Fernández Fernández Sports Research Centre, Miguel Hernandez University, Elche Rafael Sabido Solana Sports Research Centre, Miguel Hernandez University, Elche Diego Moya Master in Sports Performance and Health, Miguel Hernandez University, Elche Jose Manuel Sarabia Marin Sports Research Centre, Miguel Hernandez University, Elche Manuel Moya Ramón Sports Research Centre, Miguel Hernandez University, Elche Abstract The aims of the present study were to describe the acute physiological and perceptual response of two typical CrossFit ® workouts of the day (WODs) and to investigate whether the physical demands of these WODs meet the criteria laid down by the ACSM to improving and maintaining cardiovascular fitness in healthy adults. Methodology: ten healthy subjects (Age: 30±4.2 years) volunteered to participate in a study including laboratory incremental treadmill test and two CrossFit ® WODs (e.g., “Fran” and “Cindy”). Measurements included subjects’ oxygen uptake (VO2), heart rate (HR), blood lactate (LA) and ratings of perceived exertion (RPE). ). Is high-intensity interval training a time-efficient exercise strategy to improve health and fitness? Appl Physiol Nutr Metab, 39(3), 409-412. doi: 10.1139/apnm-2013-0187 Glassman, G. (2007). maintenance of fat-free mass and resting metabolic rate during weight loss. Sports medicine, 36(3), 239-262. Tanner, R. K., Fuller, K. L., & Ross, M. L. (2010)."
    },
    {
        "title": "Principles of exercise physiology: responses to acute exercise and long-term adaptations to training",
        "abstract": "PM&R Volume 4, Issue 11, November 2012, Pages 797-804 Introduction Theme issue: Exercise and sports Principles of Exercise Physiology: Responses to Acute Exercise and Long-term Adaptations to Training Author links open overlay panel Anita M. Rivera-Brown PhD a, Walter R. Frontera MD, PhD b Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.pmrj.2012.10.007 Get rights and content Abstract Physical activity and fitness are associated with a lower prevalence of chronic diseases, such as heart disease, cancer, high blood pressure, and diabetes. This review discusses the body's response to an acute bout of exercise and long-term physiological adaptations to exercise training with an emphasis on endurance exercise. An overview is provided of skeletal muscle actions, muscle fiber types, and the major metabolic pathways involved in energy production. Thus, there are 2 major factors that could limit VO 2 max: cardiac output and the capacity of active muscle to extract oxygen from arterial blood. Limitations to Oxygen Consumption During Exercise Chronic inactivity as well as several medical conditions [11, 12, 14] can impair one or more of the mechanisms involved in either oxygen transport (stroke volume and/or heart rate) or oxygen utilization (CaO 2 or CVO 2 ), which results in a decrease in VO 2 max and impaired exercise performance. For example, patients with aortic stenosis have a low stroke volume during exercise due to the increased resistance imposed by the stiff aortic valve, which leads to a reduction in maximal cardiac output, Factors That Affect Aerobic Exercise Performance The capacity for prolonged exercise and sports performance is also dependent on other factors, such as muscle buffering capacity, gender, age, and genetics [15, 16, 17, 18, 19, 20, 21]. Bone and skeletal muscle are integrated organs and their coupling has been considered mainly a mechanical one in which bone serves as attachment site to muscle while muscle applies load to bone and regulates bone metabolism. However, skeletal muscle can affect bone homeostasis also in a non-mechanical fashion, i.e., through its endocrine activity. Being recognized as an endocrine organ itself, skeletal muscle secretes a panel of cytokines and proteins named myokines, synthesized and secreted by myocytes in response to muscle contraction."
    },
    {
        "title": "Physiologic and metabolic responses to a continuous functional resistance exercise workout",
        "abstract": "Original Research Physiologic and Metabolic Responses to a Continuous Functional Resistance Exercise Workout Lagally, Kristen M; Cordero, Jeanine; Good, Jon; Brown, Dale D; McCaw, Steven T Author Information School of Kinesiology and Recreation, Illinois State University, Normal, Illinois Address correspondence to Kristen M. Lagally, kmlagal@ilstu.edu. Journal of Strength and Conditioning Research 23(2):p 373-379, March 2009. | DOI: 10.1519/JSC.0b013e31818eb1c9 Free Metrics Abstract Lagally, KM, Cordero, J, Good, J, Brown, DD, and McCaw, ST. Physiologic and metabolic responses to a continuous functional resistance exercise workout. 9-12,14,19 ). Performing functional resistance exercises in a continuous format has the potential to provide a better cardiorespiratory stimulus than circuit weight training through the use of dynamic traveling patterns within both upper and lower extremities. This allows continuous use of the large muscle groups, which is a recommended component of cardiorespiratory endurance exercise prescription ( 1 ). whole-body movements and dynamic traveling patterns that reflect sport and activities of daily living-like characteristics. The warm-up and cool-down included basic arm and leg patterns and were performed with the cable secured at midheight. Warm-up exercises included overhead circles with a side lunge pattern, side-to-side rotation with a lunge pattern, and stationary overhead lift, all using light resistances. post lactate values, overall RPE, energy expenditure (total kilocalories, kilocalories per minute, and kilocalories per kilogram per minute), percent fat, and body weight. The alpha level was adjusted using the Bonferroni procedure (0.05/15 = 0.003) where appropriate. Pearson correlations were calculated to examine the relationship between absolute and relative resistance lifted, relative o 2, relative o 2 R, and absolute and relative energy expenditure. perform exercise at an intensity of 50-85% o 2 R ( 1 ). The ACSM also recommends an energy expenditure of 150-400 kcal·d −1 from physical activity ( 1 ). The CFE workout examined in this investigation meets the energy expenditure recommendations, with a mean expenditure of 289 kcal for 28.5 minutes of exercise."
    },
    {
        "title": "Acute physiological outcomes of high-intensity functional training: a scoping review",
        "abstract": "Acute physiological outcomes of high-intensity functional training: a scoping review Literature Review Anatomy and Physiology Kinesiology Public Health Sports Medicine Jacob M. McDougle ​ 1, Gerald T. Mangine ​ ​ 1, Jeremy R. Townsend 2, Adam R. Jajtner 3, Yuri Feito 1, 4 Post to Authors on X Published January 3, 2023 Read the peer review reports Author and article information 1 Exercise Science and Sport Management, Kennesaw State University, Kennesaw, GA, United States 2 Exercise and Nutrition Science, Lipscomb University, Nashville, TN, United States 3 Exercise Physiology, Kent State University, Kent, OH, United States 4 American College of Sports Medicine, Indianapolis, IN, United States DOI 10.7717/peerj.14493 Published 2023-01-03 Accepted 2022-11-09 Received 2022-08-26 Academic Editor Jeremy Loenneke Subject Areas Anatomy and Physiology, Kinesiology, Public Health, Sports Medicine Keywords CrossFit, Exercise intensity, Methodology, Resistance exercise, HIIT Copyright © 2023 McDougle et al. Licence This is an open access article distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, reproduction and adaptation in any medium and for any purpose provided that it is properly attributed. For attribution, the original author(s), title, publication source (PeerJ) and either DOI or URL of the article must be cited. auto-regulate rest so that effort may range from continuous to intermittent ( Feito et al., 2018b ). HIFT protocols may also specify work and rest intervals at times, and when this occurs, these are referred as multimodal HIIT. Compared to traditional, moderate-intensity continuous training, HIIT, multimodal HIIT, and HIFT may be more attractive. itions to an exercise that must be completed within 1 min and repeats this prescription every minute for a pre-defined duration. The EMOM structure is also flexible in that interval durations are not limited to lasting 1 min only. An E2MOM repeats prescription every 2 min on the minute, whereas the prescribed repetitions of “Death by…” workouts increase the repetitions to be completed on each minute. accomplished by its instructions ( i.e., AMRAP or TTC) but because the trainee may auto-regulate rest intervals and is free to scale intensity, duration, and complexity, the degree of overload may range drastically. The trainee’s discretion also necessarily affects any periodization strategy that might be employed to achieve HIFT’s defining characteristic, to develop general physical preparedness. While individual workouts may be designed to only challenge one or a few targeted physiological traits, the accumulation of several workouts across training is intended to challenge and stimulate simultaneous adaptations across all areas of fitness ( e.g., cardiorespiratory and circulatory fitness, metabolic function, neuromuscular function and quality, etc. ) sufficiently addressed over the course of training to help reduce the likelihood of neglecting specific health or fitness variables ( i.e., those that might be neglected say, if an individual only focused on weightlifting or cardiovascular endurance) ( CrossFit, 2019 ). This template shares many similar definitions and methodological similarities to those stated for HIFT ( Feito et al., 2018b ). Because of these similarities, as well as the sheer volume of CrossFit®-affiliated training facilities worldwide, CrossFit® participants and training facilities are commonly involved within HIFT-related research ( Feito et al., 2018b ; CrossFit, 2017 )."
    },
    {
        "title": "Dose-dependent effects of exercise and diet on insulin sensitivity and secretion",
        "abstract": "No content available for summarization."
    },
    {
        "title": "The role of exercise for weight loss and maintenance",
        "abstract": "Best Practice & Research Clinical Gastroenterology Volume 18, Issue 6, December 2004, Pages 1009-1029 1 The role of exercise for weight loss and maintenance Author links open overlay panel Joseph E. Donnelly EDD, FACSM, Bryan Smith PhD 1, Dennis J. Jacobsen PhD 2, Erik Kirk MS 3, Katrina DuBose PhD 4, Melissa Hyder PhD 5, Bruce Bailey MS 6, Richard Washburn ( Associate Professor ) 7 Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.bpg.2004.06.022 Get rights and content Exercise provides a means of increasing energy expenditure and may help adjust energy balance for weight loss and maintenance. At least 30 minutes a day of moderate intensity aerobic exercise per day is recommended for weight loss and maintenance but greater amounts appear to increase the magnitude of weight loss and maintenance. Resistance training has recently been shown to have positive effects on body composition but does not typically show significant decreases in weight. and weight maintenance’ (p. 82). The primary reason behavioural strategies are encouraged is that behaviours are learned and can, in turn, be changed or modified. Behavioural Conclusions Exercise is an important component of energy balance and is the only component under voluntary control. al. Effect of sustained resistance training on basal metabolic rate in older women J Am Geriatr Soc (1995) L.M.L.A. Van Etten et al. rights reserved."
    },
    {
        "title": "Does brief telephone support improve engagement with a web-based weight management intervention? Randomized controlled trial",
        "abstract": "Original Paper Laura Dennison 1, PhD ; Leanne Morrison 1, PhD ; Scott Lloyd 2, MSc ; Dawn Phillips 3, MSc ; Beth Stuart 1, PhD ; Sarah Williams 4, PhD ; Katherine Bradbury 1, PhD ; Paul Roderick 1, MD ; Elizabeth Murray 5, FRCGP, FRCPE, PhD ; Susan Michie 5, BA, MPhil, DPhil ; Paul Little 1, FMedSci ; Lucy Yardley 1, PhD 1 University of Southampton, Southampton, United Kingdom 2 Redcar and Cleveland Borough Council, Redcar, United Kingdom 3 Durham County Council, Durham, United Kingdom 4 Bournemouth University, Bournemouth, United Kingdom 5 University College London, London, United Kingdom Corresponding Author: Laura Dennison, PhD University of Southampton Academic Unit of Psychology, Highfield Campus, Highfield Southampton, SO17 1BJ United Kingdom Phone: 44 02380 597657 Fax:44 02380 597657 Email: l.k.dennison@soton.ac.uk Abstract Background: Recent reviews suggest Web-based interventions are promising approaches for weight management but they identify difficulties with suboptimal usage. The literature suggests that offering some degree of human support to website users may boost usage and outcomes. Objective: We disseminated the POWeR (“Positive Online Weight Reduction”) Web-based weight management intervention in a community setting. and Without Dietitian Online Coaching for Adults With Overweight and Obesity: Randomized Control... Alline Beleigoli, J Med Internet Res, 2020 Examining Factors of Engagement With Digital Interventions for Weight Management: Rapid Review Emma Elizabeth Sharpe, JMIR Res Protoc, 2017 Reach, Engagement, and Retention in an Internet-Based Weight Loss Program in a Multi-Site Randomized Controlled Trial Russell E. Glasgow, Candace C. Nelson, Kathleen A. Kearney, et al., J Med Internet Res, 2007 The Role of Social Media in Online Weight Management: Systematic Review Tammy Chang, J Med Internet Res, 2013 An Adaptive Telephone Coaching Intervention for Patients in an Online Weight Loss Program: A Randomized Clinical Trial Jessica L. Unick, JAMA Network Open, 2024 A Randomized Trial Comparing Human e-Mail Counseling, Computer-Automated Tailored Counseling, and No Counseling in an Internet Weight Loss Program Deborah F. Tate, JAMA Internal Medicine, 2006 Using Internet Technology to Deliver a Behavioral Weight Loss Program Deborah F. Tate, Journal of American Medical Association, 2001 COMPARISON OF WEB-BASED INTERVENTIONS FOR WEIGHT LOSS AND WEIGHT MAINTENANCE IN RURAL WOMEN P.A. Hageman, Innov Aging, 2017 Effects of Internet Behavioral Counseling on Weight Loss in Adults at Risk for Type 2 Diabetes: A Randomized Trial Deborah F. Tate, Journal of American Medical Association, 2003 Powered by Privacy policy Google Analytics settings Introduction Background Internationally, obesity is one of the biggest public health concerns [ Finucane MM, Stevens GA, Cowan MJ, Danaei G, Lin JK, Paciorek CJ, Global Burden of Metabolic Risk Factors of Chronic Diseases Collaborating Group (Body Mass Index). National, regional, and global trends in body-mass index since 1980: systematic analysis of health examination surveys and epidemiological studies with 960 country-years and 9·1 million participants. Such findings are not limited to Web-based weight loss interventions but are common across different types of eHealth interventions. One possible explanation for variations in the efficacy of and engagement with Web-based interventions is the variation in the human contact participants have to support them as they participate in the Web-based program. Human support may be in various formats including face-to-face individual or group meetings, telephone calls, text messages, emails, or online chat. Halterman E,  et al. Outcomes of minimal and moderate support versions of an internet-based diabetes self-management support program. J Gen Intern Med  2010 Dec;25(12):1315-1322  [ FREE Full text ] [ CrossRef ] [ Medline ] 4, Glasgow RE, Christiansen SM, Kurz D, King DK, Woolley T, Faber AJ,  et al. we disseminated “POWeR” (Positive Online Weight Reduction), a completely automated Web-based weight management intervention (described in detail below). Other RCTs (ISRCTN31685626 and ISRCTN21244703) are examining the efficacy of POWeR for weight loss in a primary care setting with nurse support. In contrast, the current study sought to investigate engagement with this intervention in a high-reach, low-cost public health context."
    },
    {
        "title": "Effect of exercise on 24-month weight loss maintenance in overweight women",
        "abstract": "Effect of Exercise on 24-Month Weight Loss Maintenance in Overweight Women | Lifestyle Behaviors | JAMA Internal Medicine | JAMA Network [Skip to Navigation] We have recognized your opt-out signal. To learn more about changing your opt-in signal preferences, please visit globalprivacycontrol.org Opt out of targeted advertising When you visit our website, we store cookies on your browser to collect information. The information collected may be used on our Sites to assess what features are most important to users, and to allow you to access the Sites without re-entering a username or password, personalize Sites for future use, and other similar activities."
    },
    {
        "title": "The effects of exercise and physical activity on weight loss and maintenance",
        "abstract": "Progress in Cardiovascular Diseases Volume 61, Issue 2, July–August 2018, Pages 206-213 The Effects of Exercise and Physical Activity on Weight Loss and Maintenance ☆ Author links open overlay panel Damon L. Swift a b, Joshua E. McGee a b, Conrad P. Earnest c, Erica Carlisle a b, Madison Nygard a b, Neil M. Johannsen d Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.pcad.2018.07.014 Get rights and content Abstract Obesity represents a major health problem in the United States and is associated with increased prevalence of cardiovascular (CV) disease risk factors. Physical activity (PA) and exercise training (ET) are associated with reduced CV risk, improved cardiometabolic risk factors, and facilitated weight loss through creating a negative energy balance. Clinicians need to counsel overweight and obese patients on how much PA/ET is needed to promote weight loss and weight loss maintenance. that even mild weight regain (2–6%) 83 has been associated with regression in major CV risk factors, such as total cholesterol, 84, 85 LDL cholesterol, 85, 86 TGs, 84, 87, 88 BP,87., 88., 89. glucose 84, 85, 90 and insulin levels. 86, 89 Successful weight loss maintenance has been associated with reduced PA level and weight maintenance beyond 18 months While much of the aforementioned studies focused on short-term weight maintenance (<2 years), a few prospective studies have looked at how PA level affects long-term maintenance. Data from the Diabetes Prevention Program (DPP) 100 evaluated 12 months and 3 year weight loss in adults with high risk for DM. the treatment of dyslipidemia Prev Med (2002) D.J. Johns et al. Diet or exercise interventions vs combined behavioral weight management programs: a systematic review and meta-analysis of direct comparisons J Acad Nutr Diet (2014) M.L. 100 minutes/day) is unrealistic for the majority of individuals who are overweight/obese, and thus of limited practical relevance. Therefore, dietary prescription plays a key role to create an energy deficit and facilitate fat mass loss (164). However, exercise may help to preserve lean mass (both muscle and bone) and functional performance during periods of energy restriction (165) and should be considered as an important supplement to nutritional approaches for those who endeavour to reduce adiposity. iovascular Disease 2020, Current Obesity Reports View all citing articles on Scopus ☆ Funding: None. Statement of Conflict of Interest: see page 211. View full text © 2018 Elsevier Inc. All rights reserved."
    },
    {
        "title": "Effects of a popular exercise and weight loss program on weight loss, body composition, energy expenditure and health in obese women",
        "abstract": "Home Nutrition & Metabolism Article Effects of a popular exercise and weight loss program on weight loss, body composition, energy expenditure and health in obese women Research Open access Published: 14 May 2009 Volume 6, article number 23, ( 2009 ) Cite this article Download PDF You have full access to this open access article Nutrition & Metabolism Aims and scope Submit manuscript Effects of a popular exercise and weight loss program on weight loss, body composition, energy expenditure and health in obese women Download PDF Chad Kerksick 1, 2, Ashli Thomas 3, Bill Campbell 4, Lem Taylor 5, Colin Wilborn 5, Brandon Marcello 6, Mike Roberts 1, Emily Pfau 3, Megan Grimstvedt 3, Jasmine Opusunju 3, Teresa Magrans-Courtney 3, Christopher Rasmussen 7, Ron Wilson 3 & … Richard B Kreider 7 Show authors 42k Accesses 17 Altmetric 1 Mention Explore all metrics Abstract Objective To determine the safety and efficacy of altering the ratio of carbohydrate and protein in low-energy diets in conjunction with a popular exercise program in obese women. Design Matched, prospective clinical intervention study to assess efficacy of varying ratios of carbohydrate and protein intake in conjunction with a regular exercise program. Participants One-hundred sixty one sedentary, obese, pre-menopausal women (38.5 ± 8.5 yrs, 164.2 ± 6.7 cm, 94.2 ± 18.8 kg, 34.9 ± 6.4 kg·m -2, 43.8 ± 4.2%) participated in this study. and throughout the world continues to increase. An estimated 1.2 billion people in the world are overweight with 300 million of them being obese [ 1, 2 ]. Research over the last several decades indicates that regular activity and appropriate energy intake can play critical roles in preventing and managing the negative health consequences of diabetes, obesity and other cardiovascular diseases [ 3 – 7 ]. that replaced dietary carbohydrate with protein would experience greater improvements in anthropometrics and body composition in addition to greater improvements in cardiovascular disease markers. Methods Experimental Approach Two primary objectives were studied in this investigation, first to examine the impact of replacing dietary carbohydrate with dietary protein to varying degrees and second to assess the effectiveness of following the exercise and diet recommendations of the Curves program that were published at the time this study was initiated [ 19 ]. Participants were placed into one of six groups: no diet + no exercise control (CON), no diet + exercise (ND), high carbohydrate, high energy diet (HED) + exercise (2,600; 55:15:30%); very low carbohydrate, high protein (VLCHP) + exercise (1,200; 63:7:30%), low carbohydrate, moderate protein (LCMP) + exercise (1,200: 50:20:30%), high carbohydrate, low protein (HCLP) + exercise group (1,200: 55:15:30%). participants completed informed consent documents during this familiarizations session. Prior to all testing sessions including baseline, participants completed a 4 d dietary record, observed an 8 h fast and refrained from vigorous physical activity for 24 h prior to each testing session. All testing sessions were scheduled at similar times in the morning to control for diurnal variations. -calibrating digital scale with an accuracy of ± 0.02 kg. Waist circumference was measured using a Golnick tensiometer using standard ACSM criteria [ 21 ]. Resting heart rate was measured via palpation of the radial artery and resting blood pressure was determined using a mercury sphygomometer (American Diagnostic Corporation, model # AD-720, Hauppuage, NY) according to previously accepted procedures [ 21 ]."
    },
    {
        "title": "Possible stimuli for strength and power adaptation: acute metabolic responses",
        "abstract": "Home Sports Medicine Article Possible Stimuli for Strength and Power Adaptation Acute Metabolic Responses Review Article Published: 27 November 2012 Volume 36, pages 65–78, ( 2006 ) Cite this article Sports Medicine Aims and scope Submit manuscript Blair Crewther 1, John Cronin 1 & Justin Keogh 1 1146 Accesses 47 Citations Explore all metrics Abstract The metabolic response to resistance exercise, in particular lactic acid or lactate, has a marked influence upon the muscular environment, which may enhance the training stimulus (e.g. motor unit activation, hormones or muscle damage) and thereby contribute to strength and power adaptation. Hypertrophy schemes have resulted in greater lactate responses (%) than neuronal and dynamic power schemes, suggesting possible metabolic-mediated changes in muscle growth. Pryor JF. Use of the isoinertial force mass relationship in the prediction of dynamic human performance. Eur J Appl Physiol 1994; 69: 250–257 Article CAS Google Scholar Gibala MJ, Interisano SA, Tarnopolsky MA, et al. Williams & Wilkins, 1996: 121–138 Google Scholar Conley M. Bioenergetics of exercise and training. In: Baechle TR, Earle RW, editors. Essentials of strength training and conditioning. Cond Res 1995; 9 (3): 139–142 Google Scholar Mulligan SE, Fleck SJ, Gordon SE, et al. Influence of resistance exercise volume on serum growth hormone and cortisol concentrations in women. J Strength Cond Res 1996; 10 (4): 256–262 Google Scholar Gotshalk LA, Loebel CC, Nindl BC, et al. aged 19–69 years. J Gerontol A Biol Sci Med Sci 2002; 57A (4): B158–B165 Article CAS Google Scholar Pierce K, Rozenek R, Stone M. Effects of high volume weight training on lactate, heart rate, and perceived exertion. J Strength Cond Res 1993; 7 (4): 211–215 Google Scholar Tesch P. Acute and long-term metabolic changes consequent to heavy resistance exercise."
    },
    {
        "title": "Metabolic Training: The Ultimate Guide to the Ultimate Workout",
        "abstract": "Metabolic Training: The Ultimate Guide to the Ultimate Workout - John Graham, Michael Barnes - Google Books Sign in Try the new Google Books Books Add to my library Page i Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Page 3 The Ultimate Guide to the Ultimate Workout John Graham, Michael Barnes. Why. Metabolic ."
    },
    {
        "title": "Specificity of training adaptation: time for a rethink?",
        "abstract": "J Physiol. 2008 Jan 1;586(Pt 1):1–2. doi: 10.1113/jphysiol.2007.147397 Search in PMC Search in PubMed View in NLM Catalog Add to search Specificity of training adaptation: time for a rethink? to exercise participation and adherence regardless of sex, age or health status. As with all studies, one should use caution when extrapolating the results beyond the specific conditions of the investigation. With regard to the time course of training-induced responses, it may be that high-intensity sprint training stimulates a more rapid up-regulation of selected physiological/metabolic markers than traditional low-intensity endurance training, but that over a longer period, the two training regimens elicit similar adaptations."
    },
    {
        "title": "Sprint exercise snacks: a novel approach to increase aerobic fitness",
        "abstract": "Home European Journal of Applied Physiology Article Sprint exercise snacks: a novel approach to increase aerobic fitness Original Article Published: 07 March 2019 Volume 119, pages 1203–1212, ( 2019 ) Cite this article European Journal of Applied Physiology Aims and scope Submit manuscript Jonathan P. Little ORCID: orcid.org/0000-0002-9796-2008 1, Jodi Langley 1, Michael Lee 1, Etienne Myette-Côté 1, Garett Jackson 1, Cody Durrer 1, Martin J. Gibala 2 & … Mary E. Jung 1 Show authors 5798 Accesses 289 Altmetric 26 Mentions Explore all metrics Abstract Purpose Sprint interval training (SIT), involving brief intermittent bursts of vigorous exercise within a single training session, is a time-efficient way to improve cardiorespiratory fitness (CRF). It is unclear whether performing sprints spread throughout the day with much longer (≥ 1 h) recovery periods can similarly improve CRF, potentially allowing individuals to perform “sprint snacks” throughout the day to gain health benefits. Methods Healthy, young, inactive adults (~ 22 years, peak oxygen uptake [VO 2 peak] ~ 35 ml kg − 1 min − 1 ) were randomly assigned to one of two groups and performed 18 training sessions over 6 wks. 425 Article Google Scholar Burgomaster KA, Hughes SC, Heigenhauser GJ, Bradwell SN, Gibala MJ (2005) Six sessions of sprint interval training increases muscle oxidative potential and cycle endurance capacity in humans. J Appl Physiol 98(6):1985–1990 Article PubMed Google Scholar Burgomaster KA, Heigenhauser GJ, Gibala MJ (2006) Effect of short-term sprint interval training on human skeletal muscle carbohydrate metabolism during exercise and time-trial performance. J Appl Physiol 100(6):2041–2047 Article PubMed Google Scholar Cochran AJ, Percival ME, Tricarico S, Little JP, Cermak N, Gillen JB, Tarnopolsky MA, Gibala MJ (2014) Intermittent and continuous high-intensity exercise training induce similar acute but different chronic muscle adaptations. ) Exercise capacity and mortality among men referred for exercise testing. N Engl J Med 346(11):793–801 Article PubMed Google Scholar O’Malley T, Myette-Cote E, Durrer C, Little JP (2017) Nutritional ketone salts increase fat oxidation but impair high-intensity exercise performance in healthy adult males. Appl Physiol Nutr Metab 42:1031–1035 Article CAS PubMed Google Scholar Piercy KL, Troiano RP, Ballard RM et al (2018) The physical activity guidelines for Americans. . Corresponding author Correspondence to Jonathan P. Little. Additional information Communicated by Nicolas Place. improves indices of cardiometabolic health similar to traditional endurance training despite a five-fold lower exercise volume and time commitment. PloS one 11(4):e0154075 Article CAS PubMed PubMed Central Google Scholar Godin G, Shephard R (1985) A simple method to assess exercise behavior in the community. Can J Appl Sport Sci 10(3):141–146 CAS Google Scholar Ho B, Lim I, Tian R, Tan F, Aziz A (2018) Effects of a novel exercise training protocol of Wingate-based sprint bouts dispersed over a day on selected cardiometabolic health markers in sedentary females: a pilot study."
    },
    {
        "title": "Strength training and aerobic exercise: comparison and contrast",
        "abstract": "BRIEF REVIEW: PDF Only STRENGTH TRAINING AND AEROBIC EXERCISE COMPARISON AND CONTRAST KNUTTGEN, HOWARD G. Author Information Department of Physical Medicine & Rehabilitation, Harvard Medical School, Spaulding Rehabilitation Hospital, Boston, Massachusetts 02114. Address correspondence to Dr. Howard G. Knuttgen, hknuttgen@partners.org . Journal of Strength and Conditioning Research 21(3):p 973-978, August 2007."
    },
    {
        "title": "The effect of endurance training on parameters of aerobic fitness",
        "abstract": "Home Sports Medicine Article The Effect of Endurance Training on Parameters of Aerobic Fitness Leading Article Published: 24 September 2012 Volume 29, pages 373–386, ( 2000 ) Cite this article Sports Medicine Aims and scope Submit manuscript Andrew M. Jones 1 & Helen Carter 2 38k Accesses 227 Altmetric 47 Mentions Explore all metrics Abstract Endurance exercise training results in profound adaptations of the cardiorespiratory and neuromuscular systems that enhance the delivery of oxygen from the atmosphere to the mitochondria and enable a tighter regulation of muscle metabolism. These adaptations effect an improvement in endurance performance that is manifest as a rightward shift in the ‘velocity-time curve’. This shift enables athletes to exercise for longer at a given absolute exercise intensity, or to exercise at a higher exercise intensity for a given duration. prevents decline in stroke volume during exercise in young healthy subjects. J Appl Physiol 1992; 72: 2458–62 PubMed CAS Google Scholar Paterson DH, Shephard RJ, Cunningham D, et al. Effects of physical training upon cardiovascular function following myocardial infarction. 27: 404–9 PubMed CAS Google Scholar Pate RR, Macera CA, Bailey SP, et al. Physiological, anthropometric, and training correlates of running economy. Med Sci Sports Exerc 1995; 24: 1128–33 Google Scholar Morgan DW, Daniels JT. 31 (6): 870–7 PubMed CAS Google Scholar Daniels J, Daniels N. Running economy of elite male and elite female runners. Med Sci Sports Exerc 1992; 24: 483–9 PubMed CAS Google Scholar Morgan DW, Baldini FD, Martin PE, et al. Ten kilometer performance and predicted velocity at V̇O 2max among well-trained male runners. et al. Physiological characteristics related to endurance running performance in female distance runners. J Sports Sci 1993; 11: 57–62 PubMed CAS Google Scholar Zoladz JA, Sargeant AJ, Emmerich J, et al."
    },
    {
        "title": "Whole-body aerobic resistance training circuit improves aerobic fitness and muscle strength in sedentary young females",
        "abstract": "Original Research Whole-Body Aerobic Resistance Training Circuit Improves Aerobic Fitness and Muscle Strength in Sedentary Young Females Myers, Terrence R.; Schneider, Matthew G.; Schmale, Matthew S.; Hazell, Tom J. Author Information Department of Kinesiology and Physical Education, Faculty of Arts and Science, University of Lethbridge, Lethbridge, Alberta, Canada Address correspondence to Tom J. Hazell, thazell@wlu.ca. Journal of Strength and Conditioning Research 29(6):p 1592-1600, June 2015.  time-efficient workout would improve both cardiovascular fitness and muscular strength/endurance is not well understood. Recently, it was demonstrated that single-set whole-body aerobic resistance training (8 sets of 20-second intervals with 10-second rest between sets over 4 weeks; Tabata protocol) using body weight exercises with light external loads improved cardiovascular fitness in recreationally active females similar to traditional endurance training, but only the interval group improved muscular endurance ( 27 ). This high-intensity exercise format can be tailored to many exercise protocols and can be performed without fitness equipment by performing specific body weight exercises (i.e., squats, lunges, and burpees) in succession with only small breaks between exercises or between sets of exercises. ometer (model 874-E; Monark Exercise, Stockholm, Sweden) was used to determine V[Combining Dot Above]O 2 peak using an online breath-by-breath gas collection system (Quark CPET; Cosmed, Chicago, IL, USA). Before testing, gas analyzers were calibrated using a 3-L syringe and compressed gas of a known concentration. After a 5-minute warm-up at resistance of 1 kg and 70 rpm (∼70 W), an additional 0.5-kg resistance was added (∼35 W) every 2 minutes until 70 rpm could no longer be maintained or volitional fatigue. 5 different exercise routines ( Table 2 ) completed in the traditional training group. Each routine was performed for 1 week (3 sessions). These training sessions had participants perform resistance training for 2–3 sets at ∼50–70% 1RM for each exercise with 12–15 repetitions. significant interaction with time for chest strength (training group vs. time; p = 0.214), but there was a main effect of time ( p < 0.001) where both CIRCUIT (20.6%; p = 0.011) and COMBINED (35.6%; p < 0.001) improved (Figure 3A). There was no interaction with time for back strength ( p = 0.678), but there was a main effect of time ( p = 0.004) where COMBINED improved (11.7%; p = 0.017) but CIRCUIT did not ( p = 0.137; Figure 3B). There was no interaction with time for quadriceps strength ( p = 0.308), but there was a main effect of time ( p = 0.003) where only COMBINED (9.6%; p = 0.006) improved with training (CIRCUIT; p = 0.137; Figure 3C)."
    },
    {
        "title": "Aerobic exercise and creative potential: immediate and residual effects",
        "abstract": "Abstract The potential effects of aerobic exercise on creative potential were explored both immediately following moderate aerobic exercise and after a 2-hr lag. Sixty college students participated in an experiment consisting of 3 regimens varying the time when a Torrance Test of Creative Thinking was taken in relation to exercise completion. The results supported the hypotheses that creative potential will be greater on completion of moderate aerobic exercise than when not preceded by exercise (immediate effects), that creative potential will be greater following a 2-hr lag time following exercise than when not preceded by exercise (residual effects), and that creative potential will not be significantly different immediately following exercise than after a 2-hr lag time following exercise (enduring residual effects)."
    },
    {
        "title": "The SNAPSHOT study protocol: snacking, physical activity, self-regulation, and heart rate over time",
        "abstract": "Home BMC Public Health Article The SNAPSHOT study protocol: SNAcking, Physical activity, Self-regulation, and Heart rate Over Time Study protocol Open access Published: 26 September 2014 Volume 14, article number 1006, ( 2014 ) Cite this article Download PDF You have full access to this open access article BMC Public Health Aims and scope Submit manuscript The SNAPSHOT study protocol: SNAcking, Physical activity, Self-regulation, and Heart rate Over Time Download PDF David McMinn 1 & Julia L Allan 2 3526 Accesses 6 Citations 4 Altmetric Explore all metrics Abstract Background The cognitive processes responsible for effortful behavioural regulation are known as the executive functions, and are implicated in several factors associated with behaviour control, including focussing on tasks, resisting temptations, planning future actions, and inhibiting prepotent responses. Similar to muscles, the executive functions become fatigued following intensive use (e.g. stressful situations, when tired or busy, and when regulating behaviour such as quitting smoking). unhealthy foods following tasks designed to deplete self-control resource [ 15, 16 ]. Situations under which executive resources may become depleted include times of stress, tiredness, when extremely busy (trying to do multiple things at once), and when trying to regulate behaviours (e.g. when quitting smoking, trying not to get angry/upset etc.). collection through 2014 until a sample of around 50 participants has been achieved. Participants will be recruited using various methods including 1) study posters and flyers around University of Aberdeen buildings and local businesses, 2) distribution of a press-release to local and national media giving details of the study, and 3) creation of a study website ( http://www.abdn.ac.uk/snapshot/ ) in order to attract potential participants and to provide existing participants with relevant study information. Recruitment materials will contain study team contact details so that interested individuals can request a study information sheet providing additional details on the study protocol and inclusion and exclusion criteria. following domains: work, house and garden work, travel from place to place, and spare time (recreation, exercise, or sport). For each domain, participants are questioned about the number of days (frequency) and hours and minutes per day (volume) that they spend at different activity intensities (i.e. vigorous and moderate). -A has demonstrated high internal consistency (alphas range from.93-.96), good test-retest correlations (.82-.93 over 4 weeks), and adequate convergent and divergent validity [ 37 ]. Dietary and physical activity intentions, past behaviour, and automaticity Dietary intentions will be measured using six items. The stem ‘over the next week…’ will be followed by ‘I intend to avoid eating’ , ‘I want to avoid eating’ , and ‘I expect to avoid eating’ , in relation to ‘non-core snacks like cakes, biscuits, crisps and sweets’ , and ‘I intend to eat’ , ‘I want to eat’ , and ‘I expect to eat’ , in relation to ‘5 portions of fruit and veg a day’."
    },
    {
        "title": "Self-regulating smoking and snacking through physical activity.",
        "abstract": "APA PsycNet Buy Page Skip to Main Content APA PsycNET APA PsycNet logo Mobile menu English Login Cart (0) Help Contact Us Search Basic Search Advanced Search Browse Journal Articles APA PsycArticles Books & Encyclopedia Entries APA PsycBooks Gray Literature APA PsycExtra Recent Searches My List My PsycNet APA PsycNet Direct Article Selected Self-regulating smoking and snacking through physical activity. By Oh, Hwajung,Taylor, Adrian H. Health Psychology, Vol 33(4), Apr 2014, 349-359 Abstract Objective: Emotional snacking contributes to weight gain after smoking cessation. Exercise acutely reduces cravings for cigarettes and snack food. systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work."
    },
    {
        "title": "The Impact of Physical Fitness on Workplace Productivity",
        "abstract": "We independently review everything we recommend. When you buy through our links, we may earn a commission. Learn more› Introduction Picture this: It’s 3 PM, and you’re staring at your computer screen, fighting the urge to nod off. crucial component of workplace productivity, and exercise plays a vital role in maintaining it. Regular physical activity has been shown to be an effective tool in managing symptoms of depression and anxiety, which can significantly impact work performance. A meta-analysis published in the “Journal of Psychiatric Research” found that exercise can be as effective as antidepressant medication in treating mild to moderate depression (Kvam et al., 2016). it’s important to note that nutrition plays a crucial role in both fitness and productivity. Fueling your body with the right foods can enhance the benefits of your fitness routine and keep you energized throughout the workday. Power-Packed Snacks for Sustained Energy Keep these healthy snacks at your desk to maintain steady energy levels: Mixed nuts and seeds for healthy fats and protein Fresh fruit for quick, natural energy boosts Greek yogurt with berries for protein and antioxidants Hummus with vegetable sticks for fiber and nutrients Hydration: The Unsung Hero of Productivity Don’t underestimate the power of staying hydrated. W., & Otto, M. W. (2015). The effects of physical activity on sleep: a meta-analytic review. Journal of Behavioral Medicine, 38(3), 427-449."
    },
    {
        "title": "17 Top Fitness Trends For 2025 Reading Time 21.6 minutes",
        "abstract": "17 Top Fitness Trends Predicted For 2025 | OriGym We value your privacy We use cookies to enhance your browsing experience, serve personalised content and analyse our traffic. Click \"Allow\" to consent. Show details Allow Allow selection Necessary (12) Show details (Necessary) Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. channels. 2 years HTTP Cookie _gcl_au [x2] Google Used by Google AdSense for experimenting with advertisement efficiency across websites using their services. 3 months HTTP Cookie _uetsid [x2] Microsoft Collects data on visitor behaviour from multiple websites, in order to present more relevant advertisement - This also allows the website to limit the number of times that they are shown the same advertisement. 's video player preferences using embe"
    },
    {
        "title": "17 Top Fitness Trends For 2024",
        "abstract": "17 Top Fitness Trends Predicted For 2025 | OriGym We value your privacy We use cookies to enhance your browsing experience, serve personalised content and analyse our traffic. Click \"Allow\" to consent. Show details Allow Allow selection Necessary (12) Show details (Necessary) Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. channels. 2 years HTTP Cookie _gcl_au [x2] Google Used by Google AdSense for experimenting with advertisement efficiency across websites using their services. 3 months HTTP Cookie _uetsid [x2] Microsoft Collects data on visitor behaviour from multiple websites, in order to present more relevant advertisement - This also allows the website to limit the number of times that they are shown the same advertisement. 's video player preferences using embe"
    },
    {
        "title": "Better Daily Weight Loss Habits: Simple Changes with Lifelong Impact",
        "abstract": "Better Daily Weight Loss Habits: Simple Changes with Lifelong Impact - Sarah Pflugradt MS, RDN, CSCS - Google Books Sign in Try the new Google Books Books Add to my library Contents Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Good for: Web Tablet / iPad eReader Smartphone Features: Flowing text Scanned pages Help with devices & formats Learn more about books on Google Play Buy eBook - ₹473.15 Get this book in print ▼ Rediff Books Flipkart Infibeam Find in a library All sellers » Better Daily Weight Loss Habits: Simple Changes with Lifelong Impact By Sarah Pflugradt MS, RDN, CSCS About this book My library My History Terms of Service Pages displayed by permission of Sourcebooks, Inc. . Copyright . Loading... Loading... Loading... Loading... Loading... Loading..."
    },
    {
        "title": "Training effects of long versus short bouts of exercise in healthy subjects",
        "abstract": "The American Journal of Cardiology Volume 65, Issue 15 , 15 April 1990 , Pages 1010-1013 Miscellaneous Training effects of long versus short bouts of exercise in healthy subjects ☆ Author links open overlay panel Robert F. DeBusk MD , Ulf Stenestrand MD , Mary Sheehan MS , William L. Haskell PhD Show more Add to Mendeley Share Cite https://doi.org/10.1016/0002-9149(90)91005-Q Get rights and content Abstract To evaluate the “threshold” duration of exercise required to produce training effects, 18 healthy men aged 51 ± 6 years completing 30 minutes of exercise training/day were compared with 18 men aged 52 ± 6 years completing three 10-minute bouts of exercise/day, each separated by at least 4 hours. Exercise training intensity was moderate (65 to 75% of peak treadmill heart rate). During the 8-week study period VO 2 max increased significantly in both groups from 33.3 ± 3.2 to 37.9 ± 3.5 ml/kg/min in men performing long exercise bouts and from 32.1 ± 4.6 to 34.5 ± 4.5 ml/kg/ min in men performing short exercise bouts (p < 0.05 within and between groups)."
    },
    {
        "title": "Exercise, heart and health",
        "abstract": "No content available for summarization."
    },
    {
        "title": "Exercise and the heart—the harm of too little and too much",
        "abstract": "Chest and Abdominal Conditions: Section Articles Exercise and the Heart — the Harm of Too Little and Too Much Lavie, Carl J. MD 1 ; O’Keefe, James H. MD 2 ; Sallis, Robert E. MD, FACSM 3 Author Information 1 Department of Cardiovascular Diseases, John Ochsner Heart and Vascular Institute, Ochsner Clinical School, University of Queensland School of Medicine, New Orleans, LA; 2 St. Luke’s Mid America Heart Institute, University of Missouri, Kansas City, MO; and 3 Department of Family Medicine, Kaiser Permanente Medical Center, Fontana, CA Address for correspondence: Carl J. Lavie, MD, Cardiac Rehabilitation, Exercise Laboratories, John Ochsner Heart and Vascular Institute, Ochsner Clinical School, University of Queensland School of Medicine, 1514 Jefferson Highway, New Orleans, LA 70121–2483; E-mail: clavie@ochsner.org. Current Sports Medicine Reports 14(2):p 104-109, March/April 2015. | DOI: 10.1249/JSR.0000000000000134 Free Metrics Abstract Physical activity and exercise training are underutilized by much of Westernized society, and physical inactivity may be the greatest threat to health in the 21st century. to 150 min·wk −1 ( 11,38,40 ). The guidelines also point out that similar benefits can be obtained by engaging in more strenuous exercise (like jogging) for shorter periods of time, such that 15 min of jogging done 5 d·wk −1 (or 75 min·wk −1 ) appears to provide equivalent benefit to doing 150 min·wk −1 of walking. Risk of SCD with EEE The risk associated with EEE has been noted for centuries and evident recently with high-profile cases ( 18,27–30,32 ). to the EEE ( 29,33 ). Figure 1: Proposed pathogenesis of cardiomyopathy in endurance athletes. BNP, B-type natriuretic peptide; CK-MB, creatine kinase MB. 0001), and noncalcified plaque volume ( P = 0.04) compared with those with EEE ( Fig. 3 ) ( 37 ). Despite the fact that runners have better overall CAD risk profiles, these results underscore the potential for very heavy EEE to increase the severity of CAD through mechanisms largely independent of the traditional CAD risk factors. provide maximal protection against all-cause and CV mortality ( 15 ). Figure 4: Central illustration: hazard ratios (HR) of all-cause and CV mortality by running characteristic (weekly running time, distance, frequency, total amount, and speed). Participants were classified into six groups: nonrunners (reference group) and five quintiles of each running characteristic."
    },
    {
        "title": "Short, sharp bouts of exercise good for the heart",
        "abstract": "News Short, sharp bouts of exercise good for the heart BMJ 2000 ; 321 doi: https://doi.org/10.1136/bmj.321.7261.589/a (Published 09 September 2000) Cite this as: BMJ 2000;321:589 Article Related content Metrics Responses Peer review Scott Gottlieb Author affiliations New York Short bouts of exercise can be just as effective at protecting the heart as longer workouts, but getting the heart rate up is a key factor as light activity offers no cardiac benefit, two new studies show (Circulation 2000;102:975-80, 981-7). Physical activity has long been associated with a decreased risk of coronary heart disease. It has been unclear, however, whether the duration of exercise episodes was important and whether accumulated shorter sessions were as predictive of decreased risk as longer sessions, provided that the same amount of energy was expended in each instance."
    },
    {
        "title": "Exercise and cardiovascular health",
        "abstract": "www.ahajournals.org This page isn’t working www.ahajournals.org didn’t send any data. ERR_EMPTY_RESPONSE null Reload www.ahajournals.org didn’t send any data."
    },
    {
        "title": "Societal impact of micro-exercise for work-related musculoskeletal disorders: The case of Denmark",
        "abstract": "Societal Impacts Volume 5, June 2025, 100102 Societal impact of micro-exercise for work-related musculoskeletal disorders: The case of Denmark Author links open overlay panel Lars Louis Andersen a, Ole Henning Sørensen a, Joaquín Calatayud a b, Rubén López-Bueno a b c Show more Outline Add to Mendeley Share Cite https://doi.org/10.1016/j.socimp.2025.100102 Get rights and content Under a Creative Commons license open access Abstract Work-related musculoskeletal disorders (MSDs) cause widespread pain and suffering worldwide. Ergonomic advice on lifting technique and sitting posture has been ineffective in preventing MSDs. Through a series of studies conducted over 15 years, the National Research Centre for the Working Environment in Denmark has developed and documented the effectiveness of micro-exercise for MSDs across a range of job groups. the dose-response effect of elastic band training for pain in the neck and shoulders [7]. 3. Designing and performing a national campaign. the rhetoric from ‘strength training’ to using words like ‘elastic band exercises’, ‘small daily exercises’ and ‘micro-exercise’, emphasizing brief, manageable physical exercise bouts that could effortlessly blend into the workday. This rhetorical approach aimed to normalize strength training at the workplace, making it more culturally acceptable and feasible. Together, these efforts resulted in the simple message that two minutes of micro-exercise per day performed together with colleagues at the workplace can help alleviate MSDs. study with 70,130 workers of the general working population and a two-year register follow-up, we found that implementation of micro-exercise at all workplaces in Denmark could potentially prevent 12.8 % of all long-term sickness absence cases [9]. Considering that only one in four workers of the general working population today have the possibility for micro-exercise at the workplace, the potential for further societal impact is enormous. In conclusion, the societal impact of micro-exercise for MSDs in Denmark comes from a multifaceted, broad dissemination of activities and the continuous adaption of the research questions to needs and recommendations to fit the workplace demands and overcome practical, ideological, and cultural barriers. Scopus Google Scholar [10] D. Van Eerd, C. Munhall, E. Irvin, et al. Effectiveness of workplace interventions in the prevention of upper extremity musculoskeletal disorders and symptoms: an update of the evidence Occup. Environ."
    },
    {
        "title": "Damage and Repair of Skeletal Muscle Microstructure after Basketball Exercise and Protein Nutrition Supplement Based on CT Images",
        "abstract": "No content available for summarization."
    },
    {
        "title": "UCLMuevete: Increasing the amount of physical activity, work-ability, and cardiorespiratory fitness capacity in university workers through active breaks",
        "abstract": "Free access Research article First published online August 23, 2023 UCLMuevete: Increasing the amount of physical activity, work-ability, and cardiorespiratory fitness capacity in university workers through active breaks Maria Marin-Farrona, Brad Wipfli, […], Saurabh S. Thosar, Jorge García-Unanue, Leonor Gallardo, Jose Luis Felipe, and Jorge López-Fernández jorge.lopez@universidadeuropea.es +4 -4 View all authors and affiliations Volume 77, Issue 1 https://doi.org/10.3233/WOR-230062 Contents Abstract 1 Introduction 2 Materials and methods 3 Results 4 Discussion 5 Conclusions Ethics statement Acknowledgments Conflict of interest Footnote References Supplementary Material PDF/EPUB More Cite article Share options Information, rights and permissions Metrics and citations Figures and tables Abstract BACKGROUND: Active break programs at the workplace are a promising initiative for increasing workers' physical activity (PA) levels, health, work-ability (WA), and social relationship. OBJECTIVE: To determine the impact of an Active Breaks workplace program based on Bandura’s Social Cognitive Theory (SCT) aligned with Behavior Change Techniques (BCT) on PA levels, cardiorespiratory fitness (CRF), WA, and social relationships among university workers. METHODS: #UCLMuévete is a quasi-experimental, 12-week intervention designed according to the TREND and TIDieR-PHP checklists. stretching, etc., structured or semi-structured PA) or full structured-PA sessions of 45–60 min (e.g., biking or yoga) are beneficial to promote healthier habits in workers [ 3 ]. Some attempts using the full structured-PA session approach has been applied to university workers with promising results on increasing their PA level and health through aerobic (cardiorespiratory endurance) or anaerobic (muscle strengthening resistance) exercises [ 13 ]. However, the PA duration (≥45 min), the required materials, resources, and the used facilities are barriers to replicate the approach in other universities and to achieve high adherence-level to the implemented programs [ 11 ]. , participants could choose any space in Campus University for partaking the active break and could use the campus sports facilities (gym, bicycle and walking path). A detailed breakdown of UCLMuevete project is provided in Supplementary file 1 according to the TREND and TIDieR-PHP checklists [ 23 ]. The intervention was tailored according to Bandura’s Social Cognitive Theory (SCT) because it is one of the most widely used theories for tailoring wellness programs. -27) –average (28-36) –good (37-43) –excellent (44-49) [ 28 ]. 2.5.3 Ad-hoc questionnaire The following questions were formulated at the end of the intervention participants were asked the following questions: 1) Do you consider that the relationship with your teammates has improved after participating in UCLMuevete? With categorical answer: Yes; no; 2) After the program, do you consider that social relations with the rest of the teams have improved? (fat mass, muscle mass, body weight and bone mineral density), stress level and social relationships. These secondary outcomes were chosen to understand the underlying mechanisms/processes by which the overall health improve. 2.7 Data analysis Data were analyzed using SPSS version 25.0 (IBM Corp., Armonk, NY, USA)."
    },
    {
        "title": "Kiiwetinoong Diabetes Strategy education",
        "abstract": "No content available for summarization."
    },
    {
        "title": "The complete guide to the menopause: your toolkit to take control and achieve life-long health",
        "abstract": "The Complete Guide to the Menopause: Your Toolkit to Take Control and ... - Annice Mukherjee - Google Books Sign in Try the new Google Books Books Add to my library Contents Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Good for: Web Tablet / iPad eReader Smartphone Features: Flowing text Scanned pages Help with devices & formats Learn more about books on Google Play Buy eBook - ₹353.56 Get this book in print ▼ Rediff Books Flipkart Infibeam Find in a library All sellers » The Complete Guide to the Menopause: Your Toolkit to Take Control and ... By Annice Mukherjee About this book My library My History Terms of Service Pages displayed by permission of Random House . Copyright . Loading... Loading... Loading... Loading... Loading... Loading..."
    },
    {
        "title": "Chronic effect of light resistance exercise after ingestion of a high-protein snack on increase of skeletal muscle mass and strength in young adults",
        "abstract": "Chronic Effect of Light Resistance Exercise after Ingestion of a High-Protein Snack on Increase of Skeletal Muscle Mass and Strength in Young Adults Journal of Nutritional Science and Vitaminology Online ISSN : 1881-7742 Print ISSN : 0301-4800 ISSN-L : 0301-4800 資料トップ 巻号一覧 この資料について J-STAGEトップ / Journal of Nutritional Science... / 57 巻 (2011) 3 号 / 書誌 Regular Paper Chronic Effect of Light Resistance Exercise after Ingestion of a High-Protein Snack on Increase of Skeletal Muscle Mass and Strength in Young Adults Yushi KATO, Atsushi SAWADA, Shigeharu NUMAO, Masashige SUZUKI 著者情報 Yushi KATO Graduate School of Sport Sciences, Waseda University Atsushi SAWADA Graduate School of Sport Sciences, Waseda University Shigeharu NUMAO Faculty of Sport Sciences, Waseda University Masashige SUZUKI Faculty of Sport Sciences, Waseda University 責任著者(Corresponding author) キーワード: high-protein snack, light resistance exercise, muscle mass, muscle strength, muscle blood volume ジャーナル フリー 2011 年\n\t 57 巻\n\t\t\t3 号\n\t\t\t\tp. 233-238 DOI https://doi.org/10.3177/jnsv.57.233 詳細 Published: 2011 Received: 2010/11/05 Available on J-STAGE: 2011/09/09 Accepted: - Advance online publication: - Revised: - PDFをダウンロード (319K) メタデータをダウンロード RIS形式 (EndNote、Reference Manager、ProCite、RefWorksとの互換性あり) BIB TEX形式 (BibDesk、LaTeXとの互換性あり) テキスト メタデータのダウンロード方法 発行機関連絡先 記事の概要 共有する 抄録 We have previously reported on the possibility that light resistance exercise performed with a high plasma amino acid concentration resulting from the ingestion of a high-protein snack (HPS; 15 g protein, 18 g sugar) 3 h after a basal meal promotes the utilization of amino acids in peripheral tissues such as muscle in both rats and humans. In the present study, we further examined the effectiveness of a daily routine involving ingestion of HPS 3 h after a basal meal and subsequent light resistance exercise (dumbbell exercise) in increasing the mass and strength of human muscle. Ten young adult males were subject to the following 3 conditions for 5 wk each, with sufficient recovery period between each condition: (1) Snack-Exercise (SE), (2) Snack-Sedentary (SS), and (3) No snack-Exercise (NE). �歴 前身誌 THE JOURNAL OF VITAMINOLOGY このページを共有する feedback Top J-STAGEへの登録はこちら（無料） 登録 すでにアカウントをお持ちの場合　サインインは こちら"
    },
    {
        "title": "The affective and behavioral responses to repeated “strength snacks”",
        "abstract": "Ballroom dancing is more intensive for the female partners due to their unique hold technique Authors: M Vaczi , E Tekus , T Atlasz , A Cselko , G Pinter , D Balatincz , M Kaj , and M Wilhelm"
    },
    {
        "title": "Resistance exercise minimal dose strategies for increasing muscle strength in the general population: an overview",
        "abstract": "Home Sports Medicine Article Resistance Exercise Minimal Dose Strategies for Increasing Muscle Strength in the General Population: an Overview Review Article Open access Published: 20 March 2024 Volume 54, pages 1139–1162, ( 2024 ) Cite this article Download PDF You have full access to this open access article Sports Medicine Aims and scope Submit manuscript Resistance Exercise Minimal Dose Strategies for Increasing Muscle Strength in the General Population: an Overview Download PDF James L. Nuzzo ORCID: orcid.org/0000-0001-9081-0522 1, Matheus D. Pinto ORCID: orcid.org/0000-0002-2616-2492 1, Benjamin J. C. Kirk ORCID: orcid.org/0000-0002-1189-2281 1 & … Kazunori Nosaka ORCID: orcid.org/0000-0001-7373-4994 1 Show authors 18k Accesses 134 Altmetric 2 Mentions Explore all metrics Abstract Many individuals do not participate in resistance exercise, with perceived lack of time being a key barrier. Minimal dose strategies, which generally reduce weekly exercise volumes to less than recommended guidelines, might improve muscle strength with minimal time investment. However, minimal dose strategies and their effects on muscle strength are still unclear. science organizations have also published their own guidelines for resistance exercise participation (Table 1 ). The American College of Sports Medicine (ACSM) has published guidelines for healthy adults [ 4, 5 ] and older adults [ 12 ] as well as individuals with diabetes [ 13 ]. The National Strength and Conditioning Association (NSCA) has published guidelines for healthy youth [ 14 ] and older adults [ 15 ]. future research. Fig. 1 Visual representation of program variable characteristics of five minimal dose resistance exercise strategies: “Weekend Warrior,” single-set resistance exercise, resistance exercise “snacks,” practicing the strength test, and minimal dose eccentric resistance exercise. 64 ]. In the late 1980s and early 1990s, a series of studies on the extensor muscles of the cervical and lumbar spine illustrated that one session of resistance exercise per week, which involved only one exercise of eccentric–concentric repetitions, improved muscle strength of the targeted muscles in untrained [ 65, 66, 67 ] and trained individuals [ 68 ]. The findings provided proof of concept that total body resistance exercise programs might increase muscle strength when participation occurs only once per week. resistance exercise snacking programs in healthy adults without a recent history of resistance exercise (Table 7 ). Kowalsky et al. [ 45 ] examined daily resistance exercise snacks over a 1-week period on measures of muscular discomfort and sleepiness among 24 university students."
    },
    {
        "title": "Resistance exercise snacks improve muscle mass in female university employees: a prospective, controlled, intervention pilot-study",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "Split or full-body workout routine: which is best to increase muscle strength and hypertrophy?",
        "abstract": "ABSTRACT Objective: To compare the effects of different resistance training programs on measures of muscle strength and hypertrophy. Methods: Sixty-seven untrained subjects were randomized to one of two groups: Split Workout Routine (n=35), in which muscle groups were trained twice per week in an A/B split consisting of eight sets per session, or Full-Body Workout Routine (n=32), in which muscle groups were trained four times per week with four and eight sets per session. Both groups performed eight to 12 repetition maximum per set, with 60 seconds of rest between sets. METHODS Participants Eighty-six healthy young men volunteered to participate in this study. Participants were assigned to Split Workout Routine and Full-Body Workout Routine Groups using a computer-based random number generator. Randomization occurred within blocks of six subjects. and post-intervention measurements. Markings were touched up weekly. Images were obtained 48 to 72 hours after the final training session to avoid potential interferences of post-workout muscle swelling with results. size was expressed as the absolute difference (pre versus post) in the raw value of variables using the difference between two means in standardized units (Cohen’s d value). Cohen’s d values were qualitatively interpreted according to the following thresholds: <0.2, trivial; 0.2 to 0.6, small; 0.6 to 1.2, moderate; 1.2 to 2.0, large; 2.0 to 4.0, very large and >4.0, nearly perfect. Whenever 90% confidence intervals overlapped, small positive and negative values attributed to magnitude were deemed unclear. 2 p =0.001) for MT RF. Rectus femoris MT increased significantly from baseline to post-intervention in both the Split Workout Routine (2.2mm; 12.3%; p=0.001; ES=0.54) and the Full-Body Workout Routine (2.2mm; 12.1%; p=0.001; ES=0.58) group. There was a significant main effect of time (F 1,31 =97.823; p<0.001; η 2 p =0.882) but no group-by- time interaction (F 1,31 =0.127; p=0.813; η 2 p =0.024) MT VL."
    },
    {
        "title": "Effects of resistance training frequency on measures of muscle hypertrophy: a systematic review and meta-analysis",
        "abstract": "Home Sports Medicine Article Effects of Resistance Training Frequency on Measures of Muscle Hypertrophy: A Systematic Review and Meta-Analysis Systematic Review Published: 21 April 2016 Volume 46, pages 1689–1697, ( 2016 ) Cite this article Sports Medicine Aims and scope Submit manuscript Brad J. Schoenfeld 1, Dan Ogborn 2 & James W. Krieger 3 34k Accesses 481 Altmetric 78 Mentions Explore all metrics Abstract Background A number of resistance training (RT) program variables can be manipulated to maximize muscular hypertrophy. One variable of primary interest in this regard is RT frequency. Frequency can refer to the number of resistance training sessions performed in a given period of time, as well as to the number of times a specific muscle group is trained over a given period of time. . J Strength Cond Res. 2013;27(6):1609–17. College of Sports Medicine position stand. Progression models in resistance training for healthy adults. Med Sci Sports Exerc. Cond Res. 2013;27(6):1609–17. Article PubMed Google Scholar Arazi H, Asadi A. Medicine position stand. Progression models in resistance training for healthy adults. Med Sci Sports Exerc."
    },
    {
        "title": "Designing resistance training programmes to enhance muscular fitness: a review of the acute programme variables",
        "abstract": "Home Sports Medicine Article Designing Resistance Training Programmes to Enhance Muscular Fitness A Review of the Acute Programme Variables Review Article Published: 29 November 2012 Volume 35, pages 841–851, ( 2005 ) Cite this article Sports Medicine Aims and scope Submit manuscript Stephen P. Bird 1, Kyle M. Tarpenning 1 & Frank E. Marino 1 27k Accesses 104 Altmetric 6 Mentions Explore all metrics Abstract The popularity of resistance training has grown immensely over the past 25 years, with extensive research demonstrating that not only is resistance training an effective method to improve neuromuscular function, it can also be equally effective in maintaining or improving individual health status. However, designing a resistance training programme is a complex process that incorporates several acute programme variables and key training principles. The effectiveness of a resistance training programme to achieve a specific training outcome (i.e. : 543–50 PubMed CAS Google Scholar O’Hagan FT, Sale DG, MacDougall JD, et al. Comparative effectiveness of accommodating and weight resistance training modes. Med Sci Sports Exerc 1995; 27: 1210–9 PubMed Google Scholar Ostrowski KJ, Wilson GJ, Weatherby R, et al. erc 2003; 35: 456–64 Article PubMed Google Scholar Hickson JF, Buono MJ, Wilmore JH, et al. Energy cost of weight training exercise. Natl Strength Cond Assoc J 1984; 6: 22–3 Article Google Scholar Sforzo GA, Touey PR. rats, as measured by urinary excretion of N tau-methylhistidine. Biochem J 1979; 178: 139–46 CAS Google Scholar Young VR, Munro HN. Ntau-methylhistidine (3-methylhistidine) and muscle protein turnover: an overview. E, Charette S, et al. Muscle strength and fiber adaptations to a year-long resistance training program in elderly men and women. J Gerontol 1994; 49 (1): M22–7 Article Google Scholar Pollock ML, Franklin BA, Balady GJ, et al."
    },
    {
        "title": "Dose-response relationship between weekly resistance training volume and increases in muscle mass: A systematic review and meta-analysis",
        "abstract": "ABSTRACT The purpose of this paper was to systematically review the current literature and elucidate the effects of total weekly resistance training (RT) volume on changes in measures of muscle mass via meta-regression. The final analysis comprised 34 treatment groups from 15 studies. Outcomes for weekly sets as a continuous variable showed a significant effect of volume on changes in muscle size ( P = 0.002)."
    },
    {
        "title": "A systematic review with meta-analysis of the effect of resistance training on whole-body muscle growth in healthy adult males",
        "abstract": "Open Access Review A Systematic Review with Meta-Analysis of the Effect of Resistance Training on Whole-Body Muscle Growth in Healthy Adult Males by Pedro J. Benito Pedro J. Benito SciProfiles Scilit Preprints.org Google Scholar 1,*, Rocío Cupeiro Rocío Cupeiro SciProfiles Scilit Preprints.org Google Scholar 1, Domingo J. Ramos-Campo Domingo J. Ramos-Campo SciProfiles Scilit Preprints.org Google Scholar 2, Pedro E. Alcaraz Pedro E. Alcaraz SciProfiles Scilit Preprints.org Google Scholar 2,3 and Jacobo Á. Rubio-Arias Jacobo Á. Rubio-Arias SciProfiles Scilit Preprints.org Google Scholar 1,2 1 LFE Research Group, Department of Health and Human Performance, Faculty of Physical Activity and Sport Science-INEF, Universidad Politécnica de Madrid, 28040 Madrid, Spain 2 Department of Physical Activity and Sports Sciences, Faculty of Sports, UCAM, Catholic University San Antonio, 30107 Murcia, Spain 3 UCAM Research Centre for High Performance Sport, Catholic University San Antonio, 30107 Murcia, Spain * Author to whom correspondence should be addressed. Int. J. Environ. other hand, another limitation for trainers and practitioners is that with current knowledge and research it is difficult to predict how much muscle mass can be gained. Several studies have already designed estimation equations to predict weight evolution throughout a weight loss programme [ 4, 5 ], and although an intrinsic uncertainty and error margin of those estimations are always present, the same method of evaluation for muscle gain is necessary as we have already pointed out. In this sense, two pioneer works have paved the way to the prediction of muscle hypertrophy. pathologies or not between 18 and 40 years of age; (2) used men and women in the same group of training; (3) performed RT with a negative energy balance; (4) were a review or did not have an intervention design; (5) were not an original investigation published in full; (6) did not specify the tests to be evaluated or did not use a specific measurement of muscle mass in whole body; (7) applied gravitational weight training (i.e., elastic bands, pool resistance training, concurrent training, body vibrations…); (8) did not provide or specify numerical data; and, (9) they examined acute effects of interventions. 2.4. Study Selection and Data Extraction Retrieved articles were reviewed independently by two authors (P.J.B. asymmetry of the change of muscle mass (all variables measured: FFM, LMM, SMM) after resistance training. Effects of Moderator Variables: Meta-Regression and Sub-Analysis To explore the moderate effect related to the participants and characteristics of training, meta-regression and meta-analysis were performed. The continuous covariates were meta-regressed individually and together in a random-effects meta-regression model using Jamovi project (Package for R). 2−4 years (n groups: FFM = 8; LMM = 6; SMM = 0); and with experience 4 years or more (n groups: FFM = 7; LMM = 0; SMM = 0). Table 1. Main differences between pre-post study in the main body composition variable considered."
    },
    {
        "title": "The bottom-up rise strength transfer in elderly after endurance and resistance training: the BURST",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "The Effects of High-Intensity Interval Training with Short Bursts of Work (≤ 30s) on Body Composition and Exercise Capacity in Overweight or Obese Adults: A …",
        "abstract": "www.researchgate.net This page isn’t working www.researchgate.net didn’t send any data. ERR_EMPTY_RESPONSE null Reload www.researchgate.net didn’t send any data."
    },
    {
        "title": "Left ventricular wall thickening does occur in elite power athletes with or without anabolic steroid use",
        "abstract": "karger.com This page isn’t working karger.com didn’t send any data. ERR_EMPTY_RESPONSE null Reload karger.com didn’t send any data."
    },
    {
        "title": "… activation of AMPK‐PGC‐1α or PKB‐TSC2‐mTOR signaling can explain specific adaptive responses to endurance or resistance training‐like electrical muscle …",
        "abstract": "The FASEB Journal Volume 19, Issue 7 p. 1-23 FJ Express Summaries Free to Read Selective activation of AMPK-PGC-1α or PKB-TSC2-mTOR signaling can explain specific adaptive responses to endurance or resistance training-like electrical muscle stimulation Philip J. Atherton, Philip J. Atherton School of Life Sciences, University of Dundee, UK Department of Biological Sciences, University of Central Lancashire, UK Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author John A. Babraj, John A. Babraj School of Life Sciences, University of Dundee, UK Search for more papers by this author Kenneth Smith, Kenneth Smith Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author Jaipaul Singh, Corresponding Author Jaipaul Singh jsingh3@uclan.ac.uk Department of Biological Sciences, University of Central Lancashire, UK Corresponding author: Jaipaul Singh, Department of Biological Sciences, University of Central Lancashire, Preston, PR1 2HE, UK. E-mail: jsingh3@uclan.ac.uk Search for more papers by this author Michael J. Rennie, Michael J. Rennie Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author Henning Wackerhage, Henning Wackerhage School of Life Sciences, University of Dundee, UK Search for more papers by this author Philip J. Atherton, Philip J. Atherton School of Life Sciences, University of Dundee, UK Department of Biological Sciences, University of Central Lancashire, UK Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author John A. Babraj, John A. Babraj School of Life Sciences, University of Dundee, UK Search for more papers by this author Kenneth Smith, Kenneth Smith Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author Jaipaul Singh, Corresponding Author Jaipaul Singh jsingh3@uclan.ac.uk Department of Biological Sciences, University of Central Lancashire, UK Corresponding author: Jaipaul Singh, Department of Biological Sciences, University of Central Lancashire, Preston, PR1 2HE, UK. E-mail: jsingh3@uclan.ac.uk Search for more papers by this author Michael J. Rennie, Michael J. Rennie Clinical Physiology Laboratory, University of Nottingham, UK Search for more papers by this author Henning Wackerhage, Henning Wackerhage School of Life Sciences, University of Dundee, UK Search for more papers by this author First published: 16 February 2005 https://doi.org/10.1096/fj.04-2179fje Citations: 343 Read the full text About References Related Information PDF PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. 70 S6k, 4E-BP1, eIF-2B, and eEF2. These data suggest that a specific signaling response to LFS is a specific activation of the AMPK-PGC-1α signaling pathway which may explain some endurance training adaptations. HFS selectively activates the PKB-TSC2-mTOR cascade causing a prolonged activation of translational regulators, which is consistent with increased protein synthesis and muscle growth. 12 Schwenk, W. F., Berg, P. J., Beaufrere, B., Miles, J. M., and Haymond, M. W. ( 1984 ) Use of t-butyldimethylsilylation in the gas chromatographic/mass spectrometric analysis of physiologic compounds found in plasma using electron-impact ionization. Anal. Biochem. , Puigserver, P., Andersson, U., Zhang, C., Adelmant, G., Mootha, V., Troy, A., Cinti, S., Lowell, B., Scarpulla, R. C., et al. ( 1999 ) Mechanisms controlling mitochondrial biogenesis and respiration through the thermogenic coactivator PGC-1. Cell 98, 115 – 124 10.1016/S0092-8674(00)80611-X CAS PubMed Web of Science® Google Scholar 22 Lin, J., Wu, H., Tarr, P. T., Zhang, C. Y., Wu, Z., Boss, O., Michael, L. F., Puigserver, P., Isotani, E., Olson, E. N., et al. 1009 CAS PubMed Web of Science® Google Scholar 30 Vandenburgh, H., and Kaufman, S. ( 1979 ) In vitro model for stretch-induced hypertrophy of skeletal muscle. Science 203, 265 – 268 10.1126/science.569901 CAS ADS PubMed Web of Science® Google Scholar 31 Sakamoto, K., Aschenbach, W. G., Hirshman, M. F., and Goodyear, L. J. ( 2003 ) Akt signaling in skeletal muscle: regulation by exercise and passive stretch."
    },
    {
        "title": "The effect of resistance training on functional capacity and quality of life in individuals with high and low numbers of metabolic risk factors",
        "abstract": "diabetesjournals.org This page isn’t working diabetesjournals.org didn’t send any data. ERR_EMPTY_RESPONSE null Reload diabetesjournals.org didn’t send any data."
    },
    {
        "title": "Trends in soviet strength and conditioning: from macro-to meso-to micro-cycles",
        "abstract": "Article: PDF Only Trends in Soviet Strength and Conditioning From Macro- to Meso- to Micro-Cycles Yessis, Michael Ph.D., Editor-Publisher Author Information Soviet Sports Review National Strength Coaches Association Journal 4(4):p 45-47, August 1982. Free © 1982 National Strength and Conditioning Association"
    },
    {
        "title": "A 4-week intervention involving mobile-based daily 6-minute micro-sessions of functional high-intensity circuit training improves strength and quality of life, but not …",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "21 short-cuts to health: from micro-workouts to power poses, Sally Brown reveals insider tips and tricks for self-improvement with minimal effort",
        "abstract": "Gale - Error Page Technical Difficulties We encountered a problem in processing your request. We apologize for the inconvenience. Please try again in a few seconds."
    },
    {
        "title": "Tackling the down side: Social capital, women's empowerment and micro‐finance in Cameroon",
        "abstract": "Development and Change Volume 32, Issue 3 p. 435-464 Tackling the Down Side: Social Capital, Women’s Empowerment and Micro-Finance in Cameroon Linda Mayoux , Linda Mayoux Open University, UK Search for more papers by this author Linda Mayoux , Linda Mayoux Open University, UK Search for more papers by this author First published: 16 December 2002 https://doi.org/10.1111/1467-7660.00212 Citations: 266 About Related Information PDF PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. I have read and accept the Wiley Online Library Terms and Conditions of Use Shareable Link Use the link below to share a full-text version of this article with your friends and colleagues. Learn more."
    },
    {
        "title": "New fundamental resistance exercise determinants of molecular and cellular muscle adaptations",
        "abstract": "Home European Journal of Applied Physiology Article New fundamental resistance exercise determinants of molecular and cellular muscle adaptations Review Article Published: 15 July 2006 Volume 97, pages 643–663, ( 2006 ) Cite this article European Journal of Applied Physiology Aims and scope Submit manuscript Marco Toigo 1 & Urs Boutellier 1 8162 Accesses 10 Altmetric Explore all metrics Abstract Physical activity relies on muscular force. In adult skeletal muscle, force results from the contraction of postmitotic, multinucleated myofibres of different contractile and metabolic properties. Myofibres can adapt to (patho-)physiological conditions of altered functional demand by radial growth, longitudinal growth, and regulation of fibre type functional gene modules. J 19:1009–1011 PubMed CAS Google Scholar Anderson JE (2000) A role for nitric oxide in muscle repair: nitric oxide-mediated activation of muscle satellite cells. Mol Biol Cell 11:1859–1874 PubMed CAS Google Scholar Anderson J, Pilipowicz O (2002) Activation of muscle satellite cells in single-fiber cultures. Nitric Oxide 7:36–41 PubMed CAS Google Scholar Armstrong RB, Warren GL, Warren JA (1991) Mechanisms of exercise-induced muscle fibre injury. on DJR, Waddell T, Rennie MJ (2003) Stimulation of human quadriceps protein synthesis after strenous exercise: no effects of varying intensity between 60 and 90% of one repetition maximum (1RM). J Physiol (Lond) 547P:P16 Google Scholar Brockett CL, Morgan DL, Proske U (2001) Human hamstring muscles adapt to eccentric exercise by changing optimum length. Med Sci Sports Exerc 33:783–790 PubMed CAS Google Scholar Brooks GA (2005) Governor recalled! LeFever RS, McCue MP, Xenakis AP (1982a) Behaviour of human motor units in different muscles during linearly varying contractions. J Physiol (Lond) 329:113–128 Google Scholar De Luca CJ, LeFever RS, McCue MP, Xenakis AP (1982b) Control scheme governing concurrently active human motor units during voluntary contractions. J Physiol (Lond) 329:129–142 Google Scholar De Luca CJ, Foley PJ, Erim Z (1996) Motor unit control properties in constant-force isometric contractions. . J Exp Biol 115:375–391 PubMed CAS Google Scholar Goldspink G (2005) Mechanical signals, IGF-I gene splicing, and muscle adaptation. Physiology 20:232–238 PubMed CAS Google Scholar Goldspink G, Scutt A, Martindale J, Jaenicke T, Turay L, Gerlach GF (1991) Stretch and force generation induce rapid hypertrophy and myosin isoform gene switching in adult skeletal muscle."
    },
    {
        "title": "Muscular adaptations in response to three different resistance-training regimens: specificity of repetition maximum training zones",
        "abstract": "Home European Journal of Applied Physiology Article Muscular adaptations in response to three different resistance-training regimens: specificity of repetition maximum training zones Original Article Published: November 2002 Volume 88, pages 50–60, ( 2002 ) Cite this article European Journal of Applied Physiology Aims and scope Submit manuscript Gerson E. Campos 1, Thomas J. Luecke 1, Heather K. Wendeln 1, Kumika Toma 1, Fredrick C. Hagerman 1, Thomas F. Murray 2, Kerry E. Ragg 3, Nicholas A. Ratamess 4, William J. Kraemer 4 & … Robert S. Staron 1 Show authors 25k Accesses 103 Altmetric 12 Mentions Explore all metrics Abstract. Thirty-two untrained men [mean (SD) age 22.5 (5.8) years, height 178.3 (7.2) cm, body mass 77.8 (11.9) kg] participated in an 8-week progressive resistance-training program to investigate the \"strength–endurance continuum\". Subjects were divided into four groups: a low repetition group (Low Rep, n =9) performing 3–5 repetitions maximum (RM) for four sets of each exercise with 3 min rest between sets and exercises, an intermediate repetition group (Int Rep, n =11) performing 9–11 RM for three sets with 2 min rest, a high repetition group (High Rep, n =7) performing 20–28 RM for two sets with 1 min rest, and a non-exercising control group (Con, n =5). erson E. Campos, Thomas J. Luecke, Heather K. Wendeln, Kumika Toma, Fredrick C. Hagerman & Robert S. Staron Com-Admin and Diagnostic Services, College of Health and Human Services, Ohio University, Athens, OH 45701, USA,,,,, Thomas F. Murray Student Health Service, Ohio University, Athens, OH 45701, USA,,,,, Kerry E. Ragg Human Performance Laboratory, Department of Kinesiology, The University of Connecticut, Storrs, CT 06269, USA,,,,, Nicholas A. Ratamess & William J. Kraemer Authors Gerson E. Campos View author publications You can also search for this author in PubMed Google Scholar Thomas J. Luecke View author publications You can also search for this author in PubMed Google Scholar Heather K. Wendeln View author publications You can also search for this author in PubMed Google Scholar Kumika Toma View author publications You can also search for this author in PubMed Google Scholar Fredrick C. Hagerman View author publications You can also search for this author in PubMed Google Scholar Thomas F. Murray View author publications You can also search for this author in PubMed Google Scholar Kerry E. Ragg View author publications You can also search for this author in PubMed Google Scholar Nicholas A. Ratamess View author publications You can also search for this author in PubMed Google Scholar William J. Kraemer View author publications You can also search for this author in PubMed Google Scholar Robert S. Staron View author publications You can also search for this author in PubMed Google Scholar Additional information Electronic Publication Rights and permissions Reprints and permissions About this article Cite this article Campos, G.E., Luecke, T.J., Wendeln, H.K. et al. Muscular adaptations in response to three different resistance-training regimens: specificity of repetition maximum training zones."
    },
    {
        "title": "Lack of human muscle architectural adaptation after short‐term strength training",
        "abstract": "Muscle & Nerve Volume 35, Issue 1 p. 78-86 Main Article Lack of human muscle architectural adaptation after short-term strength training Anthony J. Blazevich PhD, Corresponding Author Anthony J. Blazevich PhD anthony.blazevich@brunel.ac.uk Centre for Sports Medicine and Human Performance, Brunel University, Kingston Lane, Uxbridge UB8 3PH, United Kingdom Centre for Sports Medicine and Human Performance, Brunel University, Kingston Lane, Uxbridge UB8 3PH, United Kingdom Search for more papers by this author Nicholas D. Gill PhD, Nicholas D. Gill PhD School of Sport and Exercise Science, Waikato Institute of Technology, Hamilton, New Zealand Search for more papers by this author Nathan Deans BSc, Nathan Deans BSc School of Exercise Science and Sport Management, Southern Cross University, Lismore, Australia Search for more papers by this author Shi Zhou PhD, Shi Zhou PhD School of Exercise Science and Sport Management, Southern Cross University, Lismore, Australia Search for more papers by this author Anthony J. Blazevich PhD, Corresponding Author Anthony J. Blazevich PhD anthony.blazevich@brunel.ac.uk Centre for Sports Medicine and Human Performance, Brunel University, Kingston Lane, Uxbridge UB8 3PH, United Kingdom Centre for Sports Medicine and Human Performance, Brunel University, Kingston Lane, Uxbridge UB8 3PH, United Kingdom Search for more papers by this author Nicholas D. Gill PhD, Nicholas D. Gill PhD School of Sport and Exercise Science, Waikato Institute of Technology, Hamilton, New Zealand Search for more papers by this author Nathan Deans BSc, Nathan Deans BSc School of Exercise Science and Sport Management, Southern Cross University, Lismore, Australia Search for more papers by this author Shi Zhou PhD, Shi Zhou PhD School of Exercise Science and Sport Management, Southern Cross University, Lismore, Australia Search for more papers by this author First published: 14 December 2006 https://doi.org/10.1002/mus.20666 Citations: 73 Read the full text About References Related Information PDF PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. I have read and accept the Wiley Online Library Terms and Conditions of Use Shareable Link Use the link below to share a full-text version of this article with your friends and colleagues. Learn more. /jappl.1999.87.5.1705 CAS PubMed Web of Science® Google Scholar 3 Akima H, Takahashi H, Kuno SY, Masuda K, Masuda T, Shimajo H, et al. Early phase adaptations of muscle use and strength to isokinetic training. Med Sci Sports Exerc 1999 ; 31 : 588 – 594. Kawakami Y, Abe T, Kuno S-Y, Fukunaga T. Training-induced changes in muscle architecture and specific tension. Eur J Appl Physiol 1995 ; 72 : 37 – 43. 10.1007/BF00964112 CAS PubMed Web of Science® Google Scholar 18 Kim PL, Staron RS, Phillips SM. 10.1111/j.1365-201X.2004.01348.x CAS PubMed Web of Science® Google Scholar 32 Williams PE. Use of intermittent stretch in the prevention of serial sarcomere loss in immobilised muscle. Ann Rheum Dis 1990 ; 49 : 316 – 317."
    },
    {
        "title": "Muscular adaptations in low-versus high-load resistance training: A meta-analysis",
        "abstract": "Abstract There has been much debate as to optimal loading strategies for maximising the adaptive response to resistance exercise. The purpose of this paper therefore was to conduct a meta-analysis of randomised controlled trials to compare the effects of low-load (≤60% 1 repetition maximum [RM]) versus high-load (≥65% 1 RM) training in enhancing post-exercise muscular adaptations. The strength analysis comprised 251 subjects and 32 effect sizes (ESs), nested within 20 treatment groups and 9 studies."
    },
    {
        "title": "Acute and chronic response of skeletal muscle to resistance exercise",
        "abstract": "Home Sports Medicine Article Acute and Chronic Response of Skeletal Muscle to Resistance Exercise Review Article Published: 23 October 2012 Volume 17, pages 22–38, ( 1994 ) Cite this article Sports Medicine Aims and scope Submit manuscript Peter J. Abernethy 1, Jaak Jürimäe 1, Peter A. Logan 1, Albert W. Taylor 2 & … Robert E. Thayer 3 Show authors 512 Accesses 45 Altmetric 6 Mentions Explore all metrics Summary Skeletal muscle tissue is sensitive to the acute and chronic stresses associated with resistance training. These responses are influenced by the structure of resistance activity (i.e. frequency, load and recovery) as well as the training history of the individuals involved. , 1974 PubMed CAS Google Scholar Bandy WD, Lovelace-Chandler V, McKitrick-Bandy B. Adaptation of skeletal muscle to resistance training. Journal of Orthopaedic and Sports Physical Therapy 12: 248–255, 1990 PubMed CAS Google Scholar Bar A, Pette D. Three fast myosin heavy chains in adult rat skeletal muscle. EF, Feiring DC, Rotkis TC, Cote RW, Roby FB, et al. Specificity of power improvements through slow and fast isokinetic training. Journal of Applied Physiology 51: 1437–1442, 1981 PubMed CAS Google Scholar Craig BW, Lucas J, Pohlman R, Stelling H. The effects of running, weightlifting and a combination of both on growth hormone release. pp. 15–26, Human Kinetics Publisher, Champaign, 1983 Google Scholar Gonyea WJ, Sale DG, Gonyea FB, Mikesky A. Exercise induced increases in muscle fiber number. fast-twitch fiber type conversions in resistance trained men and women. Medicine and Science in Sports and Exercise 23: S130, 1991 Google Scholar Karlsson J, Nordesco LO, Jorfeldt L, Saltin B. Muscle lactate, ATP and CP levels during exercise after physical training in man."
    },
    {
        "title": "Exercise snacking to improve physical function in pre-frail older adult memory clinic patients: a 28-day pilot study",
        "abstract": "Home BMC Geriatrics Article Exercise snacking to improve physical function in pre-frail older adult memory clinic patients: a 28-day pilot study Research Open access Published: 04 August 2023 Volume 23, article number 471, ( 2023 ) Cite this article Download PDF You have full access to this open access article BMC Geriatrics Aims and scope Submit manuscript Exercise snacking to improve physical function in pre-frail older adult memory clinic patients: a 28-day pilot study Download PDF Max J. Western 1, Tomas Welsh 2, 3, 4, Kristen Keen 2, Vanessa Bishop 2 & … Oliver J. Perkin 5 Show authors 3953 Accesses 44 Altmetric 1 Mention Explore all metrics Abstract Background Finding innovative yet feasible ways of preventing physical and cognitive decline in those at risk is a critical global challenge, with exercise being championed as a key precursor to robust health in later life. Exercise snacking, here defined as short bouts of sporadic [muscle-strengthening] exercise, is one such strategy designed to overcome typical participation barriers observed in older adults. [ 4 ]. In the UK, muscle weakness in and of itself is estimated to result in excess healthcare costs of £2.5 billion annually [ 5 ], with the total annual cost of falling in the UK estimated at £4.4 billion, including £1.1 billion for social care [ 6 ]. Indeed, falls are the number one reason for hospitalisation in UK older adults, with at least 1 third of all community-dwelling people aged 65 years or older falling each year [ 7 ]. the potential impact of this intervention on the physical function for this population on outcomes relating to physical function, health, and exercise cognitions. Methods Study design This pilot study used a single group, pre-test-post-test design to assess the acceptability homebased ‘exercise snacking’ in older adult patients attending the memory clinic at the Research Institute for the Care of Older People (RICE) in Bath, UK. All participants were asked to undertake 28 days of twice daily exercise snacks, with baseline measures of physical and cognitive function, patient reported health, wellbeing, and psychological process outcomes relating to exercise behaviour, recorded on the day before the intervention and follow-up measures scheduled within 7-days of the final day of the intervention. Self-efficacy Scale [ 32 ], and satisfaction of the psychological needs for autonomy competence and relatedness in an exercise context using the Psychological need satisfaction for exercise questionnaire [ 33 ]. The Patient Health Questionnaire [ 34 ] and Generalised Anxiety Disorder Assessment [ 35 ] were used to assess mental health, while general health and quality of life was measured using the Short Form Health Survey [ 36 ], the Subjective Vitality Scale [ 37 ], and the Life Satisfaction Scale [ 38 ]. Cognitive function was assessed with the Montreal Cognitive Assessment [ 39 ] and self-reported indices of frailty were assessed with the Groningen Frailty Index [ 40 ]. 0.8) according to Cohen [ 46 ]. Secondary outcomes of cognitive function, patient reported health, wellbeing, and psychological process outcomes relating to exercise behaviour are reported descriptively as mean ± standard deviation. Statistical analysis performed using GraphPad Prism 9.5.0 for Windows (GraphPad Software, San Diego, California USA)."
    },
    {
        "title": "Comparison of an Acute Bout of Exercise to a Sugary Snack on Energy, Mood and Cognitive Performance",
        "abstract": "\"Comparison of an Acute Bout of Exercise to a Sugary Snack on Energy, M\" by Erica Knowles Skip to main content Home About FAQ My Account < Previous Next > Home > ETDS > 264 Electronic Theses and Dissertations Comparison of an Acute Bout of Exercise to a Sugary Snack on Energy, Mood and Cognitive Performance Author Erica Knowles, Stephen F. Austin State University Follow Date of Award Spring 5-2-2019 Degree Type Thesis Degree Name Master of Science - Kinesiology Department Kinesiology and Health Science First Advisor Malcom T. Whitehead, Ph.D. Second Advisor Dustin Joubert, Ph.D. Third Advisor DawnElla Rust, Ed.D. Fourth Advisor Casey Hart, Ph.D. Abstract Low perceived energy and a decline in cognitive performance throughout the day are common issues, though exercise and food consumption are suggested to improve mood and cognition. The present study compares effects of acute exercise to consuming sugar on mood, energy, and cognitive performance. least popular and see how visitors move around the site. Cookie Details List‎ Targeting Cookies Targeting Cookies These cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites."
    },
    {
        "title": "Immediate effects of exercise snacking on physical fatigue, mood, and pain in elderly adults with knee osteoarthritis",
        "abstract": "Home Bulletin of Faculty of Physical Therapy Article Immediate effects of exercise snacking on physical fatigue, mood, and pain in elderly adults with knee osteoarthritis Original Research Article Open access Published: 27 December 2024 Volume 29, article number 92, ( 2024 ) Cite this article Download PDF You have full access to this open access article Bulletin of Faculty of Physical Therapy Submit manuscript Immediate effects of exercise snacking on physical fatigue, mood, and pain in elderly adults with knee osteoarthritis Download PDF Ayoola Ibifubara Aiyegbusi ORCID: orcid.org/0000-0002-8052-0908 1, Francis Oluwatosin Kolawole 2, Israel Kayode Oke 2 & … Henrietta O. Fawole 2 Show authors 397 Accesses 4 Altmetric Explore all metrics Abstract Background Exercise has been reported to be beneficial in reducing pain and fatigue, as well as improving mood, in patients with knee osteoarthritis (KOA). However, long bouts of exercise have been linked to an increase in fatigue and pain level in elderly adults. Currently, there are very few investigations into the immediate effects of breaking exercise into shorter and frequent bouts, otherwise known as exercise snacking on physical fatigue, mood, and pain in elderly adults with KOA. pain, joint stiffness, functional limitations, sleeplessness, and fatigue in OA can have reciprocal effects on each other, leading to a negative impact on psychological well-being [ 5, 7 ], and one of the potential negative effects of these symptoms is the development of depression [ 8 ]. Aerobic exercise has been shown to be an effective intervention for managing KOA symptoms, and it has positive effects on pain, disease severity, depressive symptoms, anxiety, quality of life, and functional performance in patients with KOA [ 9, 10, 11 ]. Additionally, a study found antidepressant effects from aerobic exercise training in patients with rheumatoid arthritis and osteoarthritis [ 12 ]. the NFRS demonstrated strong test–retest reliability, as indicated by an Intraclass Correlation Coefficient (ICC) of 0.829 (95% CI, 0.697 to 0.907). It has been documented as a valid tool for assessing fatigue among elderly adults [ 23 ]. Secondary outcomes Mood Participant’s mood was assessed using Visual Analogue Mood Scale (VAMS). 308724795310. Procedure for data collection All participants made use of Zero X-FIT exercise bike RM550 for the aerobic exercise. Socio-demographic details, such as age, sex, occupation, marital status, religion, and medical history, were obtained from the participants. p = < 0.001 and p = 0.048, respectively (Table 4 ). Table 4 Mann–Whitney U comparison of clinical outcome variables between exercise snacking and continuous exercise at pre-intervention and post-intervention Full size table A one-way between-group ANCOVA between exercise snacking and continuous exercise group on physical fatigue, mood, and pain show significant differences between the two groups on post-intervention fatigue and pain scores p = < 0.001, p = < 0.001, respectively. However, there was no significant difference in mood scores as shown in Table 5."
    },
    {
        "title": "Brainfit: 10 Minutes a Day for a Sharper Mind and Memory",
        "abstract": "Brainfit: 10 Minutes a Day for a Sharper Mind and Memory - Corinne L. Gediman, Francis M. Crinella - Google Books Sign in Try the new Google Books Books Add to my library Contents Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Good for: Web Tablet / iPad eReader Smartphone Features: Flowing text Scanned pages Help with devices & formats Learn more about books on Google Play Page 10 Minutes a Day for a Sharper Mind and Memory Corinne L. Gediman, Francis M. Crinella. Making Memories Taking Aim Remembering Who Remembering What Exercises for short -term and long-term memory Exercises using the fundamental memory skills ... Page ... brain with healthy stimulation ."
    },
    {
        "title": "Your Best Brain Ever: A Complete Guide and Workout",
        "abstract": "Your Best Brain Ever: A Complete Guide and Workout - Michael S. Sweeney, Cynthia R. Green - Google Books Sign in Try the new Google Books Books Add to my library Page 6 Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Page 10 ... health and steady functioning . Some take an active role in physical health by attacking microbes . Others , called ... short as a fraction of an inch and others several feet long , and from one to as many as 100,000 dendrites ..."
    },
    {
        "title": "Shorter term aerobic exercise improves brain, cognition, and cardiovascular fitness in aging",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "… For The Brain: 70 Neurobic Exercises To Increase Mental Fitness & Prevent Memory Loss: How Non Routine Actions And Thoughts Improve Mental Health",
        "abstract": "Exercise For The Brain: 70 Neurobic Exercises To Increase Mental Fitness ... - Jason Scotts - Google Books Sign in Try the new Google Books Books Add to my library Contents Try the new Google Books Check out the new look and enjoy easier access to your favorite features Try it now No thanks Try the new Google Books My library Help Advanced Book Search Good for: Web Tablet / iPad eReader Smartphone Features: Flowing text Scanned pages Help with devices & formats Learn more about books on Google Play Buy eBook - ₹344.19 Get this book in print ▼ Rediff Books Flipkart Infibeam Find in a library All sellers » Exercise For The Brain: 70 Neurobic Exercises To Increase Mental Fitness ... By Jason Scotts About this book My library My History Terms of Service Pages displayed by permission of Speedy Publishing LLC . Copyright . Loading... Loading... Loading... Loading... Loading... Loading..."
    },
    {
        "title": "How Exercise Affects the Brain: Does Your Workout Make You Smarter?",
        "abstract": "How Exercise Affects the Brain: Does Your Workout Make You Smarter? Written by Bronwyn Griffiths Originally published April 8, 2021 5:42 pm Workout Motivation Q&A/FAQ After those many hours spent running, rowing, and stretching our bodies into yoga poses, wouldn’t it be nice to know that we were also exercising our minds at the same time? Turns out, that not only can exercise improve your mood but it can also help enhance your memory and concentration. good for your brain. Regular aerobic exercise (that raises your heart rate) is good for your brain because an increased intensity level causes more growth factors and neurochemicals to arise. This will have a positive impact on your stress levels, learning, and memory. P. D. (2019). Systematic review of the proposed associations between physical exercise and creative thinking. Europe’s Journal of Psychology, 15(4), 858-877."
    },
    {
        "title": "A single bout of aerobic exercise promotes motor cortical neuroplasticity",
        "abstract": "journals.physiology.org This page isn’t working journals.physiology.org didn’t send any data. ERR_EMPTY_RESPONSE null Reload journals.physiology.org didn’t send any data."
    },
    {
        "title": "Beneficial effects of physical exercise on neuroplasticity and cognition",
        "abstract": "Neuroscience & Biobehavioral Reviews Volume 37, Issue 9, Part B, November 2013, Pages 2243-2257 Review Beneficial effects of physical exercise on neuroplasticity and cognition Author links open overlay panel Kirsten Hötting, Brigitte Röder Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.neubiorev.2013.04.005 Get rights and content Highlights • Physical activity has beneficial effects on executive functions and memory in humans. • Neural systems that are known to have a high capacity for change appear to be the first that are enhanced by exercise. • Maintenance of cardiovascular fitness is necessary for long-term effects on cognition. ). Neuroplasticity mediates the behavioral recovery after brain injury and protocols known to increase cortical map plasticity have been successfully implemented into neuro-rehabilitation programs (Dancause and Nudo, 2011, Taub et al., 2002). However, neuroplasticity may result in maladaptive behavioral consequences as well (Elbert and Heim, 2001). running and practicing hippocampus-dependent learning tasks have been shown to enhance neurogenesis (Gould et al., 1999, van Praag et al., 1999a), to increase the release of neurotrophins (Kesslak et al., 1998, Vaynman et al., 2004) and to improve spatial memory (Uysal et al., 2005, van Praag et Long-term effects of exercise As outlined in this review so far, data from intervention studies have provided convincing evidence that a few months of regular physical exercise have positive effects on cognitive functioning. However, little is known about the sustainability of exercise induced effects on cognitive functions; that is whether or how long gains prevail and under which conditions they prevail. Follow-up data one or more years after the end of an intervention would not only inform about a possible causal Acknowledgement The authors were supported by the German Research Foundation ( DFG HO 3924/1-1 and DFG HO 3924/1-2 ). Bandura Social cognitive theory: an agentic perspective Annu. Rev. Psychol. with learning through instruction and feedback (reinforcement) and encouragement to perform beyond self-perceived capability. Individuals with Parkinson's disease become more cognitively engaged with the practice and learning of movements and skills that were previously automatic and unconscious. Aerobic exercise, regarded as important for improvement of blood flow and facilitation of neuroplasticity in elderly people, might also have a role in improvement of behavioural function in individuals with Parkinson's disease."
    },
    {
        "title": "Exerkines and long-term synaptic potentiation: Mechanisms of exercise-induced neuroplasticity",
        "abstract": "Frontiers in Neuroendocrinology Volume 66, July 2022, 100993 Exerkines and long-term synaptic potentiation: Mechanisms of exercise-induced neuroplasticity Author links open overlay panel Wouter A.J. Vints a b c, Oron Levin a d, Hakuei Fujiyama e f g, Jeanine Verbunt b c, Nerijus Masiulis a h Show more Outline Add to Mendeley Share Cite https://doi.org/10.1016/j.yfrne.2022.100993 Get rights and content Under a Creative Commons license open access Highlights • Cognitive deficits are associated with impairments in long-term potentiation (LTP). • Acute and chronic, cardiovascular and resistance exercise facilitate LTP processes. al., 2017 ). Currently, there is a vast amount of research showing that neuroplasticity could well be induced by acute (i.e., a single bout) or chronic (i.e., a program of multiple bouts) exposure to physical exercise ( Knaepen et al., 2010, Svensson et al., 2015, Vilela et al., 2017, Müller et al., 2020 ). At the level of the brain, acute exercise studies in humans have discovered transient changes in neurotransmitter levels like glutamate and γ-aminobutyric acid (GABA) immediately following physical exercise, as measured with proton magnetic resonance spectroscopy ( 1 H-MRS) ( Maddock et al., 2016 ). This results in a weakening of glutamatergic synaptic connections, by for example, internalization of AMPA receptors and a decrease in the number of glutamates containing vesicles ( Collingridge et al., 2010 ). LTD has a low intracellular Ca 2+ threshold, and is typically induced by a prolonged modest increase in Ca 2+. In contrast, the induction of LTP requires a brief, but higher amplitude of intracellular Ca 2+ increase ( Yang et al., 1999 ). ., 2019, Herold et al., 2019 ). Importantly, the pathways activated in the process of late LTP also increase the transcription of growth and survival stimulating factors, such as brain-derived neurotrophic factor (BDNF). The transcription of BDNF was shown both after acute exercise and chronic exercise ( Venezia et al., 2017 ). 1), and growth hormone (GH)), followed by pro- and anti-inflammatory biomarkers (i.e., cytokines and kynurenine), of whom some are myokines. Then, we discuss other myokines (i.e., irisin, cathepsin-B, apelin, and adiponectin) and metabolites (i.e., lactate and β-hydroxybutyrate (BHB)). At last, we describe the remaining exerkines that could not be placed in any of the other groups (i.e., osteocalcin, orexin-A, ghrelin, and vasoactive intestinal peptide (VIP))."
    },
    {
        "title": "Neuroplasticity—exercise-induced response of peripheral brain-derived neurotrophic factor: a systematic review of experimental studies in human subjects",
        "abstract": "Home Sports Medicine Article Neuroplasticity — Exercise-Induced Response of Peripheral Brain-Derived Neurotrophic Factor A Systematic Review of Experimental Studies in Human Subjects Research Review Article Published: 21 November 2012 Volume 40, pages 765–801, ( 2010 ) Cite this article Sports Medicine Aims and scope Submit manuscript Kristel Knaepen 1, Maaike Goekint 1, 2, Elsa Marie Heyman 1, 3 & … Romain Meeusen 1 Show authors 11k Accesses 648 Citations 39 Altmetric 4 Mentions Explore all metrics Abstract Exercise is known to induce a cascade of molecular and cellular processes that support brain plasticity. Brain-derived neurotrophic factor (BDNF) is an essential neurotrophin that is also intimately connected with central and peripheral molecular processes of energy metabolism and homeostasis, and could play a crucial role in these induced mechanisms. This review provides an overview of the current knowledge on the effects of acute exercise and/or training on BDNF in healthy subjects and in persons with a chronic disease or disability. BDNF levels. The\npreceding exercise of low to moderate intensity, together with the GXT, has also been evaluated as a prolonged\nacute exercise protocol of high intensity and will be discussed in section 2.6.1. In the study of Laske et al.,[ 59 ] BDNF concentration in healthy control subjects did not increase following an\nacute exercise of high intensity. e YA, Edgar D, Thoenen H. Purification of a new neurotrophic factor from mammalian brain. EMBO J 1982; 1 (5): 549–53 PubMed CAS Google Scholar Maisonpierre PC, Le BeauMM, Espinosa R, et al. Human and rat brain-derived neurotrophic factor and neurotrophin-3: gene structures, distributions, and chromosomal localizations. 40 Article PubMed CAS Google Scholar Komori T, Morikawa Y, Nanjo K, et al. Induction of brain-derived neurotrophic factor by leptin in the ventromedial hypothalamus. Neuroscience 2006; 139: 1107–15 Article PubMed CAS Google Scholar Gray J, Yeo GS, Cox JJ, et al. J, et al. The acute response of plasma brain-derived neurotrophic factor as a result of exercise in major depression. Psychiatry Res 2009; 94 (12): 1159–60 Google Scholar Laske C, Banschbach S, Stransky E, et al."
    },
    {
        "title": "Exercise-induced neuroplasticity: a mechanistic model and prospects for promoting plasticity",
        "abstract": "Restricted access Research article First published online April 21, 2018 Exercise-Induced Neuroplasticity: A Mechanistic Model and Prospects for Promoting Plasticity Jenin El-Sayes, Diana Harasym, […], Claudia V. Turco, Mitchell B. Locke, and Aimee J. Nelson https://orcid.org/0000-0003-1279-0815 nelsonaj@mcmaster.ca +2 -2 View all authors and affiliations Volume 25, Issue 1 https://doi.org/10.1177/1073858418771538 Contents Abstract References Get access More Cite article Share options Information, rights and permissions Metrics and citations Abstract Aerobic exercise improves cognitive and motor function by inducing neural changes detected using molecular, cellular, and systems level neuroscience techniques. This review unifies the knowledge gained across various neuroscience techniques to provide a comprehensive profile of the neural mechanisms that mediate exercise-induced neuroplasticity. Using a model of exercise-induced neuroplasticity, this review emphasizes the sequence of neural events that accompany exercise, and ultimately promote changes in human performance. Drollette ES, Pesce C, Hillman CH, Di Russo F. 2015. From cognitive motor preparation to visual processing: the benefits of childhood fitness to brain health. Neuroscience 298:211–9. Crossref PubMed Google Scholar Colcombe SJ, Erickson KI, Scalf PE, Kim JS, Prakash R, McAuley E, and others. 2006. Aerobic exercise training increases brain volume in aging humans. Sci Sports Exerc 39(4):728–34. Crossref PubMed Google Scholar Fletcher MA, Low KA, Boyd R, Zimmerman B, Gordon BA, Tan CH, and others. 2016.  apolipoprotein E-dependent neurite outgrowth in a central nervous system-derived neuronal cell line. Proc Natl Acad Sci U S A 92:9480–4. Crossref PubMed Google Scholar Hopkins ME, Davis FC, Vantieghem MR, Whalen PJ, Bucci DJ."
    },
    {
        "title": "Can high-intensity interval training improve physical and mental health outcomes? A meta-review of 33 systematic reviews across the lifespan",
        "abstract": "ABSTRACT High-intensity-interval-training (HIIT) has been suggested to have beneficial effects in multiple populations across individual systematic reviews, although there is a lack of clarity in the totality of the evidence whether HIIT is effective and safe across different populations and outcomes. The aim of this meta-review was to establish the benefits, safety and adherence of HIIT interventions across all populations from systematic reviews and meta-analyses. Major databases were searched for systematic reviews (with/without meta-analyses) of randomised & non-randomised trials that compared HIIT to a control. -2017-03-001). FG is supported by the Maudsley Charity and the National Institute for Health Research (NIHR) Collaboration for Leadership in Applied Health Research and Care South London (NIHR CLAHRC South London) at King’s College Hospital NHS Foundation Trust. VM is supported by MQ: Transforming Mental Health (Grant: MQBF1) and by the Medical Research Foundation (Grant: MRF-160-0005-ELP-MONDE).The views expressed are those of the authors and not necessarily those of the NHS, the NIHR or the Department of Health and Social Care."
    },
    {
        "title": "Impact of intermittent physical exercises on mental health of some police officers in Nkonkobe District, South Africa: sport psychology",
        "abstract": "journals.co.za This page isn’t working journals.co.za didn’t send any data. ERR_EMPTY_RESPONSE null Reload journals.co.za didn’t send any data."
    },
    {
        "title": "The effects of aerobic interval training and moderate-to-vigorous intensity continuous exercise on mental and physical health in women with heart disease",
        "abstract": "effects of aerobic interval training and moderate-to-vigorous intensity continuous exercise on mental and physical health in women with heart disease | European Journal of Preventive Cardiology | Oxford Academic Skip to Main Content Advertisement intended for healthcare professionals Journals Books Search Menu Menu Sign in through your institution Navbar Search Filter European Journal of Preventive Cardiology This issue ESC Publications Cardiovascular Medicine Books Journals Oxford Academic Mobile Enter search term Search Issues More Content Advance Articles Editor's Choice Supplements Image Library ESC Journals App ESC Content Collections Most Cited Articles Submit Author Guidelines Submission Site Why publish with EJPC? Open Access Options Read & Publish Author Resources Self-Archiving Policy Purchase Alerts About About European Journal of Preventive Cardiology Editorial Board About EAPC ESC Publications About European Society of Cardiology Advertising & Corporate Services Developing Countries Initiative Journals on Oxford Academic Books on Oxford Academic ESC Publications Close Navbar Search Filter European Journal of Preventive Cardiology This issue ESC Publications Cardiovascular Medicine Books Journals Oxford Academic Enter search term Search Advanced Search Search Menu Article Navigation Close mobile search navigation Article Navigation Volume 26 Issue 2 1 January 2019 Article Contents Author contribution Acknowledgments Declaration of conflicting interests Funding References Comments (0) < Previous Next > Article Navigation Article Navigation Journal Article The effects of aerobic interval training and moderate-to-vigorous intensity continuous exercise on mental and physical health in women with heart disease Jennifer L Reed, Jennifer L Reed Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada School of Human Kinetics, University of Ottawa, Canada Faculty of Medicine, University of Ottawa, Canada Jennifer L Reed, Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, 40 Ruskin Street, Ottawa, Ontario, K1Y 4W7 Canada. Email: jreed@ottawaheart.ca Search for other works by this author on: Oxford Academic Google Scholar Marja-Leena Keast, Marja-Leena Keast Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada Search for other works by this author on: Oxford Academic Google Scholar Rachelle A Beanlands, Rachelle A Beanlands Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada Search for other works by this author on: Oxford Academic Google Scholar Angelica Z Blais, Angelica Z Blais Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada School of Human Kinetics, University of Ottawa, Canada Search for other works by this author on: Oxford Academic Google Scholar Anna E Clarke, Anna E Clarke Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada Search for other works by this author on: Oxford Academic Google Scholar Andrew L Pipe, Andrew L Pipe Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada Faculty of Medicine, University of Ottawa, Canada Search for other works by this author on: Oxford Academic Google Scholar Heather E Tulloch Heather E Tulloch Division of Cardiac Prevention and Rehabilitation, University of Ottawa Heart Institute, Canada Faculty of Medicine, University of Ottawa, Canada Search for other works by this author on: Oxford Academic Google Scholar European Journal of Preventive Cardiology, Volume 26, Issue 2, 1 January 2019, Pages 211–214, https://doi.org/10.1177/2047487318795246 Published: 29 August 2020 PDF Split View Views Article contents Figures & tables Cite Cite Jennifer L Reed, Marja-Leena Keast, Rachelle A Beanlands, Angelica Z Blais, Anna E Clarke, Andrew L Pipe, Heather E Tulloch,  The effects of aerobic interval training and moderate-to-vigorous intensity continuous exercise on mental and physical health in women with heart disease, European Journal of Preventive Cardiology, Volume 26, Issue 2, 1 January 2019, Pages 211–214, https://doi.org/10.1177/2047487318795246 Close Permissions Icon Permissions Share Icon Share Facebook Twitter LinkedIn Email Navbar Search Filter European Journal of Preventive Cardiology This issue ESC Publications Cardiovascular Medicine Books Journals Oxford Academic Mobile Enter search term Search Close Navbar Search Filter European Journal of Preventive Cardiology This issue ESC Publications Cardiovascular Medicine Books Journals Oxford Academic Enter search term Search Advanced Search Search Menu Issue Section: Research Letters Cardiovascular disease (CVD) is a leading cause of death in women. costly particularly when adherence rates are low. 5 Introducing different exercise modalities in existing CR programmes may be a more feasible option for programme directors and benefit the women they serve. Aerobic interval training (AIT) has been shown to produce similar or greater improvements in physical and psychosocial health outcomes in a time-efficient manner when compared to traditional moderate-to-vigorous intensity continuous exercise (MICE) in patients with CVD. married) 35 (58) 17 (57) 18 (60) 0.794 Education (% 4 years college/university) 26 (43) 11 (37) 15 (50) 0.672 Smoker (%) a 6 (10) 2 (7) 4 (13) 0.365 Anthropometrics Height (cm) 161.7 ± 7.0 161.0 ± 5.2 162.4 ± 8.4 0.549 Body mass (kg) 71.7 ± 14.8 70.6 ± 15.3 72.7 ± 14.6 0.595 BMI (kg/m 2 ) 27.6 ± 6.2 27.3 ± 5.9 27.9 ± 6.6 0.720 Waist circumference (cm) 92.0 ± 13.8 90.7 ± 13.4 93.3 ± 14.3 0.463 Resting systolic blood pressure (mmHg) 121.5 ± 17.4 125.4 ± 19.9 117.6 ± 13.6 0.141 Resting diastolic blood pressure (mmHg) 73.4 ± 8.8 75.2 ± 9.5 71.7 ± 7.7 0.119 Resting heart rate (bpm) 69.7 ± 12.8 71.5 ± 16.0 68.1 ± 9.0 0.860 Mental health Anxiety 7.2 ± 4.0 6.8 ± 4.0 7.5 ± 4.2 0.613 Elevated anxiety scores (>7 points, n, %) 22 (37) 11 (37) 11 (37) 1.000 Depression 4.1 ± 3.2 3.6 ± 3.3 4.5 ± 3.1 0.183 Elevated depression scores (>7 points, n, %) 9 (15) 3 (10) 6 (20) 0.278 Medications, n (%) Anti-platelet agents 48 (80) 23 (77) 25 (83) 0.519 Anti-dyslipidemic agents 40 (67) 19 (63) 21 (70) 0.584"
    },
    {
        "title": "Effects of sports massage on the physiological and mental health of college students participating in a 7-week intermittent exercises program",
        "abstract": "Open Access Case Report Effects of Sports Massage on the Physiological and Mental Health of College Students Participating in a 7-Week Intermittent Exercises Program by Chih-Chien Shen Chih-Chien Shen SciProfiles Scilit Preprints.org Google Scholar 1, Yi-Han Tseng Yi-Han Tseng SciProfiles Scilit Preprints.org Google Scholar 2, Meng-Chun Susan Shen Meng-Chun Susan Shen SciProfiles Scilit Preprints.org Google Scholar 3 and Hsiao-Hsien Lin Hsiao-Hsien Lin SciProfiles Scilit Preprints.org Google Scholar 4,* 1 Institute of Physical Education and Health, Yulin Normal University, 1303 Jiaoyu East Rd., Yulin 537000, China 2 Department of Tourism Leisure and Health Management, Chung Chou University of Science and Technology, No. 6, Lane 2, Sec. 3, Shanjiao Rd., Yuanlin City 510, Taiwan 3 Department of Business Administration, Asia University, Taichung 41354, Taiwan 4 Department of Leisure Industry Management, National Chin-Yi University of Technology, Taichung 41170, Taiwan * Author to whom correspondence should be addressed. negative impact on the well-being and growth of adolescents [ 8, 13, 14, 15, 16, 17, 18 ]. Studies have confirmed that the COVID-19 environment has significant effects on the mental or physical health of adolescents [ 8 ] which has become a major concern for governments [ 6, 19, 20 ]. It has also been shown that physical exercise can help improve physical and mental health [ 21, 22 ], regulate psychological stress [ 23, 24 ], and improve life and academic performance [ 25 ]. , triceps dip on a chair, plank, high knees, lunge, push-up, and rotation, swap left and right—side plank, and 12 other dynamic and static exercise programs [ 47 ], which can achieve aerobic exercise effects to increase muscle endurance at the same time [ 48 ]. 2.2. Massage Massage, also known as tui na, is one of the oldest medical treatments in China [ 36 ]. components [ 20, 57, 58 ], as evidenced by anxiety, competence, enthusiasm, headache, abdominal pain, insomnia, stomach pain, irregular diet, and suicidal ideation [ 59, 60 ]. Therefore, the researchers sought to understand whether the physical and mental health of university students who used massage to relieve muscle and psychological stress after intermittent exercise were relieved. The study of the psychological, mental, and attitudinal aspects of the subjects would provide accurate information. program was completed. 3.2.2. The Compiling and Analysis of Mental Health Questionnaire The physical and mental health scale was developed with reference to relevant literature [ 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60 ], and then three coaches with national sports team coaching experience and academics in the fields of exercise physiology and psychology were invited to review the contents of the questionnaire."
    },
    {
        "title": "Exercise and mental health",
        "abstract": "Maturitas Volume 106, December 2017, Pages 48-56 Review article Exercise and mental health Author links open overlay panel Kathleen Mikkelsen a, Lily Stojanovska a, Momir Polenakovic b, Marijan Bosevski c, Vasso Apostolopoulos a Show more Add to Mendeley Share Cite https://doi.org/10.1016/j.maturitas.2017.09.003 Get rights and content Highlights • Exercise improves anxiety, stress, depression. • Exercise decreases inflammation. • Exercise improves psychological, physiological and immunological functions. the effects of exercise on mental health it is pertinent to consider the psychosocial aspects at play. Exercise routines and physical activity through sport have been shown to provide a distraction from negative thoughts and ruminations, and a boost in self-esteem through self-efficacy or mastery. The often social aspect of physical activity can also provide an outlet for people suffering from depression, anxiety and/or stress [99]. .N. Hall mTOR-what does it do? Transplant. that physical activity (PA), exercise, and aerobic fitness promote well-being and reduce risk of mental health problems. In this review, we focus on PA, exercise, and fitness as modifiable resilience factors that may help promote self-regulation via strengthening of top-down control of bottom-up processes in the brain, thereby acting as a buffer against mental health problems during this period of vulnerability. First, we briefly review the link between PA, exercise, and aerobic fitness with mental well-being and reduced mental health problems in adolescence."
    },
    {
        "title": "Planned aerobic exercise increases energy intake at the preceding meal",
        "abstract": "Just a moment... www.researchgate.net Verify you are human by completing the action below. www.researchgate.net needs to review the security of your connection before proceeding. Verification successful Waiting for www.researchgate.net to respond..."
    },
    {
        "title": "Effect of the glycemic index of pre-exercise snack bars on substrate utilization during subsequent exercise",
        "abstract": "Abstract Purpose : To investigate the effect of the glycemic index (GI) of pre-exercise snack bars on substrate utilization during subsequent moderate intensity exercise. Methods : Fourteen male participants (Age: 27 ± 5 yr; BMI: 22.5 ± 2.7 kg m −2 ; : 48.7 ± 6.1 mL kg −1 min −1 ) completed two trials in a randomized and counterbalanced crossover design. Two iso-caloric snack bars with different GI values (20, LGI versus 68, HGI) were provided to the participants."
    },
    {
        "title": "How to Cardio the Right Way at the Gym to Lose Weight",
        "abstract": "Power Lift Health > Endurance > How to Cardio the Right Way at the Gym to Lose Weight Endurance How to Cardio the Right Way at the Gym to Lose Weight Posted by admin Last Updated: August 24, 2024 Share on READ NEXT The Best Cardio For Fat Loss Cardiovascular exercise, commonly referred to as cardio, is one of the most effective ways to burn calories and lose weight. However, cardio isn’t a one-size-fits-all approach. Different methods can yield varied results depending on your goals, fitness level, and lifestyle. Journal of Clinical Nutrition emphasised the importance of combining cardio with strength training to optimise fat loss and prevent muscle loss during a calorie deficit. Muscle mass increases your resting metabolic rate, meaning you’ll burn more calories at rest, which can accelerate fat loss over time. 12 Must-Have Exercises In Your Training Program Optimising Your Cardio Sessions Getting the most out of your cardio sessions requires more than just hopping on a treadmill and running for 30 minutes. ised in some diets, they are essential for providing energy during cardio sessions, especially high-intensity workouts like HIIT. Fats: Healthy fats are necessary for hormone production and overall health. They also help you feel fuller for longer, which can aid in weight loss when in a calorie deficit."
    },
    {
        "title": "Altitude acclimatization alleviates the hypoxia-induced suppression of exogenous glucose oxidation during steady-state aerobic exercise",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "Acute responses to the 7-minute workout",
        "abstract": "Original Research Acute Responses to the 7-Minute Workout Riegler, Michelle; Stotz, Gavin; Fitzgerald, Kaitlyn; Munoz, Christian K.; Lewis, Jamie; Ring, Sebastian; Astorino, Todd A. Author Information Department of Kinesiology, CSU—San Marcos, San Marcos, California Address correspondence to Todd A. Astorino, astorino@csusm.edu. Journal of Strength and Conditioning Research 31(9):p 2572-2578, September 2017. real-world” application of these particular HIIT regimes outside the laboratory setting. Nevertheless, HIIT has been identified as one of the top trends in health and fitness ( 33 ), despite only few studies exploring its efficacy and practicality when performed outside a laboratory. In overweight, sedentary adults, no change in V̇ o 2 max was shown in response to 12 weeks of HIIT which was performed in a group setting at a park ( 22 ). Exercise began with a 2-minute warm-up at 40–60 W followed by 20–30 W·min −1 increases in work rate until volitional exhaustion was attained (pedal cadence <50 rev per minute). V̇ o 2 max was identified as the mean value of the last 2 data points, and its attainment was confirmed using 2 of the following 3 criteria: respiratory exchange ratio >1.10, HR within 10 b·min −1 of 220—age, and a plateau in V̇ o 2 ( 1 ). All participants met at least 2 of these criteria. was significantly higher in response to HIIE vs. 7Min at all time points (Cohen's d ranging from 0.46 to 2.31). V̇ o 2 during HIIE consistently increased from bout 1 (1.52 ± 0.32 L·min −1 ) to bout 8 (2.38 ± 0.48 L·min −1 ) and increased further to bout 11 when it peaked at 2.49 ± 0.47 L·min −1, equal to 83 %V̇ o 2 max. V̇ o 2 for 7Min varied based on the exercise performed, as it increased from bout 1 to bout 2 (0.92 ± 0.19 to 1.27 ± 0.31 L·min −1, jumping jacks to wall sit), then decreased in response to bout 3 (1.19 ± 0.23 L·min −1, push-ups). Lactate Concentration Baseline values of BLa were similar between HIIE (1.4 ± 0.4 mM) and 7Min (1.1 ± 0.3 mM). Blood lactate concentration increased during exercise ( p < 0.001), but there was no time × protocol interaction ( p = 0.07), although BLa values acquired at bout 8 and postexercise were higher in 7Min vs. HIIE. These data are shown in Figure 2."
    },
    {
        "title": "Hormonal responses and adaptations to resistance exercise and training",
        "abstract": "Home Sports Medicine Article Hormonal Responses and Adaptations to Resistance Exercise and Training Review Article Published: 23 September 2012 Volume 35, pages 339–361, ( 2005 ) Cite this article Sports Medicine Aims and scope Submit manuscript William J. Kraemer 1, 2 & Nicholas A. Ratamess 3 26k Accesses 110 Altmetric 12 Mentions Explore all metrics Abstract Resistance exercise has been shown to elicit a significant acute hormonal response. It appears that this acute response is more critical to tissue growth and remodelling than chronic changes in resting hormonal concentrations, as many studies have not shown a significant change during resistance training despite increases in muscle strength and hypertrophy. Anabolic hormones such as testosterone and the superfamily of growth hormones (GH) have been shown to be elevated during 15–30 minutes of post-resistance exercise providing an adequate stimulus is present. heavy resistance exercise in trained power lifters and untrained men. Can J Appl Physiol 1999; 24: 524–37 Article PubMed CAS Google Scholar Tremblay MS, Copeland JL, Van Helder W. Effect of training status and exercise mode on endogenous steroid hormones in men. J Appl Physiol 2003; 96: 531–9 Article PubMed Google Scholar Ahtiainen JP, Pakarinen A, Kraemer WJ, et al. exercise. Eur J Appl Physiol 2000; 82: 121–8 Article PubMed CAS Google Scholar Schwab R, Johnson GO, Housh TJ, et al. Acute effects of different intensities of weight lifting on serum testosterone. al and pubertal boys. J Strength Cond Res 2000; 14: 399–404 Google Scholar Häkkinen K, Pakarinen A, Alen M, et al. Neuromuscular and hormonal adaptations in athletes to strength training in two years. ormones and sport. J Steroid Biochem 2003; 83: 245–51 Google Scholar King DS, Sharp RL, Vukovich MD, et al. Effect of oral androstenedione on serum testosterone and adaptations to resistance training in young men: a randomized controlled trial."
    },
    {
        "title": "High-intensity functional training (HIFT): definition and research implications for improved fitness",
        "abstract": "Open Access Feature Paper Review High-Intensity Functional Training (HIFT): Definition and Research Implications for Improved Fitness by Yuri Feito Yuri Feito SciProfiles Scilit Preprints.org Google Scholar 1,*, Katie M. Heinrich Katie M. Heinrich SciProfiles Scilit Preprints.org Google Scholar 2,†, Scotty J. Butcher Scotty J. Butcher SciProfiles Scilit Preprints.org Google Scholar 3,† and Walker S. Carlos Poston Walker S. Carlos Poston SciProfiles Scilit Preprints.org Google Scholar 4,† 1 Department of Exercise Science and Sport Management, Kennesaw State University, Kennesaw, GA 30144, USA 2 Department of Kinesiology, Kansas State University, Manhattan, KS 66506, USA 3 School of Rehabilitation Science, University of Saskatchewan, Saskatoon, SK S7N 2Z4, Canada 4 Institute of Biobehavioral Health Research, National Development and Research Institute, Leawood, KS 66211, USA * Author to whom correspondence should be addressed. , and have shown significant improvements in maximal oxygen consumption (~12%) [ 11, 12 ], decreases in body fat (~8%) [ 11, 16 ], as well as improvements in bone mineral content (~1%) [ 16 ] after 16-weeks of HIFT. In addition investigators have reported higher levels of enjoyment [ 14, 17 ], between HIFT participants and those engaged in more traditional resistance training programs, as well as a greater sense of community [ 18, 19 ], which facilitates initiation and adherence to exercise training [ 20 ]. Therefore, we propose the definition of HIFT as a training style [or program] that incorporates a variety of functional movements, performed at high-intensity [relative to an individual’s ability], and designed to improve parameters of general physical fitness (e.g., cardiovascular endurance, strength, body composition, flexibility, etc.) 5%, respectively), and anaerobic power (15% vs. 12%, respectively), after six weeks of training, only the MM-HIIT group improved muscle strength, power, and muscular endurance [ 27 ]. Therefore, it appears that multimodal-based HIIT/HIFT provides similar improvements in aerobic and anaerobic adaptations as more traditional, unimodal HIIT programs, with the added benefit of significant improvements in muscle performance that are not typically observed with either HIIT [ 27 ] or continuous [ 28 ] aerobic training. The second major difference between HIFT protocols and more traditional HIIT protocols is the exclusion of a defined rest interval. are interval in nature, regardless of intensity. Kliszczewicz et al. [ 35 ] examined the oxidative stress of a single HIFT session including 20 min of 5-pull-ups, 10 push-ups, and 15 air-squats compared to a high-intensity treadmill session of 20 min of running at 90% maximal heart rate. US Army, criticisms of the current physical training program exist, including insufficient preparation for combat and lack of training in multiple fitness domains [ 40 ]. Thus, exercise training is often geared toward passing the Army’s fitness test rather than combat preparedness [ 40 ], and this disconnect negatively impacts soldier motivation for the exercise training program. 4."
    },
    {
        "title": "Physiological adaptations to low‐volume, high‐intensity interval training in health and disease",
        "abstract": "The Journal of Physiology Volume 590, Issue 5 p. 1077-1084 Free to Read Physiological adaptations to low-volume, high-intensity interval training in health and disease Martin J. Gibala, Martin J. Gibala Department of Kinesiology, McMaster University, Hamilton, Ontario L8S 4K1, Canada Search for more papers by this author Jonathan P. Little, Jonathan P. Little School of Arts and Sciences, University of British Columbia Okanagan, Kelowna, British Columbia V1V 1V7, Canada Search for more papers by this author Maureen J. MacDonald, Maureen J. MacDonald Department of Kinesiology, McMaster University, Hamilton, Ontario L8S 4K1, Canada Search for more papers by this author John A. Hawley, John A. Hawley Exercise Metabolism Group, RMIT University, Bundoora, Victoria 3083, Australia Search for more papers by this author Martin J. Gibala, Martin J. Gibala Department of Kinesiology, McMaster University, Hamilton, Ontario L8S 4K1, Canada Search for more papers by this author Jonathan P. Little, Jonathan P. Little School of Arts and Sciences, University of British Columbia Okanagan, Kelowna, British Columbia V1V 1V7, Canada Search for more papers by this author Maureen J. MacDonald, Maureen J. MacDonald Department of Kinesiology, McMaster University, Hamilton, Ontario L8S 4K1, Canada Search for more papers by this author John A. Hawley, John A. Hawley Exercise Metabolism Group, RMIT University, Bundoora, Victoria 3083, Australia Search for more papers by this author First published: 30 January 2012 https://doi.org/10.1113/jphysiol.2011.224725 Citations: 1,101 M. J. Gibala: Department of Kinesiology, McMaster University, 1280 Main Street West, Hamilton, Ontario, L8S 4K1 Canada. Email: gibalam@mcmaster.ca This review is from the symposium Exercise metabolism at The Biomedical Basis of Elite Performance, a joint meeting of The Physiological Society and the British Pharmacological Society, together with The Journal of Physiology, Experimental Physiology, British Journal of Pharmacology and The Scandinavian Journal of Medicine and Science in Sports, at the Queen Elizabeth Hall, London on 20 March 2012. Read the full text About References Related Information PDF PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. ate oxidation in subsarcolemmal, not intermyofibrillar, mitochondria. J Biol Chem 283, 4228 – 4240. 10.1074/jbc.M704332200 CAS PubMed Web of Science® Google Scholar Burgomaster KA, Howarth KR, Phillips SM, Rakobowchuk M, Macdonald MJ, McGee SL & Gibala MJ ( 2008 ). performance improvements of athletes. Scand J Med Sci Sports 20, 11 – 23. 10.1111/j.1600-0838.2010.01193.x PubMed Web of Science® Google Scholar Kang C, O’Moore KM, Dickman JR & Ji LL ( 2009 ). exercise. Eur J Appl Physiol 110, 597 – 606. Google Scholar Rakobowchuk M, Tanguay S, Burgomaster KA, Howarth KR, Gibala MJ & MacDonald MJ ( 2008 ). Scholar Wenz T, Rossi SG, Rotundo RL, Spiegelman BM & Moraes CT ( 2009 ). Increased muscle PGC-1alpha expression protects from sarcopenia and metabolic disease during aging. Proc Natl Acad Sci 106, 20405 – 20410."
    },
    {
        "title": "Effective diet and exercise interventions to improve body composition in obese individuals",
        "abstract": "Restricted access Review article First published online October 24, 2013 Effective Diet and Exercise Interventions to Improve Body Composition in Obese Individuals Janet Walberg Rankin, PhD View all authors and affiliations Volume 9, Issue 1 https://doi.org/10.1177/1559827613507879 Contents Abstract References Get access More Cite article Share options Information, rights and permissions Metrics and citations Abstract Because higher body fat and lower lean mass is associated with excess morbidity and mortality, health care teams need specific science-based recommendations to advise clients on lifestyle approaches to alter body composition. Combining exercise with modest energy restriction is recommended to cause up to 20% more weight and fat loss, improved function, and reduced lean mass loss than modification of diet alone. The optimal diet for developing a leaner body composition is one that is modestly reduced in energy and contains lower fat and higher protein than average. Scholar 13. Sun Q, Townsend MK, Okereke O, et al. Adiposity and weight change in mid-life in relation to healthy survival after age 70 in women: prospective cohort study. POUNDS LOST trial. Am J Clin Nutr. 2012;95:614-625.  al. Ghrelin and glucagon-like peptide 1 concentrations, 24-h satiety, and energy and substrate metabolism during a high-protein diet and measured in a respiratory chamber. Am J Clin Nutr. A, et al. Long-term lifestyle intervention with optimized high-intensity interval training improves body composition, cardiometabolic risk, and exercise parameters in patient with abdominal obesity. Am J Phys Med Rehabil."
    },
    {
        "title": "The acceptability of homebased exercise snacking and Tai-chi snacking amongst high and low function UK and Taiwanese older adults",
        "abstract": "94% of researchers rate our articles as excellent or good Learn more about the work of our research integrity team to safeguard the quality of each article we publish. Find out more"
    },
    {
        "title": "… and acceptability of a remotely delivered, home-based, pragmatic resistance 'exercise snacking'intervention in community-dwelling older adults: a pilot randomised …",
        "abstract": "Home BMC Geriatrics Article Feasibility and acceptability of a remotely delivered, home-based, pragmatic resistance ‘exercise snacking’ intervention in community-dwelling older adults: a pilot randomised controlled trial Research Open access Published: 25 June 2022 Volume 22, article number 521, ( 2022 ) Cite this article Download PDF You have full access to this open access article BMC Geriatrics Aims and scope Submit manuscript Feasibility and acceptability of a remotely delivered, home-based, pragmatic resistance ‘exercise snacking’ intervention in community-dwelling older adults: a pilot randomised controlled trial Download PDF Jackson J. Fyfe ORCID: orcid.org/0000-0002-9541-2336 1, Jack Dalla Via 1, 2, Paul Jansons 1, 3, David Scott 1, 3 & … Robin M. Daly 1 Show authors 7023 Accesses 219 Altmetric 26 Mentions Explore all metrics Abstract Background Very few older adults meet current muscle strengthening exercise guidelines, and several barriers exist to supervised, community-based resistance exercise programs. Older adults therefore require access to feasible resistance exercise modalities that may be performed remotely. This pilot study assessed the feasibility and acceptability of undertaking a four-week home-based resistance ‘exercise snacking’ intervention (performed either once, twice, or thrice daily) when delivered and monitored remotely in older adults. resistance exercise are multifactorial, but include a high perceived difficulty, fear of injury, time constraints, and lack of interest or knowledge [ 3, 4, 5 ]. There are several barriers to participation in supervised, community-based exercise programs in older adults, including time constraints associated with travel to an exercise facility [ 6 ], lack of transport [ 5, 7 ], cost [ 8 ], and a dislike of exercise facilities and group activities [ 8 ]. In addition, physical distancing measures associated with the COVID-19 pandemic have also limited engagement in community-based exercise programs, while also presenting challenges for research studies involving supervised in-person exercise sessions and/or physical assessments [ 9 ]. ) unstable or ongoing cardiovascular, metabolic, or respiratory disorders, 4) current use of insulin or corticosteroids that could influence skeletal muscle metabolism, 5) self-reported body mass index (BMI) ≥40 kg·m − 2, 6) musculoskeletal or neurological disorders impacting voluntary movement, or 7) inability to commit to the study and its requirements. The risk of participants experiencing an adverse event during exercise was determined using the Exercise and Sports Science Australia (ESSA) Adult Pre-exercise Screening System (APSS) [ 18 ]. Participants with signs or symptoms of unstable or unmanaged disease (i.e., if participants answered ‘yes’ to any of the Stage 1 questions of the ESSA APSS) were excluded. �exercise snacking’ session, participants recorded in an exercise diary (designed in Microsoft Word) whether they successfully completed the session (yes or no), their RPE (Rating of Perceived Exertion) using the CR-10 scale [ 20 ], and whether any adverse events or incidents were experienced. After the first week of the intervention, participants were asked to return the completed exercise diary to the research team via email at the beginning of each subsequent week. Participants attended two (one each at baseline and follow-up) live videoconference meetings (conducted via Zoom) with the same member of the research team. test, participants did not perform any further balance tests. For the 5-STS and 30-STS tests, participants were asked to use a chair that: a) had a firm seat and backrest, b) had no arm rests or wheels, and c) was at a height such that participants could place their feet flat on the floor while their upper body was in contact with the backrest. The same chair was used by each participant for both baseline and follow-up assessments."
    },
    {
        "title": "Exploring the potential of technology to promote exercise snacking for older adults who are prefrail in the home setting: user-centered design study",
        "abstract": "Original Paper Katarzyna Stawarz 1, PhD ; Ian Ju Liang 2, MSc ; Lyndsay Alexander 3, PhD ; Angela Carlin 4, PhD ; Anjana Wijekoon 5, PhD ; Max J Western 2, PhD 1 School of Computer Science and Informatics, Cardiff University, Cardiff, United Kingdom 2 Department for Health, University of Bath, Bath, United Kingdom 3 School of Health Sciences, Robert Gordon University Aberdeen, Aberdeen, United Kingdom 4 Centre for Exercise Medicine, Physical Activity and Health, Sports and Exercise Sciences Research Institute, University of Ulster, Newtownabbey, United Kingdom 5 School of Computing, Robert Gordon University Aberdeen, Aberdeen, United Kingdom Corresponding Author: Katarzyna Stawarz, PhD School of Computer Science and Informatics Cardiff University Abacws Senghennydd Road Cardiff, CF24 4AG United Kingdom Phone: 44 029 2251 0037 Email: stawarzk@cardiff.ac.uk Abstract Background: Older adults are at increased risk of falls, injury, and hospitalization. Maintaining or increasing participation in physical activity during older age can prevent some of the age-related declines in physical functioning that contribute to loss of independence and low reported quality of life. Exercise snacking may overcome some commonly cited barriers to exercise and encourage older adults to engage in muscle strength and balance activity, but the best way to deliver and support this novel format remains unknown. Focus on impact on physical activity and healthy eating Nikita Price, Journal of Playwork Practice, 2017 Fuel up to Play 60 AAP News, 2010 Healthy GrandFamilies Workshops on nutrition, exercise empower custodial grandparents St. Clair, AAP News, 2009 Powered by Privacy policy Google Analytics settings Introduction Background The benefits of physical activity (PA) across the life span are well documented [ Warburton DE, Nicol CW, Bredin SS. Health benefits of physical activity: the evidence. CMAJ  2006 Mar 14;174(6):801-809  [ FREE Full text ] [ CrossRef ] [ Medline ] 1 ]. Feb;63(2):303-320. [ CrossRef ] [ Medline ] 9 ] and improve health-related quality of life [ Kim J, Im JS, Choi YH. Objectively measured sedentary behavior and moderate-to-vigorous physical activity on the health-related quality of life in US adults: the national health and nutrition examination survey 2003-2006. Comput Healthc  2020 Sep 30;1(4):1-37  [ FREE Full text ] [ CrossRef ] 20 ], which can be effective in encouraging PA and reducing sedentary behaviors [ Brickwood KJ, Watson G, O'Brien J, Williams AD. Consumer-based wearable activity trackers increase physical activity participation: systematic review and meta-analysis. JMIR Mhealth Uhealth  2019 Apr 12;7(4):e11819  [ FREE Full text ] [ CrossRef ] [ Medline ] 21 ].  ] but has the added benefit of overcoming barriers to engagement in PA for older adults. The main objective was to develop and test a set of interactive prototypes that could be embedded in the home environment to support strength and balance exercises. To do so, we engaged older adults who are prefrail in the design of the prototypes and conducted an exploratory home evaluation."
    },
    {
        "title": "The psychological and physiological responses of sedentary individuals to prescribed and preferred intensity exercise",
        "abstract": "British Journal of Health Psychology Volume 11, Issue 1 p. 39-53 The psychological and physiological responses of sedentary individuals to prescribed and preferred intensity exercise Gaynor Parfitt, Corresponding Author Gaynor Parfitt School of Sport and Health Science, University of Exeter, UK Correspondence should be addressed to Gaynor Parfitt, School of Sport and Health Science, St. Luke's Campus, University of Exeter, Exeter, EX2 2LU, UK (e-mail: c.g.parfitt@exeter.ac.uk ). Search for more papers by this author Elaine A. Rose, Elaine A.  human behavior New York: Plenum 1985. 10.1007/978-1-4899-2271-7 Google Scholar Department of Health and Human Services Promoting physical activity: A guide to community action Champaign, Ill: Human Kinetics 1999. Google Scholar Dishman, R. D. Exercise adherence and habitual physical activity W. P. Morgan, S. E. Morgan Epidemiology, behaviour change, intervention in chronic disease 49 – 83 Champaign, Ill: Human Kinetics 1987.  the normal population: A controlled trial Journal of Psychosomatic Research 33 47 – 61 1989. 10.1016/0022-3999(89)90105-0 CAS PubMed Web of Science® Google Scholar Parfitt, G., Eston, R. Changes in ratings of perceived exertion and psychological affect in the early stages of exercise Perceptual and Motor Skills 80 259 – 266 1995. 10.2466/pms.1995.80.1.259 CAS PubMed Web of Science® Google Scholar Parfitt, G., Markland, D., Holmes, C. Responses to physical exertion in active and inactive males and females Journal of Sport and Exercise Psychology 16 259 – 266 1994."
    },
    {
        "title": "Too little exercise and too much sitting: inactivity physiology and the need for new recommendations on sedentary behavior",
        "abstract": "Home Current Cardiovascular Risk Reports Article Too little exercise and too much sitting: Inactivity physiology and the need for new recommendations on sedentary behavior Published: 17 October 2008 Volume 2, pages 292–298, ( 2008 ) Cite this article Current Cardiovascular Risk Reports Aims and scope Submit manuscript Marc T. Hamilton 1, Genevieve N. Healy, David W. Dunstan, Theodore W. Zderic & … Neville Owen Show authors 8428 Accesses 545 Citations 290 Altmetric 32 Mentions Explore all metrics Abstract Moderate-to vigorous-intensity physical activity has an established preventive role in cardiovascular disease, type 2 diabetes, obesity, and some cancers. However, recent epidemiologic evidence suggests that sitting time has deleterious cardiovascular and metabolic effects that are independent of whether adults meet physical activity guidelines. Evidence from “inactivity physiology” laboratory studies has identified unique mechanisms that are distinct from the biologic bases of exercising. Dunstan DW, Salmon J, Owen N, et al. : Physical activity and television viewing in relation to risk of undiagnosed abnormal glucose metabolism in adults. Diabetes Care 2004, 27: 2603–2609. , 1997–99. Aust N Z J Public Health 2003, 27: 76–79. Article PubMed Google Scholar Salmon J, Owen N, Crawford D, et al. Article PubMed CAS Google Scholar Morris JN, Heady JA, Raffle PA, et al. : Coronary heartdisease and physical activity of work. Lancet 1953, 265(6796): 1111–1120; concl. metabolism in humans and rats during aging and physical inactivity. Int J Sport Nutr Exerc Metab 2001, 11(Suppl): S97–S104. PubMed CAS Google Scholar Hamilton MT, Etienne J, McClure WC, et al."
    },
    {
        "title": "Changes in sedentary time and physical activity in response to an exercise training and/or lifestyle intervention",
        "abstract": "Changes in Sedentary Time and Physical Activity in Response to an Exercise Training and/or Lifestyle Intervention in: Journal of Physical Activity and Health Volume 11 Issue 7 (2014) Jump to Content This site uses cookies, tags, and tracking settings to store information to help give you the very best browsing experience. Dismiss this warning User Account Sign in to save searches and organize your favorite content. Not registered? 13 (2016) Show Items Volume: 12 (2015) Show Items Volume: 11 (2014) Show Items Volume: 10 (2013) Show Items Volume: 9 (2012) Show Items Volume: 8 (2011) Show Items Volume: 7 (2010) Show Items Volume: 6 (2009) Show Items Volume: 5 (2008) Show Items Volume: 4 (2007) Show Items Volume: 3 (2006) Show Items Volume: 2 (2005) Show Items Volume: 1 (2004) Show Items Related Articles We recommend The Seated Inactivity Trial (SIT): Physical Activity and Dietary Outcomes Associated With 8 Weeks of Imposed Sedentary Time Brooke J. Cull, Journal of Physical Activity and Health, 2016 It’s A-bout Time: Detailed Patterns of Physical Activity in Obese Adolescents Participating in a Lifestyle Intervention Erin Kaye Howie, Journal of Physical Activity and Health, 2015 Use of Objective Measures to Estimate Sedentary Time in Youth Scott E. Crouter, Journal for the Measurement of Physical Behaviour, 2018 High-Intensity Interval Training and Isocaloric Moderate-Intensity Continuous Training Result in Similar Improvements in Body Composition and Fitness in Obese I... International Journal of Sport Nutrition and Exercise Metabolism, 2016 Exercise on Prescription: A Cross-sectional Study With Self-reported Outcome Helene Buch Pedersen, Journal of Physical Activity and Health, 2016 Pattern Analysis of Sedentary Behavior Change after a Walking Intervention Ann M. Swartz, Allergy Asthma Proc, 2018 Effects of habitual physical activity on response to endurance training Arto Hautala, Journal of Precision Respiratory Medicine, 2012 Physical Activity Variety, Energy Expenditure, and Body Mass Index Thompson, Dixie L., Allergy Asthma Proc Differential Accuracy of Physical Activity Self-Report by Body Mass Index Erica T. Warner, Allergy Asthma Proc, 2012 Heart rate and metabolic responses to moderate-intensity aerobic exercise: A comparison of graded walking and ungraded jogging at a constant perceived exertion Marcus Kilpatrick, Journal of Precision Respiratory Medicine, 2009 Powered by Privacy policy Google Analytics settings Article Metrics All Time Past Year Past 30 Days Abstract Views 3642 644 132 Full Text Views 113 13 1 PDF Downloads 113 20 0 PubMed PubMed Citation Sarah Kozey-Keadle John Staudenmayer Amanda Libertine Marianna Mavilia Kate Lyden Barry Braun Patty Freedson Similar articles in PubMed Google Scholar Sarah Kozey-Keadle John Staudenmayer Amanda Libertine Marianna Mavilia Kate Lyden Barry Braun Patty Freedson Similar articles in Google Scholar Cited By Publications Citing This Document You are looking at\n    \t\t\t\t\t1-35 \n    \t\t\t\t\tof\n    \t\t\t\t\t35\n    \t\t\t\t\tcitations [1] SWIFT, DAMON L., NEVELS, TYARA R., SOLAR, CHELSEY A., BROPHY, PATRICIA M., MCGEE, JOSHUA E., BREWER, SAVANNA B., CLARK, ANGELA, HOUMARD, JOSEPH A., and LUTES, LESLEY D., 2021, \"The Effect of Aerobic Training and Increasing Nonexercise Physical Activity on Cardiometabolic Risk Factors\" Medicine & Science in Sports & Exercise Vol. 53, No. 10, pp 2152, 1530-0315 Crossref [2] Myers, Anna, Dalton, Michelle, Gibbons, Catherine, Finlayson, Graham, and Blundell, John, 2019, \"Structured, aerobic exercise reduces fat mass and is partially compensated through energy intake but not energy expenditure in women\" Physiology & Behavior Vol. Zhong, Rou, Liu, Shishi, Li, Haocheng, and Zhang, Jingxiao, 2022, \"Functional principal component analysis estimator for non-Gaussian data\" Journal of Statistical Computation and Simulation pp 1, 1563-5163 Crossref [7] Dibben, Grace O, Hillsdon, Melvyn, Dalal, Hasnain M, Tang, Lars H, Doherty, Patrick Joseph, and Taylor, Rod, 2023, \"Home-based cardiac rehabilitation and physical activity in people with heart failure: a secondary analysis of the REACH-HF randomised controlled trials\" BMJ Open Vol. 13, No. 2, pp e063284, 2044-6055 Crossref [8] Xu, T., Liu, C.Y., Tao, Y.X., Cai, X.T., Wu, Y.Y., Chen, R., Xiao, T., and Liu, M.Y., 2025, \"Effects of a goal attainment theory-based intervention on physical activity, body composition, and motivation in emerging adults with physical inactivity: A randomized controlled trial\" Public Health Vol."
    },
    {
        "title": "Definitions of sedentary in physical-activity-intervention trials: a summary of the literature",
        "abstract": "Definitions of Sedentary in Physical-Activity-Intervention Trials: A Summary of the Literature in: Journal of Aging and Physical Activity Volume 14 Issue 4 (2006) Jump to Content This site uses cookies, tags, and tracking settings to store information to help give you the very best browsing experience. Dismiss this warning User Account Sign in to save searches and organize your favorite content. Not registered? Sedentary Time in Adults Madeline E. Shivgulam, Journal for the Measurement of Physical Behaviour, 2024 Reported Physical Activity and Sedentary Behavior: Why Do You Ask? Richard P. Troiano, Journal of Physical Activity and Health, 2012 Refinement of the Habitual Physical Activity Index for Use With American Adults Karyl J. Burns, Animal Welfare Individuals Receiving Inpatient Rehabilitation Show the Highest Objectively Measured Physical Activity Level During OT Young Joo Kim, American Journal of Occupational Therapy, 2022 Sedentary Behavior and Perceived Occupational Performance Following Goal-Based Interventions Among Community-Dwelling Older Adults Allison Naber, American Journal of Occupational Therapy, 2021 Letter to the Editor Thajus Asirvatham, American Journal of Occupational Therapy, 2024 Impact of OT Intervention on Sedentary Behaviors Among Office Workers Allison Naber, American Journal of Occupational Therapy Powered by Privacy policy Google Analytics settings Article Metrics All Time Past Year Past 30 Days Abstract Views 4714 985 202 Full Text Views 72 13 1 PDF Downloads 67 11 0 PubMed PubMed Citation Jill A. Bennett Kerri Winters-Stone Lillian M. Nail Jennifer Scherer Similar articles in PubMed Google Scholar Jill A. Bennett Kerri Winters-Stone Lillian M. Nail Jennifer Scherer Similar articles in Google Scholar Cited By Publications Citing This Document You are looking at\n    \t\t\t\t\t1-31 \n    \t\t\t\t\tof\n    \t\t\t\t\t31\n    \t\t\t\t\tcitations [1] Berner, Karina, Gouelle, Arnaud, Strijdom, Hans, Essop, M Faadiel, Webster, Ingrid, and Louw, Quinette, 2021, \"Mobility Deviations in Adults With Human Immunodeficiency Virus: A Cross-Sectional Assessment Using Gait Analysis, Functional Performance, and Self-Report\" Open Forum Infectious Diseases Vol. 8, No. and Gustafsson, Per E., 2018, \"Time trends in absolute and relative socioeconomic inequalities in leisure time physical inactivity in northern Sweden\" Scandinavian Journal of Public Health Vol. 46, No. 1, pp 112, 1651-1905 Crossref [11] Marcotte-Chénard, A., Tremblay, R., Deslauriers, L., Geraldes, P., Gayda, M., Christou, D., Mampuya, W., Little, J.P., and Riesco, E., 2023, \"Comparison of 10 × 1-minute high-intensity interval training (HIIT) versus 4 × 4-minute HIIT on glucose control and variability in females with type 2 diabetes\" Applied Physiology, Nutrition, and Metabolism 1715-5320 Crossref [12] Chastin, Sebastein F.M., Baker, Katherine, Jones, Diana, Burn, David, Granat, Malcolm H., and Rochester, Lynn, 2010, \"The pattern of habitual sedentary behavior is different in advanced Parkinson's disease\" Movement Disorders Vol."
    },
    {
        "title": "Effects of short versus long bouts of aerobic exercise in sedentary women with fibromyalgia: a randomized controlled trial",
        "abstract": "Effects of Short Versus Long Bouts of Aerobic Exercise in Sedentary Women With Fibromyalgia: A Randomized Controlled Trial | Physical Therapy | Oxford Academic Skip to Main Content Advertisement Journals Books Search Menu Menu Sign in through your institution Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Mobile Enter search term Search Issues Subject Acute care Animal Research Cardiovascular/Pulmonary COVID-19 Education Geriatrics Health Services Health Policy Health Promotion History of Physical Therapy Implementation Science Integumentary Metabolic Musculoskeletal Neurology Oncology Orthopedics Pain Management Pediatrics Pelvic Health Pharmacology Population Health Professional Issues Psychosocial More Content Advance Articles Podcasts Videos PTJ Peer Review Resources Collections Submit Author Guidelines Submission Site Why Publish With PTJ? Open Access Call for Papers Self-Archiving Policy Promote your Article Purchase Alerts About About Physical Therapy Editorial Board Media Kit Advertising & Corporate Services Permissions Journals on Oxford Academic Books on Oxford Academic Close Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Enter search term Search Advanced Search Search Menu Article Navigation Close mobile search navigation Article Navigation Volume 83 Issue 4 1 April 2003 Comments (0) < Previous Next > Article Navigation Article Navigation Journal Article Effects of Short Versus Long Bouts of Aerobic Exercise in Sedentary Women With Fibromyalgia: A Randomized Controlled Trial Get access Candice L Schachter, Candice L Schachter 1 CL Schachter, PT, PhD, is Associate Professor, School of Physical Therapy, University of Saskatchewan, 1121 College Dr, Saskatoon, Saskatchewan, S7N 0W3 Canada. * Address all correspondence to Dr Schachter Search for other works by this author on: Oxford Academic Google Scholar Angela J Busch, Angela J Busch 2 AJ Busch, PT, MSc, is Associate Professor, School of Physical Therapy, University of Saskatchewan, Saskatoon, Saskatchewan Search for other works by this author on: Oxford Academic Google Scholar Paul M Peloso, Paul M Peloso 3 PM Peloso, MD, is Associate Professor of Internal Medicine and Staff Rheumatologist, University of Iowa Health Care, Iowa City, Iowa Search for other works by this author on: Oxford Academic Google Scholar M Suzanne Sheppard M Suzanne Sheppard 4 MS Sheppard, PT, PhD, ACSM Exercise Specialist, is Professional Leader of Physical Therapy for Saskatoon Health Region, Saskatoon, Saskatchewan, Canada Search for other works by this author on: Oxford Academic Google Scholar Physical Therapy, Volume 83, Issue 4, 1 April 2003, Pages 340–358, https://doi.org/10.1093/ptj/83.4.340 Published: 01 April 2003 Article history Received: 08 May 2002 Accepted: 22 November 2002 Published: 01 April 2003 Views Article contents Cite Cite Candice L Schachter, Angela J Busch, Paul M Peloso, M Suzanne Sheppard,  Effects of Short Versus Long Bouts of Aerobic Exercise in Sedentary Women With Fibromyalgia: A Randomized Controlled Trial, Physical Therapy, Volume 83, Issue 4, 1 April 2003, Pages 340–358, https://doi.org/10.1093/ptj/83.4.340 Close Permissions Icon Permissions Share Icon Share Facebook Twitter LinkedIn Email Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Mobile Enter search term Search Close Navbar Search Filter Physical Therapy This issue Physiotherapy Books Journals Oxford Academic Enter search term Search Advanced Search Search Menu Abstract Background and Purpose. and self-efficacy (posttest, efficacy analysis). Exercise adherence was greater for the LBE group than for the SBE group between weeks 5 and 8 of the training program. No other differences between exercise groups were found."
    },
    {
        "title": "Programming pre-exercise snacks to prevent post-exercise hypoglycemia in intensively treated insulin-dependent diabetics",
        "abstract": "www.acpjournals.org This page isn’t working www.acpjournals.org didn’t send any data. ERR_EMPTY_RESPONSE null Reload www.acpjournals.org didn’t send any data."
    },
    {
        "title": "Can short bouts of exercise (“exercise snacks”) improve body composition in adolescents with type 1 diabetes? A feasibility study",
        "abstract": "Can Short Bouts of Exercise (“Exercise Snacks”) Improve Body Composition in Adolescents with Type 1 Diabetes? A Feasibility Study | Hormone Research in Paediatrics | Karger Publishers Consent to Cookies & Data processing On this website we use cookies and similar functions to process end device information and personal data. The processing is used for purposes such as to integrate content, external services and elements from third parties, statistical analysis/measurement, personalized advertising and the integration of social media. enhanced tissue glucose uptake. The purpose of the current study therefore was to determine the feasibility of a novel form of exercise (“exercise snacks,” that is, short bouts of exercise spread throughout the day) with or without a supplemental amino acid, glutamine, and its impact on blood glucose homeostasis and body composition in adolescents with T1D. Methods: Twelve sedentary adolescents with T1D (HbA1 c 8.1 ± 0.6%) performed exercise snacks (6 × 1 min of resistance-based activities) 3 times daily for 3 months; in addition, they were randomized to consume a drink containing either placebo or glutamine (0.5 g/kg/day). Insulin and Adjunctive Treatments in Children and Adolescents with Diabetes Related Articles Online ISSN 1663-2826 Print ISSN 1663-2818 INFORMATION Contact & Support Information & Downloads Rights & Permissions Terms & Conditions Catalogue & Pricing Policies & Information ABOUT US Company People & Organization Newsroom Careers Stay Up-to-Date Regional Offices Community Voice SERVICES"
    },
    {
        "title": "Balance in single-limb stance in healthy subjects–reliability of testing procedure and the effect of short-duration sub-maximal cycling",
        "abstract": "Home BMC Musculoskeletal Disorders Article Balance in single-limb stance in healthy subjects – reliability of testing procedure and the effect of short-duration sub-maximal cycling Research article Open access Published: 27 June 2003 Volume 4, article number 14, ( 2003 ) Cite this article Download PDF You have full access to this open access article BMC Musculoskeletal Disorders Aims and scope Submit manuscript Balance in single-limb stance in healthy subjects – reliability of testing procedure and the effect of short-duration sub-maximal cycling Download PDF Eva Ageberg 1, 3, David Roberts 2, Eva Holmström 3 & … Thomas Fridén 2 Show authors 16k Accesses 1 Altmetric Explore all metrics Abstract Background To assess balance in single-limb stance, center of pressure movements can be registered by stabilometry with force platforms. This can be used for evaluation of injuries to the lower extremities. It is important to ensure that the assessment tools we use in the clinical setting and in research have minimal measurement error. by exercising the lower extremities isolated in an isokinetic device. Studies of balance in single-limb stance are of importance since movement patterns of postural control are similar during the stance phase, and many injuries to the lower extremities occur during weight-bearing on one leg [ 12 ]. The effect of general fatigue on balance in single-limb stance in healthy subjects has, to our knowledge, only been investigated in one study [ 9 ]. pressure (CP) in the frontal plane (FP) and sagittal plane (SP) were recorded for 25 s at a sampling frequency of 20 Hz. In bilateral stance, a frequency of CP below 1–3 Hz has been found in healthy subjects [ 22 ]. A center frequency value of CP below 2 Hz has been observed in single-limb stance in the frontal plane in uninjured subjects and in individuals with functional instability of the ankle [ 23 ]. was stopped when the subjects had reached a heart rate exceeding 60% of the predicted HR max, perceived the exercise as hard or very hard (values of 14–17 on the RPE scale), and had reached steady-state heart rate; i.e., after approximately 5 min. The exercise on the stationary bicycle took place beside the force platform, so that the test after exercise could be commenced within 10 s. Statistical analysis Since no statistically significant difference was found between the right and left legs in the stabilometric variables, the average of the right and left legs; i.e., (right+left)/2, for each stabilometric variable was used for statistical analyses. The use of the mean value of both legs when performing parametric statistics can be questioned, since this may affect the data variability. of agreement (LOA). The differences between test sessions 1 and 2 (test 2 minus test 1) plotted against their mean for each subject for the number of movements exceeding 5 mm (DEV 5) in the frontal plane (FP) in 42 healthy subjects, together with the 95% confidence interval (CI) and the 95% LOA. Full size image Figure 7 Bland and Altman graph with limits of agreement (LOA)."
    },
    {
        "title": "Evaluation of a New Physical Exercise Taken from Salat (Prayer) as a Short-Duration and Frequent Physical Activity in the Rehabilitation of Geriatric and Disabled …",
        "abstract": "www.annsaudimed.net This page isn’t working www.annsaudimed.net didn’t send any data. ERR_EMPTY_RESPONSE null Reload www.annsaudimed.net didn’t send any data."
    },
    {
        "title": "Impact of an exercise and walking protocol on quality of life for elderly people with OA of the knee",
        "abstract": "Physiotherapy Research International Volume 8, Issue 3 p. 121-130 Original Article Impact of an exercise and walking protocol on quality of life for elderly people with OA of the knee Rosângela Corrêa Dias, Corresponding Author Rosângela Corrêa Dias rosandi@metalink.com.br Physical Therapy Department, Federal University of Minas Gerais, Belo Horizonte (MG), Brazil Departamento de Fisioterapia — UFMG, Av. Antônio Carlos 6627, Unidade Administrativa II, 3°. andar Belo Horizonte — MG Brazil 31271-970. . Development criteria for the classification and reporting of osteoarthritis—classification of osteoathritis of the knee. Arthritis and Rheumatism 1986 ; 29 : 1039 – 1049.  : 30 – 31. 10.1002/pri.77 CAS PubMed Google Scholar Fransen M, Crosbie J, Edmonds J. Physical therapy is effetive for patients with ostearthritis of the knee. -9536(95)00112-K PubMed Google Scholar Van Baar ME, Assendelft WJ, Dekker J, Oostendorp RA, Bijlsma JW. Effectiveness of exercise therapy in patients with osteoarthritis of the hip or knee: a systematic review of randomized clinical trials. Arthritis and Rheumatism 1999 ; 42 : 1361 – 1369."
    },
    {
        "title": "Efficacy of core muscle strengthening exercise in chronic low back pain patients",
        "abstract": "content.iospress.com This page isn’t working content.iospress.com didn’t send any data. ERR_EMPTY_RESPONSE null Reload content.iospress.com didn’t send any data."
    },
    {
        "title": "Effectiveness of exercise therapy and manipulation on sacroiliac joint dysfunction: a randomized controlled trial",
        "abstract": "Just a moment... www.researchgate.net Verifying you are human. This may take a few seconds. www.researchgate.net needs to review the security of your connection before proceeding."
    },
    {
        "title": "Exploring the potential of technology to promote “exercise snacking” for pre-frail older adults in the home setting: User-Centered Design Study",
        "abstract": "pure.ulster.ac.uk This page isn’t working pure.ulster.ac.uk didn’t send any data. ERR_EMPTY_RESPONSE null Reload pure.ulster.ac.uk didn’t send any data."
    },
    {
        "title": "Perceptions and Experiences of Exercise Snacks Among Middle‐Aged and Older Adults: A Systematic Review and Meta‐Synthesis",
        "abstract": "Public Health Nursing Early View REVIEW SUMMARY Perceptions and Experiences of Exercise Snacks Among Middle-Aged and Older Adults: A Systematic Review and Meta-Synthesis Yunfei Du, Yunfei Du orcid.org/0009-0008-4545-7430 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Ruotong Peng, Ruotong Peng orcid.org/0000-0001-5550-4853 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Xiao Wan, Xiao Wan orcid.org/0000-0002-8164-6588 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Chi Zhang, Chi Zhang Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Yongzhen Guo, Yongzhen Guo Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Jing Chang, Jing Chang Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Hui Feng, Corresponding Author Hui Feng feng.hui@csu.edu.cn Xiangya School of Nursing, Central South University, Changsha, China Oceanwide Health Management Institute, Central South University, Changsha, China National Clinical Research Centre for Geriatric Disorders, Xiangya Hospital, Central South University, Changsha, China Correspondence : Zeng Cao ( caozengxyyy@csu.edu.cn ) | Hui Feng ( feng.hui@csu.edu.cn ) Search for more papers by this author Zeng Cao, Corresponding Author Zeng Cao caozengxyyy@csu.edu.cn Cardiac Rehabilitation Center, Department of Physical Medicine & Rehabilitation, Xiangya Hospital, Central South University, Changsha, China Correspondence : Zeng Cao ( caozengxyyy@csu.edu.cn ) | Hui Feng ( feng.hui@csu.edu.cn ) Search for more papers by this author Yunfei Du, Yunfei Du orcid.org/0009-0008-4545-7430 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Ruotong Peng, Ruotong Peng orcid.org/0000-0001-5550-4853 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Xiao Wan, Xiao Wan orcid.org/0000-0002-8164-6588 Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Chi Zhang, Chi Zhang Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Yongzhen Guo, Yongzhen Guo Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Jing Chang, Jing Chang Xiangya School of Nursing, Central South University, Changsha, China Search for more papers by this author Hui Feng, Corresponding Author Hui Feng feng.hui@csu.edu.cn Xiangya School of Nursing, Central South University, Changsha, China Oceanwide Health Management Institute, Central South University, Changsha, China National Clinical Research Centre for Geriatric Disorders, Xiangya Hospital, Central South University, Changsha, China Correspondence : Zeng Cao ( caozengxyyy@csu.edu.cn ) | Hui Feng ( feng.hui@csu.edu.cn ) Search for more papers by this author Zeng Cao, Corresponding Author Zeng Cao caozengxyyy@csu.edu.cn Cardiac Rehabilitation Center, Department of Physical Medicine & Rehabilitation, Xiangya Hospital, Central South University, Changsha, China Correspondence : Zeng Cao ( caozengxyyy@csu.edu.cn ) | Hui Feng ( feng.hui@csu.edu.cn ) Search for more papers by this author First published: 09 December 2024 https://doi.org/10.1111/phn.13495 Yunfei Du and Ruotong Peng contributed equally to this work and shared the first authorship. Funding : The authors received no specific funding for this work. Read the full text About References Related Information PDF PDF Tools Request permission Export citation Add to favorites Track citation Share Share Give access Share full text access Close modal Share full-text access Please review our Terms and Conditions of Use and check box below to share full-text version of article. friends and colleagues. Learn more. Copy URL Share a link Share on Email Facebook x LinkedIn Reddit Wechat ABSTRACT Background Physical inactivity in middle-aged and older adults is a major health problem. Based Nursing 13, no. 3 : 241 – 249. https://doi.org/10.1111/wvn.12134. 10.1111/wvn.12134 PubMed Web of Science® Google Scholar Cao, W., M. W. Milks, X. Liu, et al. s12877-022-03207-z. 10.1186/s12877-022-03207-z PubMed Google Scholar Fyfe, J. J., D. L. Hamilton, and R. M. Daly. 2022. . 1 : 248. https://doi.org/10.1186/s12877-022-02963-2. 10.1186/s12877-022-02963-2 PubMed Google Scholar Jansons, P., J. J. Fyfe, J. Dalla Via, R. M. Daly, and D. Scott."
    },
    {
        "title": "Snack food reinforcement during work and non-work hours among US office workers",
        "abstract": "Full Text Dissertation or Thesis Snack Food Reinforcement During Work and Non-work Hours Among U.S. Office Workers Larks, Sherise Preview author details . Walden University ProQuest Dissertations & Theses,  2017. 10619411."
    },
    {
        "title": "Effects of subtracting sitting versus adding exercise on glycemic control and variability in sedentary office workers",
        "abstract": "Article Share on Effects of subtracting sitting versus adding exercise on glycemic control and variability in sedentary office workers Authors : Jennifer M. Blankenship, Kirsten Granados, and Barry Braun Authors Info & Affiliations Publication : Applied Physiology, Nutrition, and Metabolism 21 July 2014 https://doi.org/10.1139/apnm-2014-0157 20 457 Metrics Total Citations 20 Last 6 Months 0 Last 12 Months 2 Total Downloads 457 Last 6 Months 19 Last 12 Months 40 Get Access Contents Applied Physiology, Nutrition, and Metabolism Volume 39, Number 11 November 2014 PREVIOUS ARTICLE Different effect of l-NAME treatment on susceptibility to decompression sickness in male and female rats Previous NEXT ARTICLE 1H-NMR analysis of the human urinary metabolome in response to an 18-month multi-component exercise program and calcium–vitamin-D3 supplementation in older men Next Abstract Résumé References Information & Authors Metrics & Citations Get Access References Figures Tables Media Share Abstract Recent evidence suggests that, like adding exercise, reducing sitting time may improve cardiometabolic health. There has not been a direct comparison of the 2 strategies with energy expenditure held constant. The purpose of this study was to compare fasting and postmeal glucose and insulin concentrations in response to a day with frequent breaks from sitting but no exercise versus considerable sitting plus moderate exercise. ) à la fin de la journée de travail et on évalue la concentration interstitielle de glucose tout au long de la journée et durant la nuit par une surveillance continue de la glycémie. D’après des modèles linéaires mixtes de mesures répétées, la surface sous la courbe du glucose et de l’insuline plasmatique suivant le MTT ne diffère pas d’une condition à l’autre. La variation de la glycémie est plus faible dans la condition FLB comparativement à la condition AGW ( p < 0,05) et la durée nocturne de la hausse de glycémie (>7,8 mmol/L) est plus brève après FLB (2,5 ± 2,5 min) qu’après AGW (32,7 ± 16,4 min) et FSB (45,6 ± 29,6 min, p = 0,05). postprandial glucose and insulin responses. Diabetes Care, 35 (5): 976–983. Crossref PubMed Google Scholar Duvivier B.M., Schaper N.C., Bremers M.A., van Crombrugge G., Menheere P.P., Kars M., and Savelberg H.H. Science Google Scholar Matthews C.E., George S.M., Moore S.C., Bowles H.R., Blair A., Park Y., Troiano R.P., et al. 2012. Amount of time spent in sedentary behaviors and cause-specific mortality in US adults. Physiology, Nutrition, and Metabolism. 39 (11):   1286-1293. https://doi.org/10.1139/apnm-2014-0157 Export Citations If you have the appropriate software installed, you can download article citation data to the citation manager of your choice. Simply select your manager software from the list below and click Download."
    },
    {
        "title": "How to Balance Fitness and Busy Life: Tips from Holly Roser",
        "abstract": "Introduction: Finding Balance in the Hustle In today’s fast-paced world, juggling a busy life and maintaining fitness can feel like an impossible task. As a personal trainer in San Mateo, I’ve seen countless clients struggle with this balancing act. But here’s the good news: it’s not only possible to stay fit while managing a hectic schedule, it’s also crucial for your overall well-being and success. the week can save you time and ensure you’re eating nutritious foods. A study in the American Journal of Preventive Medicine found that spending more time on food preparation was associated with higher diet quality. Try this: Prep a large batch of lean protein (like grilled chicken), whole grains, and chopped vegetables. Wellness Given that many of us spend a significant portion of our day at work, incorporating fitness into your work routine can be a game-changer. Stand-Up Desks and Walking Meetings Consider using a stand-up desk or taking walking meetings. A study in the International Journal of Environmental Research and Public Health found that using a stand-up desk can increase energy expenditure and may have positive effects on health."
    },
    {
        "title": "The COVID-19 and Education System: Impact And Strategy",
        "abstract": "No content available for summarization."
    },
    {
        "title": "Lifestyle physical activity interventions: History, short-and long-term effects, and recommendations",
        "abstract": "American Journal of Preventive Medicine Volume 15, Issue 4, November 1998, Pages 398-412 Physical Activity Interventions Lifestyle physical activity interventions : History, short- and long-term effects, and recommendations Author links open overlay panel Andrea L. Dunn PhD a, Ross E. Andersen PhD b, John M. Jakicic PhD c Show more Outline Add to Mendeley Share Cite https://doi.org/10.1016/S0749-3797(98)00084-1 Get rights and content Under a Creative Commons license open archive Abstract Introduction: Lifestyle physical activity interventions have resulted in response to the public health problem of promoting regular amounts of physical activity to the majority of U.S. adults who remain inadequately or completely inactive. These lifestyle interventions allow a person to individualize his/her physical activity programs to include a wide variety of activities that are at least of moderate intensity and to accumulate bouts of these activities in a manner befitting his/her life circumstances. Methods: We reviewed the history of lifestyle physical activity interventions and defined lifestyle physical activity based on this review. converging data on the benefits of lifestyle physical activity from other fields (e.g., behavioral medicine) and other specializations (e.g., obesity research). These fields have not directly influenced the public health recommendations for physical activity but they have played a meaningful role in the conception of lifestyle physical activity interventions. Using Kuhn’s framework, 2 we will illustrate the overlap as well as the divergence of lifestyle physical activity from public health recommendations. United States, and by Magnus and colleagues who found a significant inverse relation between habitual walking, cycling, and gardening with myocardial infarction in a population in The Netherlands. 28 However, it was not until two decades later that evidence had accumulated to demonstrate that moderate amounts and intensities of physical activity could have important health benefits. 3, 5, 24 Also at this time, exercise scientists were reviewing the scientific evidence that formed the basis of exercise prescription guidelines 1, 29 in terms of frequency, intensity, and duration. Social Cognitive theory 48 to enhance self-efficacy and facilitate long-term adherence. Still other researchers 36, 49, 50 combined elements of Social Cognitive, Stages of Motivational Readiness, 51 and Relapse Prevention theories. 52 It was the synthesis of these findings from exercise, behavioral, and obesity research that led to studies comparing lifestyle physical activity with traditional structured exercise. adherence compared to continuous exercise (234 min/week vs. 188 min/week). Both interventions improved fitness. There was a trend for increased weight loss in the intermittent group."
    },
    {
        "title": "Development and feasibility of a brief Zero‐time exercise intervention to reduce sedentary behaviour and enhance physical activity: a pilot trial",
        "abstract": "Health & Social Care in the Community Volume 27, Issue 4 p. e233-e245 ORIGINAL ARTICLE Development and feasibility of a brief Zero-time Exercise intervention to reduce sedentary behaviour and enhance physical activity: A pilot trial Agnes Lai, Agnes Lai orcid.org/0000-0002-7321-2632 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Sunita Stewart, Sunita Stewart orcid.org/0000-0002-0642-781X Department of Psychiatry, University of Texas Southwestern Medical Center at Dallas, Dallas, Texas Search for more papers by this author Alice Wan, Alice Wan orcid.org/0000-0001-5267-1269 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Carol Thomas, Carol Thomas orcid.org/0000-0002-2995-4954 Hong Kong Social Welfare Department, Hong Kong, SAR, China Search for more papers by this author Joyce Tse, Joyce Tse orcid.org/0000-0002-2015-9516 Christian Family Service Centre, Hong Kong, SAR, China Search for more papers by this author Daniel Ho, Daniel Ho orcid.org/0000-0002-3978-7133 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Sophia Chan, Sophia Chan orcid.org/0000-0002-6349-3717 School of Nursing, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Tai-Hing Lam, Corresponding Author Tai-Hing Lam hrmrlth@hku.hk orcid.org/0000-0001-5921-3033 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Correspondence Tai-Hing Lam, School of Public Health, The University of Hong Kong, Hong Kong, SAR, China. Email: hrmrlth@hku.hk Search for more papers by this author Agnes Lai, Agnes Lai orcid.org/0000-0002-7321-2632 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Sunita Stewart, Sunita Stewart orcid.org/0000-0002-0642-781X Department of Psychiatry, University of Texas Southwestern Medical Center at Dallas, Dallas, Texas Search for more papers by this author Alice Wan, Alice Wan orcid.org/0000-0001-5267-1269 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Carol Thomas, Carol Thomas orcid.org/0000-0002-2995-4954 Hong Kong Social Welfare Department, Hong Kong, SAR, China Search for more papers by this author Joyce Tse, Joyce Tse orcid.org/0000-0002-2015-9516 Christian Family Service Centre, Hong Kong, SAR, China Search for more papers by this author Daniel Ho, Daniel Ho orcid.org/0000-0002-3978-7133 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Sophia Chan, Sophia Chan orcid.org/0000-0002-6349-3717 School of Nursing, The University of Hong Kong, Hong Kong, SAR, China Search for more papers by this author Tai-Hing Lam, Corresponding Author Tai-Hing Lam hrmrlth@hku.hk orcid.org/0000-0001-5921-3033 School of Public Health, The University of Hong Kong, Hong Kong, SAR, China Correspondence Tai-Hing Lam, School of Public Health, The University of Hong Kong, Hong Kong, SAR, China. Email: hrmrlth@hku.hk Search for more papers by this author First published: 01 March 2019 https://doi.org/10.1111/hsc.12728 Citations: 9 Funding information This Hong Kong Jockey Club FAMILY Project was supported by The Hong Kong Jockey Club Charities Trust. was developed to reduce sedentary behaviour and increase physical activity. ZTEx refers to the integration of simple strength- and stamina-enhancing physical activity into daily life, which can be done anytime, anywhere and by anyone. This paper presents the development, feasibility, and preliminary evidence for the effectiveness of this intervention under the Hong Kong Jockey Club FAMILY Project. , Mitchell, M. S., & Alter, D. A. ( 2015 ). Sedentary time and its association with risk for disease incidence, mortality, and hospitalization in adults: A systematic review and meta-analysis. .1016/j.amepre.2012.05.010 10.1016/j.amepre.2012.05.010 PubMed Web of Science® Google Scholar Freedman, J. L., & Fraser, S. C. ( 1966 ). Compliance without pressure: The foot-in-the-door technique. Journal of Personality and Social Psychology, 4 ( 2 ), 195 – 202. https://doi.org/10.1037/h0023552 10.1037/h0023552 CAS PubMed Web of Science® Google Scholar Gardiner, P. A., Eakin, E. G., Healy, G. N., & Owen, N. ( 2011 ). Zero-time exercise, a new approach to promote physical activity: A pilot study under Hong Kong Jockey Club FAMILY Project. Paper presented at the The 2016 FPH Annual Conference and Public Health Exhibition, Faculty of Public Health, Brighton, UK. Google Scholar Lee, I. M., Shiroma, E. J., Lobelo, F., Puska, P., Blair, S. N., Katzmarzyk, P. T. ; Lancet Physical Activity Series Working Group."
    },
    {
        "title": "Sedentary lifestyle: overview of updated evidence of potential health risks",
        "abstract": "Korean J Fam Med. 2020 Nov 19;41(6):365–373. doi: 10.4082/kjfm.20.0165 Search in PMC Search in PubMed View in NLM Catalog Add to search Sedentary Lifestyle: Overview of Updated Evidence of Potential Health Risks Jung Ha Park Jung Ha Park 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea Find articles by Jung Ha Park 1, Ji Hyun Moon Ji Hyun Moon 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea 2 Department of Family Medicine, Jeju National University School of Medicine, Jeju, Korea Find articles by Ji Hyun Moon 1, 2, Hyeon Ju Kim Hyeon Ju Kim 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea 2 Department of Family Medicine, Jeju National University School of Medicine, Jeju, Korea Find articles by Hyeon Ju Kim 1, 2, Mi Hee Kong Mi Hee Kong 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea 2 Department of Family Medicine, Jeju National University School of Medicine, Jeju, Korea Find articles by Mi Hee Kong 1, 2, Yun Hwan Oh Yun Hwan Oh 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea 2 Department of Family Medicine, Jeju National University School of Medicine, Jeju, Korea Find articles by Yun Hwan Oh 1, 2, * Author information Article notes Copyright and License information 1 Department of Family Medicine, Jeju National University Hospital, Jeju, Korea 2 Department of Family Medicine, Jeju National University School of Medicine, Jeju, Korea * Corresponding Author: Yun Hwan Oh https://orcid.org/0000-0002-1627-7528 Tel: +82-64-717-8650, Fax: +82-64-757-8276, E-mail: swimayo@gmail.com Received 2020 Jul 15; Accepted 2020 Aug 4; Issue date 2020 Nov.  inactivity, sedentary behavior is also a serious problem, and a substantial number of people engage in it for prolonged periods. For instance, Americans spend 55% of their waking time (7.7 hours a day) engaged in sedentary behaviors whereas Europeans spend 40% of their leisure time (2.7 hours a day) watching television [ 3 ]. Similar patterns have been observed in Koreans, who have been reported to demonstrate long sedentary times. to -0.02; P=0.026), triglyceride level (β, -0.18; 95% CI, -0.34 to -0.02; P=0.029), and 2-hour postprandial plasma glucose level (β, -0.18; 95% CI, -0.34 to -0.02; P=0.025) decreased with increasing the number of breaks in the sedentary time [ 13 ]. Furthermore, when the sedentary time was interrupted with light- or moderate-intensity physical activity, the systolic and diastolic blood pressures dropped by 2–3 mm Hg whereas interrupting the sedentary time with light-intensity physical activity (LIPA) or simple muscle training in patients with diabetes (88% of the population had HTN) decreased the systolic pressure by 14–16 mm Hg and the diastolic pressure by 8–10 mm Hg [ 14 ]. 2.  engaged in frequent physical activity. The relative risk (RR) for all-cause mortality was 30% higher with high physical activity (HR, 1.16; 95% CI, 0.84–1.59) compared to that with low physical activity (HR, 1.46; 95% CI, 1.22–1.75) [ 28 ]. 2.  with obesity and poor health. A heavy vest can increase the score on this, thereby inducing weight loss [ 34 ]. 3."
    },
    {
        "title": "The effect of changes in physical activity on sedentary behavior: results from a randomized lifestyle intervention trial",
        "abstract": "Restricted access Research article First published online November 11, 2015 The Effect of Changes in Physical Activity on Sedentary Behavior: Results From a Randomized Lifestyle Intervention Trial Juned Siddique, DrPH siddique@northwestern.edu, Peter John de Chavez, MS, […], Lynette L. Craft, PhD, Patty Freedson, PhD, and Bonnie Spring, PhD +2 -2 View all authors and affiliations Volume 31, Issue 4 https://doi.org/10.4278/ajhp.150129-QUAN-693 Contents Abstract Get access More Cite article Share options Information, rights and permissions Metrics and citations Abstract Purpose. To investigate whether changes in physical activity (PA) have an impact on sedentary behavior (SB) during a lifestyle intervention. Design. greenway exposure reduces sedentary behavior: A natural ex... Go to citation Crossref Google Scholar Joint modeling the frequency and duration of accelerometer‐measured ph... Go to citation Crossref Google Scholar Agreement between Accelerometer-Assessed and Self-Reported Physical Ac... Go to citation Crossref Google Scholar Exploring activity compensation amongst youth and adults: a systematic... Go to citation Crossref Google Scholar Where Does the Time Go? Displacement of Device-Measured Sedentary Time... Go to citation Crossref Google Scholar The Temporal Relationships Between 24-h Movement Behaviors Among Child... Go to citation Crossref Google Scholar Factors Associated with Physical Activity in Jordanian Older People Go to citation Crossref Google Scholar Interventions for reducing sedentary behaviour in community-dwelling o... Go to citation Crossref Google Scholar The Effect of a Physical Activity Coaching Intervention on Acceleromet... Go to citation Crossref Google Scholar Comparing Accelerometer and Self-Reported Treatment Effects in a Techn... Go to citation Crossref Google Scholar Factors Associated with Sedentary Behavior and Moderate to Vigorous Ph... Go to citation Crossref Google Scholar Interventions outside the workplace for reducing sedentary behaviour i... Go to citation Crossref Google Scholar Sedentary behavior after breast cancer: motivational, demographic, dis... Go to citation Crossref Google Scholar Breast cancer survivors reduce accelerometer-measured sedentary time i... Go to citation Crossref Google Scholar Sedentary behavior and physical activity in cardiac rehabilitation par... Go to citation Crossref Google Scholar Association between age at onset of independent walking and objectivel... Go to citation Crossref Google Scholar Nutrition Research Special Issue and an Interview With Marion Nestle b... Go to citation Crossref Google Scholar Pub Med Moderating Effects of Weather-Related Factors on a Physical Activity I... Go to citation Crossref Google Scholar Figures and tables Figures & Media Tables Figures & Media Tables Get access Get access Access options If you have access to journal content via a personal subscription, university, library, employer or society, select from the options below: Sage Journals profile I am signed in as: View my profile Sign out I can access personal subscriptions, purchases, paired institutional access and free tools such as favourite journals, email alerts and saved searches. Login failed. Older Adults: A Review of the Look AHEAD Trial Show details Hide details Craig A. Johnston American Journal of Lifestyle Medicine Jun 2012 Restricted access Effectiveness of lifestyle intervention on prevention/management of antipsychotic-induced weight gain among persons with severe mental illness: A systematic review and meta-analysis Show details Hide details Krutideepa Mohanty and more... Journal of Health Psychology Jan 2024 View more Sage recommends: SAGE Knowledge Entry Diabetes Mellitus and Lifestyle Show details Hide details Mary Beth Weber Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Adherence Show details Hide details Kathryn M. Ross and more... Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Alzheimer's Disease Show details Hide details Nancy B. Emerson Lombardo Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Book chapter Introduction, Definitions, and Plan of the Book Show details Hide details James F. Sallis and more... Physical Activity & Behavioral Medicine 1999 SAGE Knowledge Entry Physical Activity Guidelines and Recommendations Show details Hide details Russell Pate and more... Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Book chapter Physical Activity Interventions with Individuals Show details Hide details James F. Sallis and more... Physical Activity & Behavioral Medicine 1999 SAGE Knowledge Entry Obesity, Lifestyle Management of Show details Hide details John P. Foreyt and more... Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Community Prevention Programs Show details Hide details David L. Katz and more... Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Physical Activity Interventions Show details Hide details Shannon Q. Hurtz and more... Encyclopedia of Health and Behavior 2004 View more Sage recommends: SAGE Knowledge Entry Diabetes Mellitus and Lifestyle Show details Hide details Mary Beth Weber Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Adherence Show details Hide details Kathryn M. Ross and more... Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Entry Alzheimer's Disease Show details Hide details Nancy B. Emerson Lombardo Encyclopedia of Lifestyle Medicine & Health 2012 SAGE Knowledge Book chapter Introduction, Definitions, and Plan of the Book Show details Hide details James F. Sallis and more..."
    },
    {
        "title": "Barriers and enablers associated with participation in a home-based pragmatic exercise snacking program in older adults delivered and monitored by Amazon Alexa …",
        "abstract": "Home Aging Clinical and Experimental Research Article Barriers and enablers associated with participation in a home-based pragmatic exercise snacking program in older adults delivered and monitored by Amazon Alexa: a qualitative study Original Article Open access Published: 17 January 2023 Volume 35, pages 561–569, ( 2023 ) Cite this article Download PDF You have full access to this open access article Aging Clinical and Experimental Research Aims and scope Submit manuscript Barriers and enablers associated with participation in a home-based pragmatic exercise snacking program in older adults delivered and monitored by Amazon Alexa: a qualitative study Download PDF Paul Jansons ORCID: orcid.org/0000-0002-8766-0516 1, 2, Jackson J. Fyfe 1, Jack Dalla Via 1, 3, Robin M. Daly 1 & … David Scott 1, 2 Show authors 3890 Accesses 8 Altmetric Explore all metrics This article has been updated Abstract Background ‘Exercise snacking’, which is characterised by shorter and more frequent exercise bouts compared with traditional exercise guidelines, may be an acceptable strategy for increasing physical activity and reducing sedentary behaviour in older adults. Aim The aim of this study was to evaluate the enablers and barriers for older adults associated with participation in a home-based exercise snacking program delivered and monitored using an Amazon Echo Show 5 device (Alexa). Methods This study used an interpretive description qualitative design to conduct semi-structured interviews following a 12-week pilot study in 15 adults aged 60–89 years with at least one chronic condition. undertaking a 4-week, twice-daily exercise snacking program, with no adverse events reported [ 11 ]. To our knowledge, only one qualitative study has explored the barriers and enablers to participating in an exercise snacking program [ 14 ]. Thirty-one healthy inactive adults aged 21–71 years reported that greater flexibility, convenience, and easier integration into activities of daily living were enablers to facilitate adherence in a five day only exercise snacking program. the home-based exercise snacking intervention (S1). The study investigator asked further questions where necessary to clarify or obtain further information based on participant responses. All interviews were digitally voice recorded and were transcribed verbatim by a transcribing company ( www.transcribeme.com TranscribeMe Inc). twice per day for the first four weeks of the intervention, three times per day for the second four weeks, and four times per day for the final four weeks) may facilitate greater adherence. “The design of the exercise is excellent. I mean the first month I do two sets of exercises and the second month three sets and the fourth and then the third month, four sets of exercises. throughout the day. There’s just too many other things going on. Sometimes I was just unable to do them at all, I was away visiting my daughter in the country."
    }
]